<!DOCTYPE html>
<html>
<!-- Created by GNU Texinfo 7.0.3, https://www.gnu.org/software/texinfo/ -->
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Data Types and Structures (Maxima 5.47.0 Manual)</title>

<meta name="description" content="Data Types and Structures (Maxima 5.47.0 Manual)">
<meta name="keywords" content="Data Types and Structures (Maxima 5.47.0 Manual)">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="makeinfo">
<meta name="viewport" content="width=device-width,initial-scale=1">

<link href="maxima_toc.html" rel="start" title="Top">
<link href="Function-and-Variable-Index.html" rel="index" title="Function and Variable Index">
<link href="maxima_toc.html#SEC_Contents" rel="contents" title="Table of Contents">
<link href="maxima_toc.html" rel="up" title="Top">
<link href="maxima_5.html#Expressions" rel="next" title="Expressions">
<link href="maxima_3.html#Command-Line" rel="prev" title="Command Line">
<style type="text/css">
<!--
a.copiable-link {visibility: hidden; text-decoration: none; line-height: 0em}
div.example {margin-left: 3.2em}
span:hover a.copiable-link {visibility: visible}
strong.def-name {font-family: monospace; font-weight: bold; font-size: larger}
ul.mark-bullet {list-style-type: disc}
body {color: black; background: white;  margin-left: 8%; margin-right: 13%;
      font-family: "FreeSans", sans-serif}
h1 {font-size: 150%; font-family: "FreeSans", sans-serif}
h2 {font-size: 125%; font-family: "FreeSans", sans-serif}
h3 {font-size: 100%; font-family: "FreeSans", sans-serif}
a[href] {color: rgb(0,0,255); text-decoration: none;}
a[href]:hover {background: rgb(220,220,220);}
div.textbox {border: solid; border-width: thin; padding-top: 1em;
    padding-bottom: 1em; padding-left: 2em; padding-right: 2em}
div.titlebox {border: none; padding-top: 1em; padding-bottom: 1em;
    padding-left: 2em; padding-right: 2em; background: rgb(200,255,255);
    font-family: sans-serif}
div.synopsisbox {
    border: none; padding-top: 1em; padding-bottom: 1em; padding-left: 2em;
    padding-right: 2em; background: rgb(255,220,255);}
pre.example {border: 1px solid rgb(180,180,180); padding-top: 1em;
    padding-bottom: 1em; padding-left: 1em; padding-right: 1em;
    background-color: rgb(238,238,255)}
div.spacerbox {border: none; padding-top: 2em; padding-bottom: 2em}
div.image {margin: 0; padding: 1em; text-align: center}
div.categorybox {border: 1px solid gray; padding-top: 1em; padding-bottom: 1em;
    padding-left: 1em; padding-right: 1em; background: rgb(247,242,220)}
img {max-width:80%; max-height: 80%; display: block; margin-left: auto; margin-right: auto}

-->
</style>

<script type='text/javascript'>
MathJax = {
  options: {
    skipHtmlTags: {'[-]': ['pre']},
    ignoreHtmlClass: 'tex2jax_ignore',
    processHtmlClass: 'tex2jax_process'
  },
};
</script><script type="text/javascript" id="MathJax-script" async
  src="https://cdn.jsdelivr.net/npm/mathjax@3/es5/tex-svg.js">
</script>
</head>

<body lang="en" class="tex2jax_ignore">
<div class="chapter-level-extent" id="Data-Types-and-Structures">
<div class="nav-panel">
<p>
Next: <a href="maxima_5.html#Expressions" accesskey="n" rel="next">Expressions</a>, Previous: <a href="maxima_3.html#Command-Line" accesskey="p" rel="prev">Command Line</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="Table of contents" rel="contents">Contents</a>][<a href="Function-and-Variable-Index.html" title="Index" rel="index">Index</a>]</p>
</div>
<h2 class="chapter" id="Data-Types-and-Structures-1">5 Data Types and Structures</h2>

<a class="anchor" id="Item_003a-DataTypes_002fnode_002fNumbers"></a><ul class="mini-toc">
<li><a href="#Numbers" accesskey="1">Numbers</a></li>
<li><a href="#Strings" accesskey="2">Strings</a></li>
<li><a href="#Constants" accesskey="3">Constants</a></li>
<li><a href="#Lists" accesskey="4">Lists</a></li>
<li><a href="#Arrays" accesskey="5">Arrays</a></li>
<li><a href="#Structures" accesskey="6">Structures</a></li>
</ul>
<hr>
<div class="section-level-extent" id="Numbers">
<div class="nav-panel">
<p>
Next: <a href="#Strings" accesskey="n" rel="next">Strings</a>, Previous: <a href="#Data-Types-and-Structures" accesskey="p" rel="prev">Data Types and Structures</a>, Up: <a href="#Data-Types-and-Structures" accesskey="u" rel="up">Data Types and Structures</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="Table of contents" rel="contents">Contents</a>][<a href="Function-and-Variable-Index.html" title="Index" rel="index">Index</a>]</p>
</div>
<h3 class="section" id="Numbers-1">5.1 Numbers</h3>


<a class="anchor" id="Item_003a-DataTypes_002fnode_002fIntroduction-to-Numbers"></a><ul class="mini-toc">
<li><a href="#Introduction-to-Numbers" accesskey="1">Introduction to Numbers</a></li>
<li><a href="#Functions-and-Variables-for-Numbers" accesskey="2">Functions and Variables for Numbers</a></li>
</ul>
<hr>
<div class="subsection-level-extent" id="Introduction-to-Numbers">
<div class="nav-panel">
<p>
Next: <a href="#Functions-and-Variables-for-Numbers" accesskey="n" rel="next">Functions and Variables for Numbers</a>, Previous: <a href="#Numbers" accesskey="p" rel="prev">Numbers</a>, Up: <a href="#Numbers" accesskey="u" rel="up">Numbers</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="Table of contents" rel="contents">Contents</a>][<a href="Function-and-Variable-Index.html" title="Index" rel="index">Index</a>]</p>
</div>
<h4 class="subsection" id="Introduction-to-Numbers-1">5.1.1 Introduction to Numbers</h4>

<h4 class="subheading" id="Complex-numbers">Complex numbers</h4>

<p>A complex expression is specified in Maxima by adding the real part of the
expression to <code class="code">%i</code> times the imaginary part.  Thus the roots of the
equation <code class="code">x^2 - 4*x + 13 = 0</code> are <code class="code">2 + 3*%i</code> and <code class="code">2 - 3*%i</code>.
Note that simplification of products of complex expressions can be effected by
expanding the product.  Simplification of quotients, roots, and other functions
of complex expressions can usually be accomplished by using the <code class="code">realpart</code>,
<code class="code">imagpart</code>, <code class="code">rectform</code>, <code class="code">polarform</code>, <code class="code">abs</code>, <code class="code">carg</code>
functions.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Complex-variables">Complex variables</a>
&middot;
</div>

<a class="anchor" id="Item_003a-DataTypes_002fnode_002fFunctions-and-Variables-for-Numbers"></a><hr>
</div>
<div class="subsection-level-extent" id="Functions-and-Variables-for-Numbers">
<div class="nav-panel">
<p>
Previous: <a href="#Introduction-to-Numbers" accesskey="p" rel="prev">Introduction to Numbers</a>, Up: <a href="#Numbers" accesskey="u" rel="up">Numbers</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="Table of contents" rel="contents">Contents</a>][<a href="Function-and-Variable-Index.html" title="Index" rel="index">Index</a>]</p>
</div>
<h4 class="subsection" id="Functions-and-Variables-for-Numbers-1">5.1.2 Functions and Variables for Numbers</h4>

<a class="anchor" id="bfloat"></a><a class="anchor" id="Item_003a-DataTypes_002fdeffn_002fbfloat"></a><dl class="first-deffn">
<dt class="deffn" id="index-bfloat"><span class="category-def">Function: </span><span><strong class="def-name">bfloat</strong> <var class="def-var-arguments">(<var class="var">expr</var>)</var><a class="copiable-link" href='#index-bfloat'> &para;</a></span></dt>
<dd>
<p><code class="code">bfloat</code> replaces integers, rationals, floating point numbers, and some symbolic constants
in <var class="var">expr</var> with bigfloat (variable-precision floating point) numbers.
</p>
<p>The constants <code class="code">%e</code>, <code class="code">%gamma</code>, <code class="code">%phi</code>, and <code class="code">%pi</code>
are replaced by a numerical approximation.
However, <code class="code">%e</code> in <code class="code">%e^x</code> is not replaced by a numeric value
unless <code class="code">bfloat(x)</code> is a number.
</p>
<p><code class="code">bfloat</code> also causes numerical evaluation of some built-in functions,
namely trigonometric functions, exponential functions, <code class="code">abs</code>, and <code class="code">log</code>.
</p>
<p>The number of significant digits in the resulting bigfloats is specified by the
global variable <code class="code"><a class="ref" href="#fpprec">fpprec</a></code>.
Bigfloats already present in <var class="var">expr</var> are replaced with values which have
precision specified by the current value of <code class="code"><a class="ref" href="#fpprec">fpprec</a></code>.
</p>
<p>When <code class="code"><a class="ref" href="#float2bf">float2bf</a></code> is <code class="code">false</code>, a warning message is printed when
a floating point number is replaced by a bigfloat number with less precision.
</p>
<p>Examples:
</p>
<p><code class="code">bfloat</code> replaces integers, rationals, floating point numbers, and some symbolic constants
in <var class="var">expr</var> with bigfloat numbers.
</p>
<div class="example">
<pre class="example-preformatted">(%i1) bfloat([123, 17/29, 1.75]);
(%o1)        [1.23b2, 5.862068965517241b-1, 1.75b0]
(%i2) bfloat([%e, %gamma, %phi, %pi]);
(%o2) [2.718281828459045b0, 5.772156649015329b-1, 
                        1.618033988749895b0, 3.141592653589793b0]
(%i3) bfloat((f(123) + g(h(17/29)))/(x + %gamma));
         1.0b0 (g(h(5.862068965517241b-1)) + f(1.23b2))
(%o3)    ----------------------------------------------
                    x + 5.772156649015329b-1
</pre></div>

<p><code class="code">bfloat</code> also causes numerical evaluation of some built-in functions.
</p>
<div class="example">
<pre class="example-preformatted">(%i1) bfloat(sin(17/29));
(%o1)                 5.532051841609784b-1
(%i2) bfloat(exp(%pi));
(%o2)                  2.314069263277927b1
(%i3) bfloat(abs(-%gamma));
(%o3)                 5.772156649015329b-1
(%i4) bfloat(log(%phi));
(%o4)                 4.812118250596035b-1
</pre></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Numerical-evaluation">Numerical evaluation</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="bfloatp"></a><a class="anchor" id="Item_003a-DataTypes_002fdeffn_002fbfloatp"></a><dl class="first-deffn">
<dt class="deffn" id="index-bfloatp"><span class="category-def">Function: </span><span><strong class="def-name">bfloatp</strong> <var class="def-var-arguments">(<var class="var">expr</var>)</var><a class="copiable-link" href='#index-bfloatp'> &para;</a></span></dt>
<dd>
<p>Returns <code class="code">true</code> if <var class="var">expr</var> is a bigfloat number, otherwise <code class="code">false</code>.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Numerical-evaluation">Numerical evaluation</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Predicate-functions">Predicate functions</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="bftorat"></a><a class="anchor" id="Item_003a-DataTypes_002fdefvr_002fbftorat"></a><dl class="first-defvr">
<dt class="defvr" id="index-bftorat"><span class="category-def">Option variable: </span><span><strong class="def-name">bftorat</strong><a class="copiable-link" href='#index-bftorat'> &para;</a></span></dt>
<dd><p>Default value: <code class="code">false</code>
</p>
<p><code class="code">bftorat</code> controls the conversion of bfloats to rational numbers.  When
<code class="code">bftorat</code> is <code class="code">false</code>, <code class="code"><a class="ref" href="#ratepsilon">ratepsilon</a></code> will be used to control the
conversion (this results in relatively small rational numbers).  When
<code class="code">bftorat</code> is <code class="code">true</code>, the rational number generated will accurately
represent the bfloat.
</p>
<p>Note: <code class="code">bftorat</code> has no effect on the transformation to rational numbers
with the function <code class="code"><a class="ref" href="#rationalize">rationalize</a></code>.
</p>
<p>Example:
</p>
<div class="example">
<pre class="example-preformatted">(%i1) ratepsilon:1e-4;
(%o1)                         1.0e-4
(%i2) rat(bfloat(11111/111111)), bftorat:false;
`rat' replaced 9.99990999991B-2 by 1/10 = 1.0B-1
                               1
(%o2)/R/                       --
                               10
(%i3) rat(bfloat(11111/111111)), bftorat:true;
`rat' replaced 9.99990999991B-2 by 11111/111111 = 9.99990999991B-2
                             11111
(%o3)/R/                     ------
                             111111
</pre></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Numerical-evaluation">Numerical evaluation</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="bftrunc"></a><a class="anchor" id="Item_003a-DataTypes_002fdefvr_002fbftrunc"></a><dl class="first-defvr">
<dt class="defvr" id="index-bftrunc"><span class="category-def">Option variable: </span><span><strong class="def-name">bftrunc</strong><a class="copiable-link" href='#index-bftrunc'> &para;</a></span></dt>
<dd><p>Default value: <code class="code">true</code>
</p>
<p><code class="code">bftrunc</code> causes trailing zeroes in non-zero bigfloat numbers not to be
displayed.  Thus, if <code class="code">bftrunc</code> is <code class="code">false</code>, <code class="code">bfloat (1)</code>
displays as <code class="code">1.000000000000000B0</code>.  Otherwise, this is displayed as
<code class="code">1.0B0</code>.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Numerical-evaluation">Numerical evaluation</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="bigfloat_005fbits"></a><a class="anchor" id="Item_003a-DataTypes_002fdeffn_002fbigfloat_005fbits"></a><dl class="first-deffn">
<dt class="deffn" id="index-bigfloat_005fbits"><span class="category-def">Function: </span><span><strong class="def-name">bigfloat_bits</strong> <var class="def-var-arguments">()</var><a class="copiable-link" href='#index-bigfloat_005fbits'> &para;</a></span></dt>
<dd><p>Returns the number of bits of precision in a bigfloat number.  This
value depends, of course, on the value of <code class="code"><a class="ref" href="#fpprec">fpprec</a></code>. 
</p>
<div class="example">
<pre class="example-preformatted">(%i1) fpprec:16;
(%o1)                                 16
(%i2) bigfloat_bits();
(%o2)                                 56
(%i3) fpprec:32;
(%o3)                                 32
(%i4) bigfloat_bits();
(%o4)                                 109
</pre></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Numerical-evaluation">Numerical evaluation</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="bigfloat_005feps"></a><a class="anchor" id="Item_003a-DataTypes_002fdeffn_002fbigfloat_005feps"></a><dl class="first-deffn">
<dt class="deffn" id="index-bigfloat_005feps"><span class="category-def">Function: </span><span><strong class="def-name">bigfloat_eps</strong> <var class="def-var-arguments">()</var><a class="copiable-link" href='#index-bigfloat_005feps'> &para;</a></span></dt>
<dd><p>Returns the smallest bigfloat value, <code class="code">eps</code>, such that
<code class="code">1+eps</code> is not equal to 1.  The value depends on <code class="code"><a class="ref" href="#fpprec">fpprec</a></code>,
of course.
</p>
<div class="example">
<pre class="example-preformatted">(%i1) fpprec:16;
(%o1)                                 16
(%i2) bigfloat_eps();
(%o2)                        1.387778780781446b-17
(%i3) fpprec:32;
(%o3)                                 32
(%i4) bigfloat_eps();
(%o4)                1.5407439555097886824447823540679b-33
</pre></div>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Numerical-evaluation">Numerical evaluation</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="decode_005ffloat"></a><a class="anchor" id="Item_003a-DataTypes_002fdeffn_002fdecode_005ffloat"></a><dl class="first-deffn">
<dt class="deffn" id="index-decode_005ffloat"><span class="category-def">Function: </span><span><strong class="def-name">decode_float</strong> <var class="def-var-arguments">(<var class="var">f</var>)</var><a class="copiable-link" href='#index-decode_005ffloat'> &para;</a></span></dt>
<dd><p><code class="code">decode_float</code> takes a float <var class="var">f</var> and returns a list of three
values that characterizes <var class="var">f</var>, which must be either a <code class="code">float</code>
or <code class="code">bfloat</code>.  The first value has the same type as <var class="var">f</var>, but
is a number in the range <code class="code">[1, 2)</code>.  The second value is an
exponent.  The third value is a float of the same type as <var class="var">f</var> and
has the value of 1 if <var class="var">f</var> is greater than or equal to 0;
otherwise, -1.
</p>
<p>If the returned list is <code class="code">[mantissa, expo, sign]</code>, then
<code class="code">scale_float(mantissa, exp)*sign</code> is identical to <var class="var">f</var>.
</p>
<div class="example">
<pre class="example-preformatted">(%i1) decode_float(4e0);
(%o1)                            [1.0, 2, 1.0]
(%i2) decode_float(4b0);
(%o2)                          [1.0b0, 2, 1.0b0]
(%i3) decode_float(%pi);

decode_float is only defined for floats and bfloats: %pi
 -- an error. To debug this try: debugmode(true);
(%i4) decode_float(float(%pi));
(%o4)                     [1.570796326794897, 1, 1.0]
(%i5) decode_float(1.1e-5);
(%o5)                        [1.441792, - 17, 1.0]
(%i6) %[1]*2^%[2];
(%o6)                               1.1e-5
</pre></div>

<p>This is a relatively simple interface to Common Lisp
<a class="url" href="http://www.lispworks.com/documentation/HyperSpec/Body/f_dec_fl.htm">decode_float</a>.  However we return a signficand in the range
<code class="code">[1,2)</code> instead of <code class="code">[0.5, 1)</code>.  The former matches
IEEE-754.  Of course, this is extended to support bfloats.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Numerical-evaluation">Numerical evaluation</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="evenp"></a><a class="anchor" id="Item_003a-DataTypes_002fdeffn_002fevenp"></a><dl class="first-deffn">
<dt class="deffn" id="index-evenp"><span class="category-def">Function: </span><span><strong class="def-name">evenp</strong> <var class="def-var-arguments">(<var class="var">expr</var>)</var><a class="copiable-link" href='#index-evenp'> &para;</a></span></dt>
<dd>
<p>Returns <code class="code">true</code> if <var class="var">expr</var> is a literal even integer, otherwise
<code class="code">false</code>.
</p>
<p><code class="code">evenp</code> returns <code class="code">false</code> if <var class="var">expr</var> is a symbol, even if <var class="var">expr</var>
is declared <code class="code">even</code>.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Predicate-functions">Predicate functions</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="float"></a><a class="anchor" id="Item_003a-DataTypes_002fdeffn_002ffloat"></a><dl class="first-deffn">
<dt class="deffn" id="index-float"><span class="category-def">Function: </span><span><strong class="def-name">float</strong> <var class="def-var-arguments">(<var class="var">expr</var>)</var><a class="copiable-link" href='#index-float'> &para;</a></span></dt>
<dd>
<p>Converts integers, rational numbers and bigfloats in <var class="var">expr</var> to floating
point numbers.  It is also an <code class="code"><a class="ref" href="maxima_7.html#evflag">evflag</a></code>, <code class="code">float</code> causes
non-integral rational numbers and bigfloat numbers to be converted to floating
point.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Numerical-evaluation">Numerical evaluation</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Evaluation-flags">Evaluation flags</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="float2bf"></a><a class="anchor" id="Item_003a-DataTypes_002fdefvr_002ffloat2bf"></a><dl class="first-defvr">
<dt class="defvr" id="index-float2bf"><span class="category-def">Option variable: </span><span><strong class="def-name">float2bf</strong><a class="copiable-link" href='#index-float2bf'> &para;</a></span></dt>
<dd><p>Default value: <code class="code">true</code>
</p> 
<p>When <code class="code"><a class="ref" href="#float2bf">float2bf</a></code> is <code class="code">false</code>, a warning message is printed when
a floating point number is replaced by a bigfloat number with less precision.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Numerical-evaluation">Numerical evaluation</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="float_005fbits"></a><a class="anchor" id="Item_003a-DataTypes_002fdeffn_002ffloat_005fbits"></a><dl class="first-deffn">
<dt class="deffn" id="index-float_005fbits"><span class="category-def">Function: </span><span><strong class="def-name">float_bits</strong> <var class="def-var-arguments">()</var><a class="copiable-link" href='#index-float_005fbits'> &para;</a></span></dt>
<dd><p>Returns the number of bits of precision of a floating-point number.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Numerical-evaluation">Numerical evaluation</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="float_005feps"></a><a class="anchor" id="Item_003a-DataTypes_002fdeffn_002ffloat_005feps"></a><dl class="first-deffn">
<dt class="deffn" id="index-float_005feps"><span class="category-def">Function: </span><span><strong class="def-name">float_eps</strong> <var class="def-var-arguments">()</var><a class="copiable-link" href='#index-float_005feps'> &para;</a></span></dt>
<dd><p>Returns the smallest floating-point value, <code class="code">eps</code>, such that
<code class="code">1+eps</code> is not equal to 1.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Numerical-evaluation">Numerical evaluation</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="float_005fprecision"></a><a class="anchor" id="Item_003a-DataTypes_002fdeffn_002ffloat_005fprecision"></a><dl class="first-deffn">
<dt class="deffn" id="index-float_005fprecision"><span class="category-def">Function: </span><span><strong class="def-name">float_precision</strong> <var class="def-var-arguments">(<var class="var">f</var>)</var><a class="copiable-link" href='#index-float_005fprecision'> &para;</a></span></dt>
<dd><p>Returns the number of bits of precision of a floating-point number,
which can be either a float or bigfloat.  This is basically the number
of bits used to represent the mantissa of a floating-point number.
For floats, this is 53 (for IEEE double-floats), but can be less when
denormal numbers occur.  For bigfloats, this is equal to
<code class="code"><a class="ref" href="#fpprec">fpprec</a></code>, when converted from digits to bits.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Numerical-evaluation">Numerical evaluation</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="floatnump"></a><a class="anchor" id="Item_003a-DataTypes_002fdeffn_002ffloatnump"></a><dl class="first-deffn">
<dt class="deffn" id="index-floatnump"><span class="category-def">Function: </span><span><strong class="def-name">floatnump</strong> <var class="def-var-arguments">(<var class="var">expr</var>)</var><a class="copiable-link" href='#index-floatnump'> &para;</a></span></dt>
<dd>
<p>Returns <code class="code">true</code> if <var class="var">expr</var> is a floating point number, otherwise
<code class="code">false</code>.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Numerical-evaluation">Numerical evaluation</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Predicate-functions">Predicate functions</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="fpprec"></a><a class="anchor" id="Item_003a-DataTypes_002fdefvr_002ffpprec"></a><dl class="first-defvr">
<dt class="defvr" id="index-fpprec"><span class="category-def">Option variable: </span><span><strong class="def-name">fpprec</strong><a class="copiable-link" href='#index-fpprec'> &para;</a></span></dt>
<dd><p>Default value: 16
</p>
<p><code class="code">fpprec</code> is the number of significant digits for arithmetic on bigfloat
numbers.  <code class="code">fpprec</code> does not affect computations on ordinary floating point
numbers.
</p>
<p>See also <code class="code"><a class="ref" href="#bfloat">bfloat</a></code> and <code class="code"><a class="ref" href="#fpprintprec">fpprintprec</a></code>.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Numerical-evaluation">Numerical evaluation</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="fpprintprec"></a><a class="anchor" id="Item_003a-DataTypes_002fdefvr_002ffpprintprec"></a><dl class="first-defvr">
<dt class="defvr" id="index-fpprintprec"><span class="category-def">Option variable: </span><span><strong class="def-name">fpprintprec</strong><a class="copiable-link" href='#index-fpprintprec'> &para;</a></span></dt>
<dd><p>Default value: 0
</p>
<p><code class="code">fpprintprec</code> is the number of digits to print when printing an ordinary
float or bigfloat number.
</p>
<p>For ordinary floating point numbers,
when <code class="code">fpprintprec</code> has a value between 2 and 16 (inclusive),
the number of digits printed is equal to <code class="code">fpprintprec</code>.
Otherwise, <code class="code">fpprintprec</code> is 0, or greater than 16,
and the number is printed &quot;readably&quot;:
that is, it is printed with sufficient digits to exactly reconstruct the number on input.
</p>
<p>For bigfloat numbers,
when <code class="code">fpprintprec</code> has a value between 2 and <code class="code">fpprec</code> (inclusive),
the number of digits printed is equal to <code class="code">fpprintprec</code>.
Otherwise, <code class="code">fpprintprec</code> is 0, or greater than <code class="code">fpprec</code>,
and the number of digits printed is equal to <code class="code">fpprec</code>.
</p>
<p>For both ordinary floats and bigfloats,
trailing zero digits are suppressed.
The actual number of digits printed is less than <code class="code">fpprintprec</code>
if there are trailing zero digits.
</p>
<p><code class="code">fpprintprec</code> cannot be 1.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Numerical-evaluation">Numerical evaluation</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Display-flags-and-variables">Display flags and variables</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="integerp"></a><a class="anchor" id="Item_003a-DataTypes_002fdeffn_002fintegerp"></a><dl class="first-deffn">
<dt class="deffn" id="index-integerp"><span class="category-def">Function: </span><span><strong class="def-name">integerp</strong> <var class="def-var-arguments">(<var class="var">expr</var>)</var><a class="copiable-link" href='#index-integerp'> &para;</a></span></dt>
<dd>
<p>Returns <code class="code">true</code> if <var class="var">expr</var> is a literal numeric integer, otherwise
<code class="code">false</code>.
</p>
<p><code class="code">integerp</code> returns <code class="code">false</code> if <var class="var">expr</var> is a symbol, even if <var class="var">expr</var>
is declared <code class="code">integer</code>.
</p>
<p>Examples:
</p>
<div class="example">
<pre class="example-preformatted">(%i1) integerp (0);
(%o1)                         true
(%i2) integerp (1);
(%o2)                         true
(%i3) integerp (-17);
(%o3)                         true
(%i4) integerp (0.0);
(%o4)                         false
(%i5) integerp (1.0);
(%o5)                         false
(%i6) integerp (%pi);
(%o6)                         false
(%i7) integerp (n);
(%o7)                         false
(%i8) declare (n, integer);
(%o8)                         done
(%i9) integerp (n);
(%o9)                         false
</pre></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Predicate-functions">Predicate functions</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="integer_005fdecode_005ffloat"></a><a class="anchor" id="Item_003a-DataTypes_002fdeffn_002finteger_005fdecode_005ffloat"></a><dl class="first-deffn">
<dt class="deffn" id="index-integer_005fdecode_005ffloat"><span class="category-def">Function: </span><span><strong class="def-name">integer_decode_float</strong> <var class="def-var-arguments">(<var class="var">f</var>)</var><a class="copiable-link" href='#index-integer_005fdecode_005ffloat'> &para;</a></span></dt>
<dd><p><code class="code">integer_decode_float</code> takes a float <var class="var">f</var> and returns a list of three
values that characterizes <var class="var">f</var>, which must be either a <code class="code">float</code>
or <code class="code">bfloat</code>.  The first value is an integer.  The second value is an
exponent.  The third value is 1 if <var class="var">f</var> is positive or zero;
otherwise, -1.
</p>
<p>If the returned list is <code class="code">[mantissa, expo, sign]</code>, then
<code class="code">scale_float(fl(mantissa), expo)*sign</code> is identical to <var class="var">f</var>.
Here, <code class="code">fl</code> is either <code class="code">float</code> or <code class="code">bfloat</code> depending on
whether <var class="var">f</var> is a <code class="code">float</code> or a <code class="code">bfloat</code>.
</p>
<div class="example">
<pre class="example-preformatted">(%i1) integer_decode_float(4.0);
(%o1)                     [4503599627370496, - 50, 1]
(%i2) integer_decode_float(4b0);
(%o2)                    [36028797018963968, - 53, 1]
(%i3) scale_float(float(%o1[1]), %o1[2]);
(%o3)                                 4.0
(%i4) scale_float(bfloat(%o2[1]), %o2[2]);
(%o4)                                4.0b0
(%i5) integer_decode_float(4);

decode_float is only defined for floats and bfloats: 4
 -- an error. To debug this try: debugmode(true);
(%i6) integer_decode_float(1e-7);
(%o6)                     [7555786372591432, - 76, 1]
(%i7) integer_decode_float(1b-7);
(%o7)                    [60446290980731459, - 79, 1]
(%i8) scale_float(float(%o6[1]), %o6[2]);
(%o8)                               1.0e-7
</pre></div>

<p>For lisps that support denormal numbers, we have the following results.
</p><div class="example">
<pre class="example-preformatted">(%i1) integer_decode_float(least_positive_float);
(%o1)                           [1, - 1074, 1]
(%i2) integer_decode_float(100*least_positive_float);
(%o2)                          [100, - 1074, 1]
(%i3) integer_decode_float(least_positive_normalized_float);
(%o3)                    [4503599627370496, - 1074, 1]
</pre></div>
<p>The number of bits in the integer part decreases as the denormal
number decreases.  Bfloat numbers do not have denormals because the
exponent is not bounded.
</p>
<p>This is a relatively simple interface to Common Lisp
<a class="url" href="http://www.lispworks.com/documentation/HyperSpec/Body/f_dec_fl.htm">integer_decode_float</a>.  However, the integer part can vary depending
on the Lisp implementation; we return the same value, independent of
the Lisp implementation.  Of course, this is extended to support bfloats.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Numerical-evaluation">Numerical evaluation</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="is_005fpower_005fof_005ftwo"></a><a class="anchor" id="Item_003a-DataTypes_002fdeffn_002fis_005fpower_005fof_005ftwo"></a><dl class="first-deffn">
<dt class="deffn" id="index-is_005fpower_005fof_005ftwo"><span class="category-def">Function: </span><span><strong class="def-name">is_power_of_two</strong> <var class="def-var-arguments">(<var class="var">n</var>)</var><a class="copiable-link" href='#index-is_005fpower_005fof_005ftwo'> &para;</a></span></dt>
<dd><p><code class="code">is_power_to_two</code> returns <code class="code">true</code> if <var class="var">n</var> is a power of
two and <code class="code">false</code> otherwise.  <var class="var">n</var> may be an integer, a
rational, a float, or a big float.
</p>
<p>Some examples:
</p><div class="example">
<pre class="example-preformatted">(%i1) is_power_of_two(0);
(%o1)                                false
(%i2) is_power_of_two(4);
(%o2)                                true
(%i3) is_power_of_two(355/113);
(%o3)                                false
(%i4) is_power_of_two(1/32);
(%o4)                                true
(%i5) is_power_of_two(1048576);
(%o5)                                true
(%i6) is_power_of_two(1048575);
(%o6)                                false
(%i7) is_power_of_two(0.0);
(%o7)                                false
(%i8) is_power_of_two(1048576.0);
(%o8)                                true
(%i9) is_power_of_two(1048575.0);
(%o9)                                false
(%i10) is_power_of_two(1/256.0);
(%o10)                               true
(%i11) is_power_of_two(0b0);
(%o11)                               false
(%i12) is_power_of_two(1048576b0);
(%o12)                               true
(%i13) is_power_of_two(1048575b0);
(%o13)                               false
(%i14) is_power_of_two(1/256b0);
(%o14)                               true
</pre></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Predicate-functions">Predicate functions</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="m1pbranch"></a><a class="anchor" id="Item_003a-DataTypes_002fdefvr_002fm1pbranch"></a><dl class="first-defvr">
<dt class="defvr" id="index-m1pbranch"><span class="category-def">Option variable: </span><span><strong class="def-name">m1pbranch</strong><a class="copiable-link" href='#index-m1pbranch'> &para;</a></span></dt>
<dd><p>Default value: <code class="code">false</code>
</p>
<p><code class="code">m1pbranch</code> is the principal branch for <code class="code">-1</code> to a power.
Quantities such as <code class="code">(-1)^(1/3)</code> (that is, an &quot;odd&quot; rational exponent) and 
<code class="code">(-1)^(1/4)</code> (that is, an &quot;even&quot; rational exponent) are handled as follows:
</p>
<div class="example">
<pre class="example-preformatted">              domain:real
                            
(-1)^(1/3):      -1         
(-1)^(1/4):   (-1)^(1/4)   

             domain:complex              
m1pbranch:false          m1pbranch:true
(-1)^(1/3)               1/2+%i*sqrt(3)/2
(-1)^(1/4)              sqrt(2)/2+%i*sqrt(2)/2
</pre></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Expressions">Expressions</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Global-flags">Global flags</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="nonnegintegerp"></a><a class="anchor" id="Item_003a-DataTypes_002fdeffn_002fnonnegintegerp"></a><dl class="first-deffn">
<dt class="deffn" id="index-nonnegintegerp"><span class="category-def">Function: </span><span><strong class="def-name">nonnegintegerp</strong> <var class="def-var-arguments">(<var class="var">n</var>)</var><a class="copiable-link" href='#index-nonnegintegerp'> &para;</a></span></dt>
<dd>
<p>Return <code class="code">true</code> if and only if <code class="code"><var class="var">n</var> &gt;= 0</code> and <var class="var">n</var> is an integer.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Predicate-functions">Predicate functions</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="numberp"></a><a class="anchor" id="Item_003a-DataTypes_002fdeffn_002fnumberp"></a><dl class="first-deffn">
<dt class="deffn" id="index-numberp"><span class="category-def">Function: </span><span><strong class="def-name">numberp</strong> <var class="def-var-arguments">(<var class="var">expr</var>)</var><a class="copiable-link" href='#index-numberp'> &para;</a></span></dt>
<dd>
<p>Returns <code class="code">true</code> if <var class="var">expr</var> is a literal integer, rational number, 
floating point number, or bigfloat, otherwise <code class="code">false</code>.
</p>
<p><code class="code">numberp</code> returns <code class="code">false</code> if <var class="var">expr</var> is a symbol, even if <var class="var">expr</var>
is a symbolic number such as <code class="code">%pi</code> or <code class="code">%i</code>, or declared to be
<code class="code">even</code>, <code class="code">odd</code>, <code class="code">integer</code>, <code class="code">rational</code>, <code class="code">irrational</code>,
<code class="code">real</code>, <code class="code">imaginary</code>, or <code class="code">complex</code>.
</p>
<p>Examples:
</p>
<div class="example">
<pre class="example-preformatted">(%i1) numberp (42);
(%o1)                         true
(%i2) numberp (-13/19);
(%o2)                         true
(%i3) numberp (3.14159);
(%o3)                         true
(%i4) numberp (-1729b-4);
(%o4)                         true
(%i5) map (numberp, [%e, %pi, %i, %phi, inf, minf]);
(%o5)      [false, false, false, false, false, false]
(%i6) declare (a, even, b, odd, c, integer, d, rational,
     e, irrational, f, real, g, imaginary, h, complex);
(%o6)                         done
(%i7) map (numberp, [a, b, c, d, e, f, g, h]);
(%o7) [false, false, false, false, false, false, false, false]
</pre></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Predicate-functions">Predicate functions</a>
&middot;
</div>
</dd></dl>


<a class="anchor" id="numer"></a><a class="anchor" id="Item_003a-DataTypes_002fdefvr_002fnumer"></a><dl class="first-defvr">
<dt class="defvr" id="index-numer"><span class="category-def">Option variable: </span><span><strong class="def-name">numer</strong><a class="copiable-link" href='#index-numer'> &para;</a></span></dt>
<dd>
<p><code class="code">numer</code> causes some mathematical functions (including exponentiation)
with numerical arguments to be evaluated in floating point.  It causes
variables in <code class="code">expr</code> which have been given numerals to be replaced by
their values.  It also sets the <code class="code"><a class="ref" href="#float">float</a></code> switch on.
</p>
<p>See also <code class="code"><a class="ref" href="maxima_9.html#g_t_0025enumer">%enumer</a></code>.
</p>
<p>Examples:
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) [sqrt(2), sin(1), 1/(1+sqrt(3))];
                                        1
(%o1)            [sqrt(2), sin(1), -----------]
                                   sqrt(3) + 1
</pre></div><div class="group"><pre class="example-preformatted">(%i2) [sqrt(2), sin(1), 1/(1+sqrt(3))],numer;
(%o2) [1.414213562373095, 0.8414709848078965, 0.3660254037844387]
</pre></div></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Numerical-evaluation">Numerical evaluation</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Evaluation-flags">Evaluation flags</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="numer_005fpbranch"></a><a class="anchor" id="Item_003a-DataTypes_002fdefvr_002fnumer_005fpbranch"></a><dl class="first-defvr">
<dt class="defvr" id="index-numer_005fpbranch"><span class="category-def">Option variable: </span><span><strong class="def-name">numer_pbranch</strong><a class="copiable-link" href='#index-numer_005fpbranch'> &para;</a></span></dt>
<dd><p>Default value: <code class="code">false</code>
</p>
<p>The option variable <code class="code">numer_pbranch</code> controls the numerical evaluation of 
the power of a negative integer, rational, or floating point number.  When
<code class="code">numer_pbranch</code> is <code class="code">true</code> and the exponent is a floating point number
or the option variable <code class="code"><a class="ref" href="#numer">numer</a></code> is <code class="code">true</code> too, Maxima evaluates
the numerical result using the principal branch.  Otherwise a simplified, but
not an evaluated result is returned.
</p>
<p>Examples:
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) (-2)^0.75;
                                 0.75
(%o1)                       (- 2)
</pre></div><div class="group"><pre class="example-preformatted">(%i2) (-2)^0.75,numer_pbranch:true;
(%o2)       1.189207115002721 %i - 1.189207115002721
</pre></div><div class="group"><pre class="example-preformatted">(%i3) (-2)^(3/4);
                               3/4  3/4
(%o3)                     (- 1)    2
</pre></div><div class="group"><pre class="example-preformatted">(%i4) (-2)^(3/4),numer;
                                          0.75
(%o4)              1.681792830507429 (- 1)
</pre></div><div class="group"><pre class="example-preformatted">(%i5) (-2)^(3/4),numer,numer_pbranch:true;
(%o5)       1.189207115002721 %i - 1.189207115002721
</pre></div></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Numerical-evaluation">Numerical evaluation</a>
&middot;
</div>
</dd></dl>


<a class="anchor" id="numerval"></a><a class="anchor" id="Item_003a-DataTypes_002fdeffn_002fnumerval"></a><dl class="first-deffn">
<dt class="deffn" id="index-numerval"><span class="category-def">Function: </span><span><strong class="def-name">numerval</strong> <var class="def-var-arguments">(<var class="var">x_1</var>, <var class="var">expr_1</var>, &hellip;, <var class="var">var_n</var>, <var class="var">expr_n</var>)</var><a class="copiable-link" href='#index-numerval'> &para;</a></span></dt>
<dd>
<p>Declares the variables <code class="code">x_1</code>, &hellip;, <var class="var">x_n</var> to have
numeric values equal to <code class="code">expr_1</code>, &hellip;, <code class="code">expr_n</code>.
The numeric value is evaluated and substituted for the variable
in any expressions in which the variable occurs if the <code class="code">numer</code> flag is
<code class="code">true</code>.  See also <code class="code"><a class="ref" href="maxima_7.html#ev">ev</a></code>.
</p>
<p>The expressions <code class="code">expr_1</code>, &hellip;, <code class="code">expr_n</code> can be any expressions,
not necessarily numeric.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Declarations-and-inferences">Declarations and inferences</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Numerical-evaluation">Numerical evaluation</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="oddp"></a><a class="anchor" id="Item_003a-DataTypes_002fdeffn_002foddp"></a><dl class="first-deffn">
<dt class="deffn" id="index-oddp"><span class="category-def">Function: </span><span><strong class="def-name">oddp</strong> <var class="def-var-arguments">(<var class="var">expr</var>)</var><a class="copiable-link" href='#index-oddp'> &para;</a></span></dt>
<dd>
<p>Returns <code class="code">true</code> if <var class="var">expr</var> is a literal odd integer, otherwise
<code class="code">false</code>.
</p>
<p><code class="code">oddp</code> returns <code class="code">false</code> if <var class="var">expr</var> is a symbol, even if <var class="var">expr</var>
is declared <code class="code">odd</code>.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Predicate-functions">Predicate functions</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="ratepsilon"></a><a class="anchor" id="Item_003a-DataTypes_002fdefvr_002fratepsilon"></a><dl class="first-defvr">
<dt class="defvr" id="index-ratepsilon"><span class="category-def">Option variable: </span><span><strong class="def-name">ratepsilon</strong><a class="copiable-link" href='#index-ratepsilon'> &para;</a></span></dt>
<dd><p>Default value: <code class="code">2.0e-15</code>
</p>
<p><code class="code">ratepsilon</code> is the tolerance used in the conversion
of floating point numbers to rational numbers, when the option variable
<code class="code"><a class="ref" href="#bftorat">bftorat</a></code> has the value <code class="code">false</code>.  See <code class="code">bftorat</code> for an example.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Numerical-evaluation">Numerical evaluation</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Rational-expressions">Rational expressions</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="rationalize"></a><a class="anchor" id="Item_003a-DataTypes_002fdeffn_002frationalize"></a><dl class="first-deffn">
<dt class="deffn" id="index-rationalize"><span class="category-def">Function: </span><span><strong class="def-name">rationalize</strong> <var class="def-var-arguments">(<var class="var">expr</var>)</var><a class="copiable-link" href='#index-rationalize'> &para;</a></span></dt>
<dd>
<p>Convert all double floats and big floats in the Maxima expression <var class="var">expr</var> to
their exact rational equivalents.  If you are not familiar with the binary
representation of floating point numbers, you might be surprised that
<code class="code">rationalize (0.1)</code> does not equal 1/10.  This behavior isn&rsquo;t special to
Maxima &ndash; the number 1/10 has a repeating, not a terminating, binary
representation.
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) rationalize (0.5);
                                1
(%o1)                           -
                                2
</pre></div><div class="group"><pre class="example-preformatted">(%i2) rationalize (0.1);
                        3602879701896397
(%o2)                   -----------------
                        36028797018963968
</pre></div><pre class="example-preformatted">(%i3) fpprec : 5$
</pre><div class="group"><pre class="example-preformatted">(%i4) rationalize (0.1b0);
                             209715
(%o4)                        -------
                             2097152
</pre></div><pre class="example-preformatted">(%i5) fpprec : 20$
</pre><div class="group"><pre class="example-preformatted">(%i6) rationalize (0.1b0);
                     236118324143482260685
(%o6)                ----------------------
                     2361183241434822606848
</pre></div><div class="group"><pre class="example-preformatted">(%i7) rationalize (sin (0.1*x + 5.6));
               3602879701896397 x   3152519739159347
(%o7)      sin(------------------ + ----------------)
               36028797018963968    562949953421312
</pre></div></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Numerical-evaluation">Numerical evaluation</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="ratnump"></a><a class="anchor" id="Item_003a-DataTypes_002fdeffn_002fratnump"></a><dl class="first-deffn">
<dt class="deffn" id="index-ratnump"><span class="category-def">Function: </span><span><strong class="def-name">ratnump</strong> <var class="def-var-arguments">(<var class="var">expr</var>)</var><a class="copiable-link" href='#index-ratnump'> &para;</a></span></dt>
<dd>
<p>Returns <code class="code">true</code> if <var class="var">expr</var> is a literal integer or ratio of literal
integers, otherwise <code class="code">false</code>.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Predicate-functions">Predicate functions</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Rational-expressions">Rational expressions</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="scale_005ffloat"></a><a class="anchor" id="Item_003a-DataTypes_002fdeffn_002fscale_005ffloat"></a><dl class="first-deffn">
<dt class="deffn" id="index-scale_005ffloat"><span class="category-def">Function: </span><span><strong class="def-name">scale_float</strong> <var class="def-var-arguments">(<var class="var">f</var>, <var class="var">n</var>)</var><a class="copiable-link" href='#index-scale_005ffloat'> &para;</a></span></dt>
<dd><p><code class="code">scale_float</code> scales the float <var class="var">f</var> by the value
<code class="code">2^<var class="var">n</var></code>.  This is done carefully so that no round-off every
occurs.  If <var class="var">f</var> is a float, then it is possible to underflow to 0
or overflow, depending on the value of <var class="var">f</var> and <var class="var">n</var>.  Bigfloats
cannot underflow or overflow.
</p>
<div class="example">
<pre class="example-preformatted">(%i1) scale_float(2d0, 2);
(%o1)                                 8.0
(%i2) scale_float(2d0, -2);
(%o2)                                 0.5
(%i3) scale_float(-2d0, -10);
(%o3)                            - 0.001953125
(%i4) scale_float(1d0, -2000);
(%o4)                                 0.0
(%i5) scale_float(2b0, 2);
(%o5)                                8.0b0
(%i6) scale_float(1b0, -2000);
(%o6)                       8.709809816217217b-603
(%i7) scale_float(1, 5);

scale_float: first arg must be a float or bfloat: 1
 -- an error. To debug this try: debugmode(true);
(%i8) scale_float(1.0, n);

scale_float: second arg must be an integer: n
 -- an error. To debug this try: debugmode(true);
</pre></div>

<p>This is a relatively simple interface to Common Lisp
<a class="url" href="http://www.lispworks.com/documentation/HyperSpec/Body/f_dec_fl.htm">scale_float</a>.  Of course, this is extended to support bfloats.
</p>
</dd></dl>

<a class="anchor" id="unit_005fin_005flast_005fplace"></a><a class="anchor" id="Item_003a-DataTypes_002fdeffn_002funit_005fin_005flast_005fplase"></a><dl class="first-deffn">
<dt class="deffn" id="index-unit_005fin_005flast_005fplase"><span class="category-def">Function: </span><span><strong class="def-name">unit_in_last_plase</strong> <var class="def-var-arguments">(<var class="var">n</var>)</var><a class="copiable-link" href='#index-unit_005fin_005flast_005fplase'> &para;</a></span></dt>
<dd>
<p><code class="code">unit_in_last_place</code> returns a value that is the gap between
<var class="var">n</var> and the nearest other number.  See, for example,
<a class="url" href="https://people.eecs.berkeley.edu/~wkahan/LOG10HAF.TXT">Kahan, FOOTNOTE 1</a>.  <code class="code">unit_in_last_place</code> supports rational numbers,
floating-point numbers and bigfloat numbers.  For integer, the result
is always 1, and for rational numbers the result is always 0.
</p>
<p>The examples below assume
<a class="url" href="https://en.wikipedia.org/wiki/IEEE_754">IEEE-754</a> arithmetic that
supports
<a class="url" href="https://en.wikipedia.org/wiki/IEEE_754-1985#Denormalized_numbers">denormal</a>
numbers.  Some lisps like <a class="url" href="https://clisp.sourceforge.io/">Clisp</a>
do not have denormal numbers.
</p>
<div class="example">
<pre class="example-preformatted">(%i1) unit_in_last_place(0);
(%o1)                                  1
(%i2) unit_in_last_place(-123);
(%o2)                                  1
(%i3) unit_in_last_place(2/3);
(%o3)                                  0
(%i4) unit_in_last_place(355/113);
(%o4)                                  0
(%i5) unit_in_last_place(0b0);
(%o5)                                0.0b0
(%i6) unit_in_last_place(0.0);
(%o6)                       4.940656458412465e-324
(%i7) unit_in_last_place(1.0);
(%o7)                        1.110223024625157e-16
(%i8) unit_in_last_place(1b0);
(%o8)                        1.387778780781446b-17
(%i9) unit_in_last_place(100.0);
(%o9)                         1.4210854715202e-14
(%i10) unit_in_last_place(100b0);
(%o10)                       1.77635683940025b-15
(%i11) fpprec:32;
(%o11)                                32
(%i12) unit_in_last_place(1b0);
(%o12)               1.5407439555097886824447823540679b-33
(%i13) unit_in_last_place(100b0);
(%o13)               1.972152263052529513529321413207b-31
</pre></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Numerical-evaluation">Numerical evaluation</a>
&middot;
</div>

</dd></dl>

<a class="anchor" id="Item_003a-DataTypes_002fnode_002fStrings"></a><hr>
</div>
</div>
<div class="section-level-extent" id="Strings">
<div class="nav-panel">
<p>
Next: <a href="#Constants" accesskey="n" rel="next">Constants</a>, Previous: <a href="#Numbers" accesskey="p" rel="prev">Numbers</a>, Up: <a href="#Data-Types-and-Structures" accesskey="u" rel="up">Data Types and Structures</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="Table of contents" rel="contents">Contents</a>][<a href="Function-and-Variable-Index.html" title="Index" rel="index">Index</a>]</p>
</div>
<h3 class="section" id="Strings-1">5.2 Strings</h3>


<a class="anchor" id="Item_003a-DataTypes_002fnode_002fIntroduction-to-Strings"></a><ul class="mini-toc">
<li><a href="#Introduction-to-Strings" accesskey="1">Introduction to Strings</a></li>
<li><a href="#Functions-and-Variables-for-Strings" accesskey="2">Functions and Variables for Strings</a></li>
</ul>
<hr>
<div class="subsection-level-extent" id="Introduction-to-Strings">
<div class="nav-panel">
<p>
Next: <a href="#Functions-and-Variables-for-Strings" accesskey="n" rel="next">Functions and Variables for Strings</a>, Previous: <a href="#Strings" accesskey="p" rel="prev">Strings</a>, Up: <a href="#Strings" accesskey="u" rel="up">Strings</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="Table of contents" rel="contents">Contents</a>][<a href="Function-and-Variable-Index.html" title="Index" rel="index">Index</a>]</p>
</div>
<h4 class="subsection" id="Introduction-to-Strings-1">5.2.1 Introduction to Strings</h4>

<a class="index-entry-id" id="index-backslash"></a>

<p>Strings (quoted character sequences) are enclosed in double quote marks <code class="code">&quot;</code>
for input, and displayed with or without the quote marks, depending on the
global variable <code class="code"><a class="ref" href="#stringdisp">stringdisp</a></code>.
</p>
<p>Strings may contain any characters, including embedded tab, newline, and
carriage return characters.  The sequence <code class="code">\&quot;</code> is recognized as a literal
double quote, and <code class="code">\\</code> as a literal backslash.  When backslash appears at
the end of a line, the backslash and the line termination (either newline or
carriage return and newline) are ignored, so that the string continues with the
next line.  No other special combinations of backslash with another character
are recognized; when backslash appears before any character other than <code class="code">&quot;</code>,
<code class="code">\</code>, or a line termination, the backslash is ignored.  There is no way to
represent a special character (such as tab, newline, or carriage return)
except by embedding the literal character in the string.
</p>
<p>There is no character type in Maxima; a single character is represented as a
one-character string.
</p>
<p>The <code class="code">stringproc</code> add-on package contains many functions for working with
strings.
</p>
<p>Examples:
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) s_1 : &quot;This is a string.&quot;;
(%o1)                   This is a string.
</pre></div><div class="group"><pre class="example-preformatted">(%i2) s_2 : &quot;Embedded \&quot;double quotes\&quot; and backslash \\ characters.&quot;;
(%o2) Embedded &quot;double quotes&quot; and backslash \ characters.
</pre></div><div class="group"><pre class="example-preformatted">(%i3) s_3 : &quot;Embedded line termination
in this string.&quot;;
(%o3) Embedded line termination
in this string.
</pre></div><div class="group"><pre class="example-preformatted">(%i4) s_4 : &quot;Ignore the \
line termination \
characters in \
this string.&quot;;
(%o4) Ignore the line termination characters in this string.
</pre></div><div class="group"><pre class="example-preformatted">(%i5) stringdisp : false;
(%o5)                         false
</pre></div><div class="group"><pre class="example-preformatted">(%i6) s_1;
(%o6)                   This is a string.
</pre></div><div class="group"><pre class="example-preformatted">(%i7) stringdisp : true;
(%o7)                         true
</pre></div><div class="group"><pre class="example-preformatted">(%i8) s_1;
(%o8)                  &quot;This is a string.&quot;
</pre></div></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Syntax">Syntax</a>
&middot;
</div>

<a class="anchor" id="Item_003a-DataTypes_002fnode_002fFunctions-and-Variables-for-Strings"></a><hr>
</div>
<div class="subsection-level-extent" id="Functions-and-Variables-for-Strings">
<div class="nav-panel">
<p>
Previous: <a href="#Introduction-to-Strings" accesskey="p" rel="prev">Introduction to Strings</a>, Up: <a href="#Strings" accesskey="u" rel="up">Strings</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="Table of contents" rel="contents">Contents</a>][<a href="Function-and-Variable-Index.html" title="Index" rel="index">Index</a>]</p>
</div>
<h4 class="subsection" id="Functions-and-Variables-for-Strings-1">5.2.2 Functions and Variables for Strings</h4>

<a class="anchor" id="concat"></a><a class="anchor" id="Item_003a-DataTypes_002fdeffn_002fconcat"></a><dl class="first-deffn">
<dt class="deffn" id="index-concat"><span class="category-def">Function: </span><span><strong class="def-name">concat</strong> <var class="def-var-arguments">(<var class="var">arg_1</var>, <var class="var">arg_2</var>, &hellip;)</var><a class="copiable-link" href='#index-concat'> &para;</a></span></dt>
<dd>
<p>Concatenates its arguments.  The arguments must evaluate to atoms.  The return
value is a symbol if the first argument is a symbol and a string otherwise.
</p>
<p><code class="code">concat</code> evaluates its arguments.  The single quote <code class="code">'</code> prevents
evaluation.
</p>
<p>See also <code class="code"><a class="ref" href="#sconcat">sconcat</a></code>, that works on non-atoms, too, <code class="code"><a class="ref" href="maxima_90.html#simplode">simplode</a></code>,
<code class="code"><a class="ref" href="#string">string</a></code> and <code class="code"><a class="ref" href="maxima_90.html#eval_005fstring">eval_string</a></code>.
For complex string conversions see also <code class="code"><a class="ref" href="maxima_90.html#printf">printf</a></code>.
</p>
<div class="example">
<pre class="example-preformatted">(%i1) y: 7$
(%i2) z: 88$
(%i3) concat (y, z/2);
(%o3)                          744
(%i4) concat ('y, z/2);
(%o4)                          y44
</pre></div>

<p>A symbol constructed by <code class="code">concat</code> may be assigned a value and appear in
expressions.  The <code class="code"><a class="ref" href="maxima_6.html#g_t_003a_003a">::</a></code> (double colon) assignment operator evaluates its
left-hand side.
</p>
<div class="example">
<pre class="example-preformatted">(%i5) a: concat ('y, z/2);
(%o5)                          y44
(%i6) a:: 123;
(%o6)                          123
(%i7) y44;
(%o7)                          123
(%i8) b^a;
                               y44
(%o8)                         b
(%i9) %, numer;
                               123
(%o9)                         b
</pre></div>

<p>Note that although <code class="code">concat (1, 2)</code> looks like a number, it is a string.
</p>
<div class="example">
<pre class="example-preformatted">(%i10) concat (1, 2) + 3;
(%o10)                       12 + 3
</pre></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Expressions">Expressions</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Strings">Strings</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="sconcat"></a><a class="anchor" id="Item_003a-DataTypes_002fdeffn_002fsconcat"></a><dl class="first-deffn">
<dt class="deffn" id="index-sconcat"><span class="category-def">Function: </span><span><strong class="def-name">sconcat</strong> <var class="def-var-arguments">(<var class="var">arg_1</var>, <var class="var">arg_2</var>, &hellip;)</var><a class="copiable-link" href='#index-sconcat'> &para;</a></span></dt>
<dd>
<p>Concatenates its arguments into a string.  Unlike <code class="code"><a class="ref" href="#concat">concat</a></code>, the
arguments do <i class="i">not</i> need to be atoms.
</p>
<p>See also <code class="code"><a class="ref" href="#concat">concat</a></code>, <code class="code"><a class="ref" href="maxima_90.html#simplode">simplode</a></code>, <code class="code"><a class="ref" href="#string">string</a></code> and <code class="code"><a class="ref" href="maxima_90.html#eval_005fstring">eval_string</a></code>.
For complex string conversions see also <code class="code"><a class="ref" href="maxima_90.html#printf">printf</a></code>.
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) sconcat (&quot;xx[&quot;, 3, &quot;]:&quot;, expand ((x+y)^3));
(%o1)             xx[3]:y^3+3*x*y^2+3*x^2*y+x^3
</pre></div></div>

<p>Another purpose for <code class="code">sconcat</code> is to convert arbitrary objects to strings. 
</p><div class="example">
<div class="group"><pre class="example-preformatted">(%i1) sconcat (x);
(%o1)                           x
</pre></div><div class="group"><pre class="example-preformatted">(%i2) stringp(%);
(%o2)                         true
</pre></div></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Expressions">Expressions</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Strings">Strings</a>
&middot;
</div>
</dd></dl>


<a class="anchor" id="string"></a><a class="anchor" id="Item_003a-DataTypes_002fdeffn_002fstring"></a><dl class="first-deffn">
<dt class="deffn" id="index-string"><span class="category-def">Function: </span><span><strong class="def-name">string</strong> <var class="def-var-arguments">(<var class="var">expr</var>)</var><a class="copiable-link" href='#index-string'> &para;</a></span></dt>
<dd>
<p>Converts <code class="code">expr</code> to Maxima&rsquo;s linear notation just as if it had been typed
in.
</p>
<p>The return value of <code class="code">string</code> is a string, and thus it cannot be used in a
computation.
</p>
<p>See also <code class="code"><a class="ref" href="#concat">concat</a></code>, <code class="code"><a class="ref" href="#sconcat">sconcat</a></code>, <code class="code"><a class="ref" href="maxima_90.html#simplode">simplode</a></code> and
<code class="code"><a class="ref" href="maxima_90.html#eval_005fstring">eval_string</a></code>.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Strings">Strings</a>
&middot;
</div>
</dd></dl>


<a class="anchor" id="stringdisp"></a><a class="anchor" id="Item_003a-DataTypes_002fdefvr_002fstringdisp"></a><dl class="first-defvr">
<dt class="defvr" id="index-stringdisp"><span class="category-def">Option variable: </span><span><strong class="def-name">stringdisp</strong><a class="copiable-link" href='#index-stringdisp'> &para;</a></span></dt>
<dd><p>Default value: <code class="code">false</code>
</p>
<p>When <code class="code">stringdisp</code> is <code class="code">true</code>, strings are displayed enclosed in double
quote marks.  Otherwise, quote marks are not displayed.
</p>
<p><code class="code">stringdisp</code> is always <code class="code">true</code> when displaying a function definition.
</p>
<p>Examples:
</p>
<div class="example">
<pre class="example-preformatted">(%i1) stringdisp: false$
</pre><div class="group"><pre class="example-preformatted">(%i2) &quot;This is an example string.&quot;;
(%o2)              This is an example string.
</pre></div><div class="group"><pre class="example-preformatted">(%i3) foo () :=
      print (&quot;This is a string in a function definition.&quot;);
(%o3) foo() := 
              print(&quot;This is a string in a function definition.&quot;)
</pre></div><pre class="example-preformatted">(%i4) stringdisp: true$
</pre><div class="group"><pre class="example-preformatted">(%i5) &quot;This is an example string.&quot;;
(%o5)             &quot;This is an example string.&quot;
</pre></div></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Display-flags-and-variables">Display flags and variables</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="Item_003a-Constants_002fnode_002fConstants"></a><hr>
</div>
</div>
<div class="section-level-extent" id="Constants">
<div class="nav-panel">
<p>
Next: <a href="#Lists" accesskey="n" rel="next">Lists</a>, Previous: <a href="#Strings" accesskey="p" rel="prev">Strings</a>, Up: <a href="#Data-Types-and-Structures" accesskey="u" rel="up">Data Types and Structures</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="Table of contents" rel="contents">Contents</a>][<a href="Function-and-Variable-Index.html" title="Index" rel="index">Index</a>]</p>
</div>
<h3 class="section" id="Constants-1">5.3 Constants</h3>


<a class="anchor" id="Item_003a-Constants_002fnode_002fFunctions-and-Variables-for-Constants"></a><ul class="mini-toc">
<li><a href="#Functions-and-Variables-for-Constants" accesskey="1">Functions and Variables for Constants</a></li>
</ul>
<hr>
<div class="subsection-level-extent" id="Functions-and-Variables-for-Constants">
<div class="nav-panel">
<p>
Previous: <a href="#Constants" accesskey="p" rel="prev">Constants</a>, Up: <a href="#Constants" accesskey="u" rel="up">Constants</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="Table of contents" rel="contents">Contents</a>][<a href="Function-and-Variable-Index.html" title="Index" rel="index">Index</a>]</p>
</div>
<h4 class="subsection" id="Functions-and-Variables-for-Constants-1">5.3.1 Functions and Variables for Constants</h4>

<a class="anchor" id="g_t_0025e"></a><a class="anchor" id="Item_003a-Constants_002fdefvr_002f_0025e"></a><dl class="first-defvr">
<dt class="defvr" id="index-_0025e"><span class="category-def">Constant: </span><span><strong class="def-name">%e</strong><a class="copiable-link" href='#index-_0025e'> &para;</a></span></dt>
<dd>
<p><code class="code">%e</code> represents the base of the natural logarithm, also known as Euler&rsquo;s
number.  The numeric value of <code class="code">%e</code> is the double-precision floating-point
value 2.718281828459045d0.  (See <a class="url" href="https://personal.math.ubc.ca/~cbm/aands/page_67.htm">A&amp;S eqn 4.1.16</a>, <a class="url" href="https://personal.math.ubc.ca/~cbm/aands/page_67.htm">A&amp;S 4.1.17</a>.)
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Constants">Constants</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="g_t_0025i"></a><a class="anchor" id="Item_003a-Constants_002fdefvr_002f_0025i"></a><dl class="first-defvr">
<dt class="defvr" id="index-_0025i"><span class="category-def">Constant: </span><span><strong class="def-name">%i</strong><a class="copiable-link" href='#index-_0025i'> &para;</a></span></dt>
<dd>
<p><code class="code">%i</code> represents the imaginary unit, 
\(\sqrt{-1}\)
.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Constants">Constants</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="false"></a><a class="anchor" id="Item_003a-Constants_002fdefvr_002ffalse"></a><dl class="first-defvr">
<dt class="defvr" id="index-false"><span class="category-def">Constant: </span><span><strong class="def-name">false</strong><a class="copiable-link" href='#index-false'> &para;</a></span></dt>
<dd>
<p><code class="code">false</code> represents the Boolean constant of the same name.
Maxima implements <code class="code">false</code> by the value <code class="code">NIL</code> in Lisp.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Constants">Constants</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="g_t_0025gamma"></a><a class="anchor" id="Item_003a-Constants_002fdefvr_002f_0025gamma"></a><dl class="first-defvr">
<dt class="defvr" id="index-_0025gamma"><span class="category-def">Constant: </span><span><strong class="def-name">%gamma</strong><a class="copiable-link" href='#index-_0025gamma'> &para;</a></span></dt>
<dd>
<p>The Euler-Mascheroni constant, 0.5772156649015329.... It is defined by (<a class="url" href="https://personal.math.ubc.ca/~cbm/aands/page_255.htm">A&amp;S eqn 6.1.3</a> and <a class="url" href="https://dlmf.nist.gov/5.2.ii">DLMF 5.2.ii</a>)
$$
\gamma = \lim_{n \rightarrow \infty} \left(\sum_{k=1}^n {1\over k} - \log n\right)
$$
</p>


<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Constants">Constants</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="ind"></a><a class="anchor" id="Item_003a-Constants_002fdefvr_002find"></a><dl class="first-defvr">
<dt class="defvr" id="index-ind"><span class="category-def">Constant: </span><span><strong class="def-name">ind</strong><a class="copiable-link" href='#index-ind'> &para;</a></span></dt>
<dd>
<p><code class="code">ind</code> represents a bounded, indefinite result.
</p>
<p>See also <code class="code"><a class="ref" href="maxima_16.html#limit">limit</a></code>.
</p>
<p>Example:
</p>
<div class="example">
<pre class="example-preformatted">(%i1) limit (sin(1/x), x, 0);
(%o1)                          ind
</pre></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Constants">Constants</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="inf"></a><a class="anchor" id="Item_003a-Constants_002fdefvr_002finf"></a><dl class="first-defvr">
<dt class="defvr" id="index-inf"><span class="category-def">Constant: </span><span><strong class="def-name">inf</strong><a class="copiable-link" href='#index-inf'> &para;</a></span></dt>
<dd>
<p><code class="code">inf</code> represents real positive infinity.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Constants">Constants</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="infinity"></a><a class="anchor" id="Item_003a-Constants_002fdefvr_002finfinity"></a><dl class="first-defvr">
<dt class="defvr" id="index-infinity"><span class="category-def">Constant: </span><span><strong class="def-name">infinity</strong><a class="copiable-link" href='#index-infinity'> &para;</a></span></dt>
<dd>
<p><code class="code">infinity</code> represents complex infinity.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Constants">Constants</a>
&middot;
</div>
</dd></dl>


<a class="anchor" id="least_005fnegative_005ffloat"></a><a class="anchor" id="Item_003a-Constants_002fdefvr_002fleast_005fnegative_005ffloat"></a><dl class="first-defvr">
<dt class="defvr" id="index-least_005fnegative_005ffloat"><span class="category-def">Constant: </span><span><strong class="def-name">least_negative_float</strong><a class="copiable-link" href='#index-least_005fnegative_005ffloat'> &para;</a></span></dt>
<dd><p>The least negative floating-point number in Maxima.  That is, the
negative floating-point number closest to 0.  It is approximately
-4.94065e-324, when
<a class="url" href="https://en.wikipedia.org/wiki/Subnormal_number">denormal</a> numbers
are supported.  Otherwise it is the same as
<code class="code"><a class="ref" href="#least_005fnegative_005fnormalized_005ffloat">least_negative_normalized_float</a></code>.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Constants">Constants</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="least_005fnegative_005fnormalized_005ffloat"></a><a class="anchor" id="Item_003a-Constants_002fdefvr_002fleast_005fnegative_005fnormalized_005ffloat"></a><dl class="first-defvr">
<dt class="defvr" id="index-least_005fnegative_005fnormalized_005ffloat"><span class="category-def">Constant: </span><span><strong class="def-name">least_negative_normalized_float</strong><a class="copiable-link" href='#index-least_005fnegative_005fnormalized_005ffloat'> &para;</a></span></dt>
<dd><p>The least negative normalized floating-point number in Maxima.  That
is, the negative normalized floating-point number closest to 0.  It is
approximately -2.22507e-308.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Constants">Constants</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="least_005fpositive_005ffloat"></a><a class="anchor" id="Item_003a-Constants_002fdefvr_002fleast_005fpositive_005ffloat"></a><dl class="first-defvr">
<dt class="defvr" id="index-least_005fpositive_005ffloat"><span class="category-def">Constant: </span><span><strong class="def-name">least_positive_float</strong><a class="copiable-link" href='#index-least_005fpositive_005ffloat'> &para;</a></span></dt>
<dd><p>The least positive floating-point number in Maxima.  That is, the
positive floating-point number closest to 0.  It is approximately
4.94065e-324, when
<a class="url" href="https://en.wikipedia.org/wiki/Subnormal_number">denormal</a> numbers
are supported.  Otherwise it is the same as
<code class="code"><a class="ref" href="#least_005fpositive_005fnormalized_005ffloat">least_positive_normalized_float</a></code>.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Constants">Constants</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="least_005fpositive_005fnormalized_005ffloat"></a><a class="anchor" id="Item_003a-Constants_002fdefvr_002fleast_005fpositive_005fnormalized_005ffloat"></a><dl class="first-defvr">
<dt class="defvr" id="index-least_005fpositive_005fnormalized_005ffloat"><span class="category-def">Constant: </span><span><strong class="def-name">least_positive_normalized_float</strong><a class="copiable-link" href='#index-least_005fpositive_005fnormalized_005ffloat'> &para;</a></span></dt>
<dd><p>The least positive normalized floating-point number in Maxima.  That
is, the positive normalized floating-point number closest to 0.  It is
approximately 2.22507e-308.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Constants">Constants</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="minf"></a><a class="anchor" id="Item_003a-Constants_002fdefvr_002fminf"></a><dl class="first-defvr">
<dt class="defvr" id="index-minf"><span class="category-def">Constant: </span><span><strong class="def-name">minf</strong><a class="copiable-link" href='#index-minf'> &para;</a></span></dt>
<dd>
<p><code class="code">minf</code> represents real minus (i.e., negative) infinity.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Constants">Constants</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="most_005fnegative_005ffloat"></a><a class="anchor" id="Item_003a-Constants_002fdefvr_002fmost_005fnegative_005ffloat"></a><dl class="first-defvr">
<dt class="defvr" id="index-most_005fnegative_005ffloat"><span class="category-def">Constant: </span><span><strong class="def-name">most_negative_float</strong><a class="copiable-link" href='#index-most_005fnegative_005ffloat'> &para;</a></span></dt>
<dd><p>The most negative floating-point number in Maxima.  It is
approximately -1.79769e+308.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Constants">Constants</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="most_005fpositive_005ffloat"></a><a class="anchor" id="Item_003a-Constants_002fdefvr_002fmost_005fpositive_005ffloat"></a><dl class="first-defvr">
<dt class="defvr" id="index-most_005fpositive_005ffloat"><span class="category-def">Constant: </span><span><strong class="def-name">most_positive_float</strong><a class="copiable-link" href='#index-most_005fpositive_005ffloat'> &para;</a></span></dt>
<dd><p>The most positive floating-point number in Maxima.  It is
approximately 1.797693e+308.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Constants">Constants</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="g_t_0025phi"></a><a class="anchor" id="Item_003a-Constants_002fdefvr_002f_0025phi"></a><dl class="first-defvr">
<dt class="defvr" id="index-_0025phi"><span class="category-def">Constant: </span><span><strong class="def-name">%phi</strong><a class="copiable-link" href='#index-_0025phi'> &para;</a></span></dt>
<dd>
<p><code class="code">%phi</code> represents the so-called <i class="i">golden mean</i>, 
\((1+\sqrt{5})/2\)
.
The numeric value of <code class="code">%phi</code> is the double-precision floating-point value
1.618033988749895d0.
</p>
<p><code class="code"><a class="ref" href="maxima_28.html#fibtophi">fibtophi</a></code> expresses Fibonacci numbers <code class="code">fib(n)</code> in terms of
<code class="code">%phi</code>.
</p>
<p>By default, Maxima does not know the algebraic properties of <code class="code">%phi</code>.
After evaluating <code class="code">tellrat(%phi^2 - %phi - 1)</code> and <code class="code">algebraic: true</code>,
<code class="code"><a class="ref" href="maxima_13.html#ratsimp">ratsimp</a></code> can simplify some expressions containing <code class="code">%phi</code>.
</p>
<p>Examples:
</p>
<p><code class="code">fibtophi</code> expresses Fibonacci numbers <code class="code">fib(n)</code> in terms of <code class="code">%phi</code>.
</p>
<div class="example">
<pre class="example-preformatted">(%i1) fibtophi (fib (n));
                           n             n
                       %phi  - (1 - %phi)
(%o1)                  -------------------
                           2 %phi - 1
(%i2) fib (n-1) + fib (n) - fib (n+1);
(%o2)          - fib(n + 1) + fib(n) + fib(n - 1)
(%i3) fibtophi (%);
            n + 1             n + 1       n             n
        %phi      - (1 - %phi)        %phi  - (1 - %phi)
(%o3) - --------------------------- + -------------------
                2 %phi - 1                2 %phi - 1
                                          n - 1             n - 1
                                      %phi      - (1 - %phi)
                                    + ---------------------------
                                              2 %phi - 1
(%i4) ratsimp (%);
(%o4)                           0
</pre></div>

<p>By default, Maxima does not know the algebraic properties of <code class="code">%phi</code>.
After evaluating <code class="code">tellrat (%phi^2 - %phi - 1)</code> and <code class="code">algebraic: true</code>,
<code class="code">ratsimp</code> can simplify some expressions containing <code class="code">%phi</code>.
</p>
<div class="example">
<pre class="example-preformatted">(%i1) e : expand ((%phi^2 - %phi - 1) * (A + 1));
                 2                      2
(%o1)        %phi  A - %phi A - A + %phi  - %phi - 1
(%i2) ratsimp (e);
                  2                     2
(%o2)        (%phi  - %phi - 1) A + %phi  - %phi - 1
(%i3) tellrat (%phi^2 - %phi - 1);
                            2
(%o3)                  [%phi  - %phi - 1]
(%i4) algebraic : true;
(%o4)                         true
(%i5) ratsimp (e);
(%o5)                           0
</pre></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Constants">Constants</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="g_t_0025pi"></a><a class="anchor" id="Item_003a-Constants_002fdefvr_002f_0025pi"></a><dl class="first-defvr">
<dt class="defvr" id="index-_0025pi"><span class="category-def">Constant: </span><span><strong class="def-name">%pi</strong><a class="copiable-link" href='#index-_0025pi'> &para;</a></span></dt>
<dd>
<p><code class="code">%pi</code> represents the ratio of the perimeter of a circle to its diameter.
The numeric value of <code class="code">%pi</code> is the double-precision floating-point value
3.141592653589793d0.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Constants">Constants</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="true"></a><a class="anchor" id="Item_003a-Constants_002fdefvr_002ftrue"></a><dl class="first-defvr">
<dt class="defvr" id="index-true"><span class="category-def">Constant: </span><span><strong class="def-name">true</strong><a class="copiable-link" href='#index-true'> &para;</a></span></dt>
<dd>
<p><code class="code">true</code> represents the Boolean constant of the same name.
Maxima implements <code class="code">true</code> by the value <code class="code">T</code> in Lisp.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Constants">Constants</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="und"></a><a class="anchor" id="Item_003a-Constants_002fdefvr_002fund"></a><dl class="first-defvr">
<dt class="defvr" id="index-und"><span class="category-def">Constant: </span><span><strong class="def-name">und</strong><a class="copiable-link" href='#index-und'> &para;</a></span></dt>
<dd>
<p><code class="code">und</code> represents an undefined result.
</p>
<p>See also <code class="code"><a class="ref" href="maxima_16.html#limit">limit</a></code>.
</p>
<p>Example:
</p>
<div class="example">
<pre class="example-preformatted">(%i1) limit (x*sin(x), x, inf);
(%o1)                          und
</pre></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Constants">Constants</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="zeroa"></a><a class="anchor" id="Item_003a-Constants_002fdefvr_002fzeroa"></a><dl class="first-defvr">
<dt class="defvr" id="index-zeroa"><span class="category-def">Constant: </span><span><strong class="def-name">zeroa</strong><a class="copiable-link" href='#index-zeroa'> &para;</a></span></dt>
<dd>
<p><code class="code">zeroa</code> represents an infinitesimal above zero.  <code class="code">zeroa</code> can be used
in expressions.  <code class="code">limit</code> simplifies expressions which contain
infinitesimals.
</p>
<p>See also <code class="code"><a class="ref" href="#zerob">zerob</a></code> and <code class="code"><a class="ref" href="maxima_16.html#limit">limit</a></code>.
</p>
<p>Example:
</p>
<p><code class="code">limit</code> simplifies expressions which contain infinitesimals:
</p>
<div class="example">
<pre class="example-preformatted">(%i1) limit(zeroa);
(%o1)                           0
(%i2) limit(x+zeroa);
(%o2)                           x
</pre></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Constants">Constants</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="zerob"></a><a class="anchor" id="Item_003a-Constants_002fdefvr_002fzerob"></a><dl class="first-defvr">
<dt class="defvr" id="index-zerob"><span class="category-def">Constant: </span><span><strong class="def-name">zerob</strong><a class="copiable-link" href='#index-zerob'> &para;</a></span></dt>
<dd>
<p><code class="code">zerob</code> represents an infinitesimal below zero.  <code class="code">zerob</code> can be used
in expressions.  <code class="code">limit</code> simplifies expressions which contain
infinitesimals.
</p>
<p>See also <code class="code"><a class="ref" href="#zeroa">zeroa</a></code> and <code class="code"><a class="ref" href="maxima_16.html#limit">limit</a></code>.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Constants">Constants</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="Item_003a-Lists_002fnode_002fLists"></a><hr>
</div>
</div>
<div class="section-level-extent" id="Lists">
<div class="nav-panel">
<p>
Next: <a href="#Arrays" accesskey="n" rel="next">Arrays</a>, Previous: <a href="#Constants" accesskey="p" rel="prev">Constants</a>, Up: <a href="#Data-Types-and-Structures" accesskey="u" rel="up">Data Types and Structures</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="Table of contents" rel="contents">Contents</a>][<a href="Function-and-Variable-Index.html" title="Index" rel="index">Index</a>]</p>
</div>
<h3 class="section" id="Lists-1">5.4 Lists</h3>


<a class="anchor" id="Item_003a-Lists_002fnode_002fIntroduction-to-Lists"></a><ul class="mini-toc">
<li><a href="#Introduction-to-Lists" accesskey="1">Introduction to Lists</a></li>
<li><a href="#Functions-and-Variables-for-Lists" accesskey="2">Functions and Variables for Lists</a></li>
<li><a href="#Performance-considerations-for-Lists" accesskey="3">Performance considerations for Lists</a></li>
</ul>
<hr>
<div class="subsection-level-extent" id="Introduction-to-Lists">
<div class="nav-panel">
<p>
Next: <a href="#Functions-and-Variables-for-Lists" accesskey="n" rel="next">Functions and Variables for Lists</a>, Previous: <a href="#Lists" accesskey="p" rel="prev">Lists</a>, Up: <a href="#Lists" accesskey="u" rel="up">Lists</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="Table of contents" rel="contents">Contents</a>][<a href="Function-and-Variable-Index.html" title="Index" rel="index">Index</a>]</p>
</div>
<h4 class="subsection" id="Introduction-to-Lists-1">5.4.1 Introduction to Lists</h4>

<p>Lists are the basic building block for Maxima and Lisp.  All data types
other than arrays, <code class="code"><a class="ref" href="#hashed-arrays">hashed arrays</a></code> and numbers are represented as Lisp lists,
These Lisp lists have the form
</p>
<div class="example">
<pre class="example-preformatted">((MPLUS) $A 2)
</pre></div>

<p>to indicate an expression <code class="code">a+2</code>.  At Maxima level one would see
the infix notation <code class="code">a+2</code>.  Maxima also has lists which are printed
as
</p>
<div class="example">
<pre class="example-preformatted">[1, 2, 7, x+y]
</pre></div>

<p>for a list with 4 elements.  Internally this corresponds to a Lisp list
of the form
</p>
<div class="example">
<pre class="example-preformatted">((MLIST) 1 2 7 ((MPLUS) $X $Y))
</pre></div>

<p>The flag which denotes the type field of the Maxima expression is a list
itself, since after it has been through the simplifier the list would become
</p>
<div class="example">
<pre class="example-preformatted">((MLIST SIMP) 1 2 7 ((MPLUS SIMP) $X $Y))
</pre></div>

<a class="anchor" id="Item_003a-Lists_002fnode_002fFunctions-and-Variables-for-Lists"></a><hr>
</div>
<div class="subsection-level-extent" id="Functions-and-Variables-for-Lists">
<div class="nav-panel">
<p>
Next: <a href="#Performance-considerations-for-Lists" accesskey="n" rel="next">Performance considerations for Lists</a>, Previous: <a href="#Introduction-to-Lists" accesskey="p" rel="prev">Introduction to Lists</a>, Up: <a href="#Lists" accesskey="u" rel="up">Lists</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="Table of contents" rel="contents">Contents</a>][<a href="Function-and-Variable-Index.html" title="Index" rel="index">Index</a>]</p>
</div>
<h4 class="subsection" id="Functions-and-Variables-for-Lists-1">5.4.2 Functions and Variables for Lists</h4>

<a class="anchor" id="g_t_005b"></a><a class="anchor" id="g_t_005d"></a><a class="index-entry-id" id="index-List-delimiters"></a>
<a class="index-entry-id" id="index-Subscript-operator"></a>

<a class="anchor" id="Item_003a-Lists_002fdefvr_002f_005b"></a><dl class="first-defvr">
<dt class="defvr" id="index-_005b"><span class="category-def">Operator: </span><span><strong class="def-name">[</strong><a class="copiable-link" href='#index-_005b'> &para;</a></span></dt>
<dd><a class="anchor" id="Item_003a-Lists_002fdefvr_002f_005d"></a></dd><dt class="defvrx def-cmd-defvr" id="index-_005d"><span class="category-def">Operator: </span><span><strong class="def-name">]</strong><a class="copiable-link" href='#index-_005d'> &para;</a></span></dt>
<dd>
<p><code class="code">[</code> and <code class="code">]</code> mark the beginning and end, respectively, of a list.
</p>
<p><code class="code">[</code> and <code class="code">]</code> also enclose the subscripts of
a list, array, <code class="code"><a class="ref" href="#hashed-array">hashed array</a></code>, or <code class="code"><a class="ref" href="maxima_35.html#memoizing-function">memoizing function</a></code>. Note that
other than for arrays accessing the <code class="code">n</code>th element of a list
may need an amount of time that is roughly proportional to  <code class="code">n</code>,
See <a class="xref" href="#Performance-considerations-for-Lists">Performance considerations for Lists</a>.
</p>
<p>Note that if an element of a subscripted variable is written to before
a list or an array of this name is declared a <code class="code"><a class="ref" href="#hashed-array">hashed array</a></code>
(see <a class="pxref" href="#Arrays">Arrays</a>) is created, not a list.
</p>
<p>Examples:
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) x: [a, b, c];
(%o1)                       [a, b, c]
</pre></div><div class="group"><pre class="example-preformatted">(%i2) x[3];
(%o2)                           c
</pre></div><div class="group"><pre class="example-preformatted">(%i3) array (y, fixnum, 3);
(%o3)                           y
</pre></div><div class="group"><pre class="example-preformatted">(%i4) y[2]: %pi;
(%o4)                          %pi
</pre></div><div class="group"><pre class="example-preformatted">(%i5) y[2];
(%o5)                          %pi
</pre></div><div class="group"><pre class="example-preformatted">(%i6) z['foo]: 'bar;
(%o6)                          bar
</pre></div><div class="group"><pre class="example-preformatted">(%i7) z['foo];
(%o7)                          bar
</pre></div><div class="group"><pre class="example-preformatted">(%i8) g[k] := 1/(k^2+1);
                                  1
(%o8)                     g  := ------
                           k     2
                                k  + 1
</pre></div><div class="group"><pre class="example-preformatted">(%i9) g[10];
                                1
(%o9)                          ---
                               101
</pre></div></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Lists">Lists</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Operators">Operators</a>
&middot;
</div>
</dd></dl>


<a class="anchor" id="append"></a><a class="anchor" id="Item_003a-Lists_002fdeffn_002fappend"></a><dl class="first-deffn">
<dt class="deffn" id="index-append"><span class="category-def">Function: </span><span><strong class="def-name">append</strong> <var class="def-var-arguments">(<var class="var">list_1</var>, &hellip;, <var class="var">list_n</var>)</var><a class="copiable-link" href='#index-append'> &para;</a></span></dt>
<dd>
<p>Returns a single list of the elements of <var class="var">list_1</var> followed
by the elements of <var class="var">list_2</var>, &hellip;  <code class="code">append</code> also works on
general expressions, e.g. <code class="code">append (f(a,b), f(c,d,e));</code> yields
<code class="code">f(a,b,c,d,e)</code>.
</p>
<p>See also <code class="code"><a class="ref" href="maxima_22.html#addrow">addrow</a></code>, <code class="code"><a class="ref" href="maxima_22.html#addcol">addcol</a></code> and <code class="code"><a class="ref" href="#join">join</a></code>.
</p>
<p>Do <code class="code">example(append);</code> for an example.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Lists">Lists</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Expressions">Expressions</a>
&middot;
</div>
</dd></dl>


<a class="anchor" id="assoc"></a><a class="anchor" id="Item_003a-Lists_002fdeffn_002fassoc"></a><dl class="first-deffn">
<dt class="deffn" id="index-assoc"><span class="category-def">Function: </span><span><strong class="def-name">assoc</strong> <var class="def-var-arguments"><br>&nbsp;&nbsp;&nbsp;&nbsp;<code class="t">assoc</code> (<var class="var">key</var>, <var class="var">e</var>, <var class="var">default</var>) <br>&nbsp;&nbsp;&nbsp;&nbsp;<code class="t">assoc</code> (<var class="var">key</var>, <var class="var">e</var>)</var><a class="copiable-link" href='#index-assoc'> &para;</a></span></dt>
<dd>
<p><code class="code">assoc</code> searches for <var class="var">key</var> as the first part of an argument of <var class="var">e</var>
and returns the second part of the first match, if any.
</p>
<p><var class="var">key</var> may be any expression.
<var class="var">e</var> must be a nonatomic expression,
and every argument of <var class="var">e</var> must have exactly two parts.
<code class="code">assoc</code> returns the second part of the first matching argument of <var class="var">e</var>.
Matches are determined by <code class="code">is(<var class="var">key</var> = first(<var class="var">a</var>))</code>
where <var class="var">a</var> is an argument of <var class="var">e</var>.
</p>
<p>If there are two or more matches, only the first is returned.
If there are no matches, <var class="var">default</var> is returned, if specified.
Otherwise, <code class="code">false</code> is returned.
</p>
<p>See also <code class="code"><a class="ref" href="#sublist">sublist</a></code> and <code class="code"><a class="ref" href="#member">member</a></code>.
</p>
<p>Examples:
</p>
<p><var class="var">key</var> may be any expression.
<var class="var">e</var> must be a nonatomic expression,
and every argument of <var class="var">e</var> must have exactly two parts.
<code class="code">assoc</code> returns the second part of the first matching argument of <var class="var">e</var>.
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) assoc (f(x), foo(g(x) = y, f(x) = z + 1, h(x) = 2*u));
(%o1)                         z + 1
</pre></div></div>

<p>If there are two or more matches, only the first is returned.
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) assoc (yy, [xx = 111, yy = 222, yy = 333, yy = 444]);
(%o1)                          222
</pre></div></div>

<p>If there are no matches, <var class="var">default</var> is returned, if specified.
Otherwise, <code class="code">false</code> is returned.
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) assoc (abc, [[x, 111], [y, 222], [z, 333]], none); 
(%o1)                         none
(%i2) assoc (abc, [[x, 111], [y, 222], [z, 333]]);
(%o2)                         false
</pre></div></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Lists">Lists</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Expressions">Expressions</a>
&middot;
</div>
</dd></dl>


<a class="anchor" id="cons"></a><a class="anchor" id="Item_003a-Lists_002fdeffn_002fcons"></a><dl class="first-deffn">
<dt class="deffn" id="index-cons"><span class="category-def">Function: </span><span><strong class="def-name">cons</strong> <var class="def-var-arguments"><br>&nbsp;&nbsp;&nbsp;&nbsp;<code class="t">cons</code> (<var class="var">expr</var>, <var class="var">list</var>) <br>&nbsp;&nbsp;&nbsp;&nbsp;<code class="t">cons</code> (<var class="var">expr_1</var>, <var class="var">expr_2</var>)</var><a class="copiable-link" href='#index-cons'> &para;</a></span></dt>
<dd>
<p><code class="code">cons (<var class="var">expr</var>, <var class="var">list</var>)</code> returns a new list constructed of the element 
<var class="var">expr</var> as its first element, followed by the elements of <var class="var">list</var>. This is 
analogous to the Lisp language construction operation &quot;cons&quot;.
</p>
<p>The Maxima function <code class="code">cons</code> can also be used where the second argument is other
than a list and this might be useful. In this case, <code class="code">cons (<var class="var">expr_1</var>, <var class="var">expr_2</var>)</code>
returns an expression with same operator as <var class="var">expr_2</var> but with argument <code class="code">cons(expr_1, args(expr_2))</code>.
Examples:
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) cons(a,[b,c,d]);
(%o1)                     [a, b, c, d]
</pre></div><div class="group"><pre class="example-preformatted">(%i2) cons(a,f(b,c,d));
(%o2)                     f(a, b, c, d)
</pre></div></div>

<p>In general, <code class="code">cons</code> applied to a nonlist doesn&rsquo;t make sense. For instance, <code class="code">cons(a,b^c)</code>
results in an illegal expression, since &rsquo;^&rsquo; cannot take three arguments. 
</p>
<p>When <code class="code">inflag</code> is true, <code class="code">cons</code> operates on the internal structure of an expression, otherwise
<code class="code">cons</code> operates on the displayed form. Especially when <code class="code">inflag</code> is true, <code class="code">cons</code> applied 
to a nonlist sometimes gives a surprising result; for example
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) cons(a,-a), inflag : true;
                                 2
(%o1)                         - a
</pre></div><div class="group"><pre class="example-preformatted">(%i2) cons(a,-a), inflag : false;
(%o2)                           0
</pre></div></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Lists">Lists</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Expressions">Expressions</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="copylist"></a><a class="anchor" id="Item_003a-Lists_002fdeffn_002fcopylist"></a><dl class="first-deffn">
<dt class="deffn" id="index-copylist"><span class="category-def">Function: </span><span><strong class="def-name">copylist</strong> <var class="def-var-arguments">(<var class="var">list</var>)</var><a class="copiable-link" href='#index-copylist'> &para;</a></span></dt>
<dd>
<p>Returns a copy of the list <var class="var">list</var>.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Lists">Lists</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="create_005flist"></a><a class="anchor" id="Item_003a-Lists_002fdeffn_002fcreate_005flist"></a><dl class="first-deffn">
<dt class="deffn" id="index-create_005flist"><span class="category-def">Function: </span><span><strong class="def-name">create_list</strong> <var class="def-var-arguments">(<var class="var">form</var>, <var class="var">x_1</var>, <var class="var">list_1</var>, &hellip;, <var class="var">x_n</var>, <var class="var">list_n</var>)</var><a class="copiable-link" href='#index-create_005flist'> &para;</a></span></dt>
<dd>
<p>Create a list by evaluating <var class="var">form</var> with <var class="var">x_1</var> bound to
each element of <var class="var">list_1</var>, and for each such binding bind <var class="var">x_2</var>
to each element of <var class="var">list_2</var>, &hellip;
The number of elements in the result will be
the product of the number of elements in each list.
Each variable <var class="var">x_i</var> must actually be a symbol &ndash; it will not be evaluated.
The list arguments will be evaluated once at the beginning of the
iteration.
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) create_list (x^i, i, [1, 3, 7]);
                                3   7
(%o1)                      [x, x , x ]
</pre></div></div>

<p>With a double iteration:
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) create_list ([i, j], i, [a, b], j, [e, f, h]);
(%o1)   [[a, e], [a, f], [a, h], [b, e], [b, f], [b, h]]
</pre></div></div>

<p>Instead of <var class="var">list_i</var> two args may be supplied each of which should
evaluate to a number.  These will be the inclusive lower and
upper bounds for the iteration.
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) create_list ([i, j], i, [1, 2, 3], j, 1, i);
(%o1)   [[1, 1], [2, 1], [2, 2], [3, 1], [3, 2], [3, 3]]
</pre></div></div>

<p>Note that the limits or list for the <code class="code">j</code> variable can
depend on the current value of <code class="code">i</code>.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Lists">Lists</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="delete"></a><a class="anchor" id="Item_003a-Lists_002fdeffn_002fdelete"></a><dl class="first-deffn">
<dt class="deffn" id="index-delete"><span class="category-def">Function: </span><span><strong class="def-name">delete</strong> <var class="def-var-arguments"><br>&nbsp;&nbsp;&nbsp;&nbsp;<code class="t">delete</code> (<var class="var">expr_1</var>, <var class="var">expr_2</var>) <br>&nbsp;&nbsp;&nbsp;&nbsp;<code class="t">delete</code> (<var class="var">expr_1</var>, <var class="var">expr_2</var>, <var class="var">n</var>)</var><a class="copiable-link" href='#index-delete'> &para;</a></span></dt>
<dd>
<p><code class="code">delete(<var class="var">expr_1</var>, <var class="var">expr_2</var>)</code>
removes from <var class="var">expr_2</var> any arguments of its top-level operator
which are the same (as determined by &quot;=&quot;) as <var class="var">expr_1</var>.
Note that &quot;=&quot; tests for formal equality, not equivalence.
Note also that arguments of subexpressions are not affected.
</p>
<p><var class="var">expr_1</var> may be an atom or a non-atomic expression.
<var class="var">expr_2</var> may be any non-atomic expression.
<code class="code">delete</code> returns a new expression;
it does not modify <var class="var">expr_2</var>.
</p>
<p><code class="code">delete(<var class="var">expr_1</var>, <var class="var">expr_2</var>, <var class="var">n</var>)</code>
removes from <var class="var">expr_2</var> the first <var class="var">n</var> arguments of the top-level operator
which are the same as <var class="var">expr_1</var>.
If there are fewer than <var class="var">n</var> such arguments,
then all such arguments are removed.
</p>
<p>Examples:
</p>
<p>Removing elements from a list.
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) delete (y, [w, x, y, z, z, y, x, w]);
(%o1)                  [w, x, z, z, x, w]
</pre></div></div>

<p>Removing terms from a sum.
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) delete (sin(x), x + sin(x) + y);
(%o1)                         y + x
</pre></div></div>

<p>Removing factors from a product.
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) delete (u - x, (u - w)*(u - x)*(u - y)*(u - z));
(%o1)                (u - w) (u - y) (u - z)
</pre></div></div>

<p>Removing arguments from an arbitrary expression.
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) delete (a, foo (a, b, c, d, a));
(%o1)                     foo(b, c, d)
</pre></div></div>

<p>Limit the number of removed arguments.
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) delete (a, foo (a, b, a, c, d, a), 2);
(%o1)                    foo(b, c, d, a)
</pre></div></div>

<p>Whether arguments are the same as <var class="var">expr_1</var> is determined by &quot;=&quot;.
Arguments which are <code class="code">equal</code> but not &quot;=&quot; are not removed.
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) [is (equal (0, 0)), is (equal (0, 0.0)), is (equal (0, 0b0))];
(%o1)                  [true, true, true]
</pre></div><div class="group"><pre class="example-preformatted">(%i2) [is (0 = 0), is (0 = 0.0), is (0 = 0b0)];
(%o2)                 [true, false, false]
</pre></div><div class="group"><pre class="example-preformatted">(%i3) delete (0, [0, 0.0, 0b0]);
(%o3)                     [0.0, 0.0b0]
</pre></div><div class="group"><pre class="example-preformatted">(%i4) is (equal ((x + y)*(x - y), x^2 - y^2));
(%o4)                         true
</pre></div><div class="group"><pre class="example-preformatted">(%i5) is ((x + y)*(x - y) = x^2 - y^2);
(%o5)                         false
</pre></div><div class="group"><pre class="example-preformatted">(%i6) delete ((x + y)*(x - y), [(x + y)*(x - y), x^2 - y^2]);
                              2    2
(%o6)                       [x  - y ]
</pre></div></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Lists">Lists</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Expressions">Expressions</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="eighth"></a><a class="anchor" id="Item_003a-Lists_002fdeffn_002feighth"></a><dl class="first-deffn">
<dt class="deffn" id="index-eighth"><span class="category-def">Function: </span><span><strong class="def-name">eighth</strong> <var class="def-var-arguments">(<var class="var">expr</var>)</var><a class="copiable-link" href='#index-eighth'> &para;</a></span></dt>
<dd>
<p>Returns the 8th item of expression or list <var class="var">expr</var>.
See <code class="code"><a class="ref" href="#first">first</a></code> for more details.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Lists">Lists</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Expressions">Expressions</a>
&middot;
</div>
</dd></dl>


<a class="anchor" id="endcons"></a><a class="anchor" id="Item_003a-Lists_002fdeffn_002fendcons"></a><dl class="first-deffn">
<dt class="deffn" id="index-endcons"><span class="category-def">Function: </span><span><strong class="def-name">endcons</strong> <var class="def-var-arguments"><br>&nbsp;&nbsp;&nbsp;&nbsp;<code class="t">endcons</code> (<var class="var">expr</var>, <var class="var">list</var>) <br>&nbsp;&nbsp;&nbsp;&nbsp;<code class="t">endcons</code> (<var class="var">expr_1</var>, <var class="var">expr_2</var>)</var><a class="copiable-link" href='#index-endcons'> &para;</a></span></dt>
<dd>
<p><code class="code">endcons (<var class="var">expr</var>, <var class="var">list</var>)</code> returns a new list constructed of the elements of 
<var class="var">list</var> followed by <var class="var">expr</var>. The Maxima function <code class="code">endcons</code> can also be used where 
the second argument is other than a list and this might be useful. In this case,
<code class="code">endcons (<var class="var">expr_1</var>, <var class="var">expr_2</var>)</code> returns an expression with same operator as 
<var class="var">expr_2</var> but with argument <code class="code">endcons(expr_1, args(expr_2))</code>. Examples:
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) endcons(a,[b,c,d]);
(%o1)                     [b, c, d, a]
</pre></div><div class="group"><pre class="example-preformatted">(%i2) endcons(a,f(b,c,d));
(%o2)                     f(b, c, d, a)
</pre></div></div>

<p>In general, <code class="code">endcons</code> applied to a nonlist doesn&rsquo;t make sense. For instance, <code class="code">endcons(a,b^c)</code>
results in an illegal expression, since &rsquo;^&rsquo; cannot take three arguments. 
</p>
<p>When <code class="code">inflag</code> is true, <code class="code">endcons</code> operates on the internal structure of an expression, otherwise
<code class="code">endcons</code> operates on the displayed form. Especially when <code class="code">inflag</code> is true, <code class="code">endcons</code> applied 
to a nonlist sometimes gives a surprising result; for example
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) endcons(a,-a), inflag : true;
                                 2
(%o1)                         - a
</pre></div><div class="group"><pre class="example-preformatted">(%i2) endcons(a,-a), inflag : false;
(%o2)                           0
</pre></div></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Lists">Lists</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Expressions">Expressions</a>
&middot;
</div>
</dd></dl>


<a class="anchor" id="fifth"></a><a class="anchor" id="Item_003a-Lists_002fdeffn_002ffifth"></a><dl class="first-deffn">
<dt class="deffn" id="index-fifth"><span class="category-def">Function: </span><span><strong class="def-name">fifth</strong> <var class="def-var-arguments">(<var class="var">expr</var>)</var><a class="copiable-link" href='#index-fifth'> &para;</a></span></dt>
<dd>
<p>Returns the 5th item of expression or list <var class="var">expr</var>.
See <code class="code"><a class="ref" href="#first">first</a></code> for more details.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Lists">Lists</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Expressions">Expressions</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="first"></a><a class="anchor" id="Item_003a-Lists_002fdeffn_002ffirst"></a><dl class="first-deffn">
<dt class="deffn" id="index-first"><span class="category-def">Function: </span><span><strong class="def-name">first</strong> <var class="def-var-arguments">(<var class="var">expr</var>)</var><a class="copiable-link" href='#index-first'> &para;</a></span></dt>
<dd>
<p>Returns the first part of <var class="var">expr</var> which may result in the first element of a
list, the first row of a matrix, the first term of a sum, etc.:
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) matrix([1,2],[3,4]);
                                   [ 1  2 ]
(%o1)                              [      ]
                                   [ 3  4 ]
(%i2) first(%);
(%o2)                              [1,2]
(%i3) first(%);
(%o3)                              1
(%i4) first(a*b/c+d+e/x);
                                   a b
(%o4)                              ---
                                    c
(%i5) first(a=b/c+d+e/x);
(%o5)                              a
</pre></div></div>

<p>Note that
<code class="code">first</code> and its related functions, <code class="code">rest</code> and <code class="code">last</code>, work
on the form of <var class="var">expr</var> which is displayed not the form which is typed on
input.  If the variable <code class="code"><a class="ref" href="maxima_5.html#inflag">inflag</a></code> is set to <code class="code">true</code> however, these
functions will look at the internal form of <var class="var">expr</var>. One reason why this may
make a difference is that the simplifier re-orders expressions:
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) x+y;
(%o1)                              y+1
(%i2) first(x+y),inflag : true;
(%o2)                              x
(%i3) first(x+y),inflag : false;
(%o3)                              y
</pre></div></div>

<p>The functions <code class="code">second</code> &hellip;
<code class="code">tenth</code> yield the second through the tenth part of their input argument.
</p>
<p>See also <code class="code"><a class="ref" href="#firstn">firstn</a></code> and <code class="code"><a class="ref" href="maxima_5.html#part">part</a></code>.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Lists">Lists</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Expressions">Expressions</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="firstn"></a><a class="anchor" id="Item_003a-Lists_002fdeffn_002ffirstn"></a><dl class="first-deffn">
<dt class="deffn" id="index-firstn"><span class="category-def">Function: </span><span><strong class="def-name">firstn</strong> <var class="def-var-arguments">(<var class="var">expr</var>, <var class="var">count</var>)</var><a class="copiable-link" href='#index-firstn'> &para;</a></span></dt>
<dd>
<p>Returns the first <var class="var">count</var> arguments of <var class="var">expr</var>, if <var class="var">expr</var> has at least <var class="var">count</var> arguments.
Returns <var class="var">expr</var> if <var class="var">expr</var> has less than <var class="var">count</var> arguments.
</p>
<p><var class="var">expr</var> may be any nonatomic expression. 
When <var class="var">expr</var> is something other than a list,
<code class="code">firstn</code> returns an expression which has the same operator as <var class="var">expr</var>.
<var class="var">count</var> must be a nonnegative integer.
</p>
<p><code class="code">firstn</code> honors the global flag <code class="code">inflag</code>,
which governs whether the internal form of an expression is processed (when <code class="code">inflag</code> is true)
or the displayed form (when <code class="code">inflag</code> is false).
</p>
<p>Note that <code class="code">firstn(<var class="var">expr</var>, 1)</code>,
which returns a nonatomic expression containing the first argument,
is not the same as <code class="code">first(<var class="var">expr</var>)</code>,
which returns the first argument by itself.
</p>
<p>See also <code class="code"><a class="ref" href="#lastn">lastn</a></code> and <code class="code"><a class="ref" href="#rest">rest</a></code>.
</p>
<p>Examples:
</p>
<p><code class="code">firstn</code> returns the first <var class="var">count</var> elements of <var class="var">expr</var>, if <var class="var">expr</var> has at least <var class="var">count</var> elements.
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) mylist : [1, a, 2, b, 3, x, 4 - y, 2*z + sin(u)];
(%o1)        [1, a, 2, b, 3, x, 4 - y, 2 z + sin(u)]
</pre></div><div class="group"><pre class="example-preformatted">(%i2) firstn (mylist, 0);
(%o2)                          []
</pre></div><div class="group"><pre class="example-preformatted">(%i3) firstn (mylist, 1);
(%o3)                          [1]
</pre></div><div class="group"><pre class="example-preformatted">(%i4) firstn (mylist, 2);
(%o4)                        [1, a]
</pre></div><div class="group"><pre class="example-preformatted">(%i5) firstn (mylist, 7);
(%o5)               [1, a, 2, b, 3, x, 4 - y]
</pre></div></div>

<p><code class="code">firstn</code> returns <var class="var">expr</var> if <var class="var">expr</var> has less than <var class="var">count</var> elements.
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) mylist : [1, a, 2, b, 3, x, 4 - y, 2*z + sin(u)];
(%o1)        [1, a, 2, b, 3, x, 4 - y, 2 z + sin(u)]
</pre></div><div class="group"><pre class="example-preformatted">(%i2) firstn (mylist, 100);
(%o2)        [1, a, 2, b, 3, x, 4 - y, 2 z + sin(u)]
</pre></div></div>

<p><var class="var">expr</var> may be any nonatomic expression. 
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) myfoo : foo(1, a, 2, b, 3, x, 4 - y, 2*z + sin(u));
(%o1)      foo(1, a, 2, b, 3, x, 4 - y, 2 z + sin(u))
</pre></div><div class="group"><pre class="example-preformatted">(%i2) firstn (myfoo, 4);
(%o2)                    foo(1, a, 2, b)
</pre></div><div class="group"><pre class="example-preformatted">(%i3) mybar : bar[m, n](1, a, 2, b, 3, x, 4 - y, 2*z + sin(u));
(%o3)    bar    (1, a, 2, b, 3, x, 4 - y, 2 z + sin(u))
            m, n
</pre></div><div class="group"><pre class="example-preformatted">(%i4) firstn (mybar, 4);
(%o4)                  bar    (1, a, 2, b)
                          m, n
</pre></div><pre class="example-preformatted">(%i5) mymatrix : genmatrix (lambda ([i, j], 10*i + j), 10, 4) $
</pre><div class="group"><pre class="example-preformatted">(%i6) firstn (mymatrix, 3);
                       [ 11  12  13  14 ]
                       [                ]
(%o6)                  [ 21  22  23  24 ]
                       [                ]
                       [ 31  32  33  34 ]
</pre></div></div>

<p><code class="code">firstn</code> honors the global flag <code class="code">inflag</code>.
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) myexpr : a + b + c + d + e;
(%o1)                   e + d + c + b + a
</pre></div><div class="group"><pre class="example-preformatted">(%i2) firstn (myexpr, 3), inflag=true;
(%o2)                       c + b + a
</pre></div><div class="group"><pre class="example-preformatted">(%i3) firstn (myexpr, 3), inflag=false;
(%o3)                       e + d + c
</pre></div></div>

<p>Note that <code class="code">firstn(<var class="var">expr</var>, 1)</code> is not the same as <code class="code">first(<var class="var">expr</var>)</code>.
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) firstn ([w, x, y, z], 1);
(%o1)                          [w]
</pre></div><div class="group"><pre class="example-preformatted">(%i2) first ([w, x, y, z]);
(%o2)                           w
</pre></div></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Lists">Lists</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Expressions">Expressions</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="fourth"></a><a class="anchor" id="Item_003a-Lists_002fdeffn_002ffourth"></a><dl class="first-deffn">
<dt class="deffn" id="index-fourth"><span class="category-def">Function: </span><span><strong class="def-name">fourth</strong> <var class="def-var-arguments">(<var class="var">expr</var>)</var><a class="copiable-link" href='#index-fourth'> &para;</a></span></dt>
<dd>
<p>Returns the 4th item of expression or list <var class="var">expr</var>.
See <code class="code"><a class="ref" href="#first">first</a></code> for more details.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Lists">Lists</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Expressions">Expressions</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="join"></a><a class="anchor" id="Item_003a-Lists_002fdeffn_002fjoin"></a><dl class="first-deffn">
<dt class="deffn" id="index-join"><span class="category-def">Function: </span><span><strong class="def-name">join</strong> <var class="def-var-arguments">(<var class="var">l</var>, <var class="var">m</var>)</var><a class="copiable-link" href='#index-join'> &para;</a></span></dt>
<dd>
<p>Creates a new list containing the elements of lists <var class="var">l</var> and <var class="var">m</var>,
interspersed.  The result has elements <code class="code">[<var class="var">l</var>[1], <var class="var">m</var>[1],
<var class="var">l</var>[2], <var class="var">m</var>[2], ...]</code>.  The lists <var class="var">l</var> and <var class="var">m</var> may contain any
type of elements.
</p>
<p>If the lists are different lengths, <code class="code">join</code> ignores elements of the longer
list.
</p>
<p>Maxima complains if <var class="var">l</var> or <var class="var">m</var> is not a list.
</p>
<p>See also <code class="code"><a class="ref" href="#append">append</a></code>.
</p>
<p>Examples:
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) L1: [a, sin(b), c!, d - 1];
(%o1)                [a, sin(b), c!, d - 1]
</pre></div><div class="group"><pre class="example-preformatted">(%i2) join (L1, [1, 2, 3, 4]);
(%o2)          [a, 1, sin(b), 2, c!, 3, d - 1, 4]
</pre></div><div class="group"><pre class="example-preformatted">(%i3) join (L1, [aa, bb, cc, dd, ee, ff]);
(%o3)        [a, aa, sin(b), bb, c!, cc, d - 1, dd]
</pre></div></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Lists">Lists</a>
&middot;
</div>
</dd></dl>


<a class="anchor" id="last"></a><a class="anchor" id="Item_003a-Lists_002fdeffn_002flast"></a><dl class="first-deffn">
<dt class="deffn" id="index-last"><span class="category-def">Function: </span><span><strong class="def-name">last</strong> <var class="def-var-arguments">(<var class="var">expr</var>)</var><a class="copiable-link" href='#index-last'> &para;</a></span></dt>
<dd>
<p>Returns the last part (term, row, element, etc.) of the <var class="var">expr</var>.
</p>
<p>See also <code class="code"><a class="ref" href="#lastn">lastn</a></code>.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Lists">Lists</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Expressions">Expressions</a>
&middot;
</div>
</dd></dl>


<a class="anchor" id="lastn"></a><a class="anchor" id="Item_003a-Lists_002fdeffn_002flastn"></a><dl class="first-deffn">
<dt class="deffn" id="index-lastn"><span class="category-def">Function: </span><span><strong class="def-name">lastn</strong> <var class="def-var-arguments">(<var class="var">expr</var>, <var class="var">count</var>)</var><a class="copiable-link" href='#index-lastn'> &para;</a></span></dt>
<dd>
<p>Returns the last <var class="var">count</var> arguments of <var class="var">expr</var>, if <var class="var">expr</var> has at least <var class="var">count</var> arguments.
Returns <var class="var">expr</var> if <var class="var">expr</var> has less than <var class="var">count</var> arguments.
</p>
<p><var class="var">expr</var> may be any nonatomic expression. 
When <var class="var">expr</var> is something other than a list,
<code class="code">lastn</code> returns an expression which has the same operator as <var class="var">expr</var>.
<var class="var">count</var> must be a nonnegative integer.
</p>
<p><code class="code">lastn</code> honors the global flag <code class="code">inflag</code>,
which governs whether the internal form of an expression is processed (when <code class="code">inflag</code> is true)
or the displayed form (when <code class="code">inflag</code> is false).
</p>
<p>Note that <code class="code">lastn(<var class="var">expr</var>, 1)</code>,
which returns a nonatomic expression containing the last argument,
is not the same as <code class="code">last(<var class="var">expr</var>)</code>,
which returns the last argument by itself.
</p>
<p>See also <code class="code"><a class="ref" href="#firstn">firstn</a></code> and <code class="code"><a class="ref" href="#rest">rest</a></code>.
</p>
<p>Examples:
</p>
<p><code class="code">lastn</code> returns the last <var class="var">count</var> elements of <var class="var">expr</var>, if <var class="var">expr</var> has at least <var class="var">count</var> elements.
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) mylist : [1, a, 2, b, 3, x, 4 - y, 2*z + sin(u)];
(%o1)        [1, a, 2, b, 3, x, 4 - y, 2 z + sin(u)]
</pre></div><div class="group"><pre class="example-preformatted">(%i2) lastn (mylist, 0);
(%o2)                          []
</pre></div><div class="group"><pre class="example-preformatted">(%i3) lastn (mylist, 1);
(%o3)                    [2 z + sin(u)]
</pre></div><div class="group"><pre class="example-preformatted">(%i4) lastn (mylist, 2);
(%o4)                 [4 - y, 2 z + sin(u)]
</pre></div><div class="group"><pre class="example-preformatted">(%i5) lastn (mylist, 7);
(%o5)         [a, 2, b, 3, x, 4 - y, 2 z + sin(u)]
</pre></div></div>

<p><code class="code">lastn</code> returns <var class="var">expr</var> if <var class="var">expr</var> has less than <var class="var">count</var> elements.
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) mylist : [1, a, 2, b, 3, x, 4 - y, 2*z + sin(u)];
(%o1)        [1, a, 2, b, 3, x, 4 - y, 2 z + sin(u)]
</pre></div><div class="group"><pre class="example-preformatted">(%i2) lastn (mylist, 100);
(%o2)        [1, a, 2, b, 3, x, 4 - y, 2 z + sin(u)]
</pre></div></div>

<p><var class="var">expr</var> may be any nonatomic expression. 
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) myfoo : foo(1, a, 2, b, 3, x, 4 - y, 2*z + sin(u));
(%o1)      foo(1, a, 2, b, 3, x, 4 - y, 2 z + sin(u))
</pre></div><div class="group"><pre class="example-preformatted">(%i2) lastn (myfoo, 4);
(%o2)            foo(3, x, 4 - y, 2 z + sin(u))
</pre></div><div class="group"><pre class="example-preformatted">(%i3) mybar : bar[m, n](1, a, 2, b, 3, x, 4 - y, 2*z + sin(u));
(%o3)    bar    (1, a, 2, b, 3, x, 4 - y, 2 z + sin(u))
            m, n
</pre></div><div class="group"><pre class="example-preformatted">(%i4) lastn (mybar, 4);
(%o4)          bar    (3, x, 4 - y, 2 z + sin(u))
                  m, n
</pre></div><pre class="example-preformatted">(%i5) mymatrix : genmatrix (lambda ([i, j], 10*i + j), 10, 4) $
</pre><div class="group"><pre class="example-preformatted">(%i6) lastn (mymatrix, 3);
                     [ 81   82   83   84  ]
                     [                    ]
(%o6)                [ 91   92   93   94  ]
                     [                    ]
                     [ 101  102  103  104 ]
</pre></div></div>

<p><code class="code">lastn</code> honors the global flag <code class="code">inflag</code>.
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) myexpr : a + b + c + d + e;
(%o1)                   e + d + c + b + a
</pre></div><div class="group"><pre class="example-preformatted">(%i2) lastn (myexpr, 3), inflag=true;
(%o2)                       e + d + c
</pre></div><div class="group"><pre class="example-preformatted">(%i3) lastn (myexpr, 3), inflag=false;
(%o3)                       c + b + a
</pre></div></div>

<p>Note that <code class="code">lastn(<var class="var">expr</var>, 1)</code> is not the same as <code class="code">last(<var class="var">expr</var>)</code>.
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) lastn ([w, x, y, z], 1);
(%o1)                          [z]
</pre></div><div class="group"><pre class="example-preformatted">(%i2) last ([w, x, y, z]);
(%o2)                           z
</pre></div></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Lists">Lists</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Expressions">Expressions</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="length"></a><a class="anchor" id="Item_003a-Lists_002fdeffn_002flength"></a><dl class="first-deffn">
<dt class="deffn" id="index-length"><span class="category-def">Function: </span><span><strong class="def-name">length</strong> <var class="def-var-arguments">(<var class="var">expr</var>)</var><a class="copiable-link" href='#index-length'> &para;</a></span></dt>
<dd>
<p>Returns (by default) the number of parts in the external
(displayed) form of <var class="var">expr</var>.  For lists this is the number of elements,
for matrices it is the number of rows, and for sums it is the number
of terms (see <code class="code"><a class="ref" href="maxima_5.html#dispform">dispform</a></code>).
</p>
<p>The <code class="code">length</code> command is affected by the <code class="code"><a class="ref" href="maxima_5.html#inflag">inflag</a></code> switch.  So, e.g.
<code class="code">length(a/(b*c));</code> gives 2 if <code class="code">inflag</code> is <code class="code">false</code> (Assuming
<code class="code"><a class="ref" href="maxima_3.html#exptdispflag">exptdispflag</a></code> is <code class="code">true</code>), but 3 if <code class="code">inflag</code> is <code class="code">true</code> (the
internal representation is essentially <code class="code">a*b^-1*c^-1</code>).
</p>
<p>Determining a list&rsquo;s length typically needs an amount of time proportional
to the number of elements in the list. If the length of a list is used inside
a loop it therefore might drastically increase the performance if the length
is calculated outside the loop instead.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Lists">Lists</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Expressions">Expressions</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="listarith"></a><a class="anchor" id="Item_003a-Lists_002fdefvr_002flistarith"></a><dl class="first-defvr">
<dt class="defvr" id="index-listarith"><span class="category-def">Option variable: </span><span><strong class="def-name">listarith</strong><a class="copiable-link" href='#index-listarith'> &para;</a></span></dt>
<dd><p>Default value: <code class="code">true</code> 
</p>
<p>If <code class="code">false</code> causes any arithmetic operations with lists to be suppressed;
when <code class="code">true</code>, list-matrix operations are contagious causing lists to be
converted to matrices yielding a result which is always a matrix.  However,
list-list operations should return lists.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Lists">Lists</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Global-flags">Global flags</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="Item_003a-Lists_002fdeffn_002flistp"></a><dl class="first-deffn">
<dt class="deffn" id="index-listp"><span class="category-def">Function: </span><span><strong class="def-name">listp</strong> <var class="def-var-arguments">(<var class="var">expr</var>)</var><a class="copiable-link" href='#index-listp'> &para;</a></span></dt>
<dd>
<p>Returns <code class="code">true</code> if <var class="var">expr</var> is a list else <code class="code">false</code>.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Lists">Lists</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Predicate-functions">Predicate functions</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="lreduce"></a><a class="anchor" id="Item_003a-Lists_002fdeffn_002flreduce"></a><dl class="first-deffn">
<dt class="deffn" id="index-lreduce"><span class="category-def">Function: </span><span><strong class="def-name">lreduce</strong> <var class="def-var-arguments"><br>&nbsp;&nbsp;&nbsp;&nbsp;<code class="t">lreduce</code> (<var class="var">F</var>, <var class="var">s</var>) <br>&nbsp;&nbsp;&nbsp;&nbsp;<code class="t">lreduce</code> (<var class="var">F</var>, <var class="var">s</var>, <var class="var">s_0</var>)</var><a class="copiable-link" href='#index-lreduce'> &para;</a></span></dt>
<dd>
<p>Extends the binary function <var class="var">F</var> to an n-ary function by composition,
where <var class="var">s</var> is a list.
</p>
<p><code class="code">lreduce(<var class="var">F</var>, <var class="var">s</var>)</code> returns <code class="code">F(... F(F(s_1, s_2), s_3), ... s_n)</code>.
When the optional argument <var class="var">s_0</var> is present,
the result is equivalent to <code class="code">lreduce(<var class="var">F</var>, cons(<var class="var">s_0</var>, <var class="var">s</var>))</code>.
</p>
<p>The function <var class="var">F</var> is first applied to the
<i class="i">leftmost</i> list elements, thus the name &quot;lreduce&quot;.
</p>
<p>See also <code class="code"><a class="ref" href="#rreduce">rreduce</a></code>, <code class="code"><a class="ref" href="#xreduce">xreduce</a></code>, and <code class="code"><a class="ref" href="#tree_005freduce">tree_reduce</a></code>.
</p>
<p>Examples:
</p>
<p><code class="code">lreduce</code> without the optional argument.
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) lreduce (f, [1, 2, 3]);
(%o1)                     f(f(1, 2), 3)
</pre></div><div class="group"><pre class="example-preformatted">(%i2) lreduce (f, [1, 2, 3, 4]);
(%o2)                  f(f(f(1, 2), 3), 4)
</pre></div></div>

<p><code class="code">lreduce</code> with the optional argument.
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) lreduce (f, [1, 2, 3], 4);
(%o1)                  f(f(f(4, 1), 2), 3)
</pre></div></div>

<p><code class="code">lreduce</code> applied to built-in binary operators.
<code class="code">/</code> is the division operator.
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) lreduce (&quot;^&quot;, args ({a, b, c, d}));
                               b c d
(%o1)                       ((a ) )
</pre></div><div class="group"><pre class="example-preformatted">(%i2) lreduce (&quot;/&quot;, args ({a, b, c, d}));
                                a
(%o2)                         -----
                              b c d
</pre></div></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Lists">Lists</a>
&middot;
</div>

</dd></dl>

<a class="anchor" id="makelist"></a><a class="anchor" id="Item_003a-Lists_002fdeffn_002fmakelist"></a><dl class="first-deffn">
<dt class="deffn" id="index-makelist"><span class="category-def">Function: </span><span><strong class="def-name">makelist</strong> <var class="def-var-arguments"><br>&nbsp;&nbsp;&nbsp;&nbsp;<code class="t">makelist</code> () <br>&nbsp;&nbsp;&nbsp;&nbsp;<code class="t">makelist</code> (<var class="var">expr</var>, <var class="var">n</var>) <br>&nbsp;&nbsp;&nbsp;&nbsp;<code class="t">makelist</code> (<var class="var">expr</var>, <var class="var">i</var>, <var class="var">i_max</var>) <br>&nbsp;&nbsp;&nbsp;&nbsp;<code class="t">makelist</code> (<var class="var">expr</var>, <var class="var">i</var>, <var class="var">i_0</var>, <var class="var">i_max</var>) <br>&nbsp;&nbsp;&nbsp;&nbsp;<code class="t">makelist</code> (<var class="var">expr</var>, <var class="var">i</var>, <var class="var">i_0</var>, <var class="var">i_max</var>, <var class="var">step</var>) <br>&nbsp;&nbsp;&nbsp;&nbsp;<code class="t">makelist</code> (<var class="var">expr</var>, <var class="var">x</var>, <var class="var">list</var>)</var><a class="copiable-link" href='#index-makelist'> &para;</a></span></dt>
<dd>
<p>The first form, <code class="code">makelist ()</code>, creates an empty list. The second form,
<code class="code">makelist (<var class="var">expr</var>)</code>, creates a list with <var class="var">expr</var> as its single
element. <code class="code">makelist (<var class="var">expr</var>, <var class="var">n</var>)</code> creates a list of <var class="var">n</var>
elements generated from <var class="var">expr</var>.
</p>
<p>The most general form, <code class="code">makelist (<var class="var">expr</var>, <var class="var">i</var>, <var class="var">i_0</var>,
<var class="var">i_max</var>, <var class="var">step</var>)</code>, returns the list of elements obtained when
<code class="code">ev (<var class="var">expr</var>, <var class="var">i</var>=<var class="var">j</var>)</code> is applied to the elements
<var class="var">j</var> of the sequence: <var class="var">i_0</var>, <var class="var">i_0</var> + <var class="var">step</var>, <var class="var">i_0</var> +
2*<var class="var">step</var>, ..., with <var class="var">|j|</var> less than or equal to <var class="var">|i_max|</var>.
</p>
<p>The increment <var class="var">step</var> can be a number (positive or negative) or an
expression. If it is omitted, the default value 1 will be used. If both
<var class="var">i_0</var> and <var class="var">step</var> are omitted, they will both have a default
value of 1.
</p>
<p><code class="code">makelist (<var class="var">expr</var>, <var class="var">x</var>, <var class="var">list</var>)</code> returns a list, the
<code class="code">j</code>th element of which is equal to
<code class="code">ev (<var class="var">expr</var>, <var class="var">x</var>=<var class="var">list</var>[j])</code> for <code class="code">j</code> equal to 1 through
<code class="code">length (<var class="var">list</var>)</code>.
</p>
<p>Examples:
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) makelist (concat (x,i), i, 6);
(%o1)               [x1, x2, x3, x4, x5, x6]
</pre></div><div class="group"><pre class="example-preformatted">(%i2) makelist (x=y, y, [a, b, c]);
(%o2)                 [x = a, x = b, x = c]
</pre></div><div class="group"><pre class="example-preformatted">(%i3) makelist (x^2, x, 3, 2*%pi, 2);
(%o3)                        [9, 25]
</pre></div><div class="group"><pre class="example-preformatted">(%i4) makelist (random(6), 4);
(%o4)                     [2, 0, 2, 5]
</pre></div><div class="group"><pre class="example-preformatted">(%i5) flatten (makelist (makelist (i^2, 3), i, 4));
(%o5)        [1, 1, 1, 4, 4, 4, 9, 9, 9, 16, 16, 16]
</pre></div><div class="group"><pre class="example-preformatted">(%i6) flatten (makelist (makelist (i^2, i, 3), 4));
(%o6)         [1, 4, 9, 1, 4, 9, 1, 4, 9, 1, 4, 9]
</pre></div></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Lists">Lists</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="member"></a><a class="anchor" id="Item_003a-Lists_002fdeffn_002fmember"></a><dl class="first-deffn">
<dt class="deffn" id="index-member"><span class="category-def">Function: </span><span><strong class="def-name">member</strong> <var class="def-var-arguments">(<var class="var">expr_1</var>, <var class="var">expr_2</var>)</var><a class="copiable-link" href='#index-member'> &para;</a></span></dt>
<dd>
<p>Returns <code class="code">true</code> if <code class="code">is(<var class="var">expr_1</var> = <var class="var">a</var>)</code>
for some element <var class="var">a</var> in <code class="code">args(<var class="var">expr_2</var>)</code>,
otherwise returns <code class="code">false</code>.
</p>
<p><code class="code">expr_2</code> is typically a list, in which case
<code class="code">args(<var class="var">expr_2</var>) = <var class="var">expr_2</var></code> and <code class="code">is(<var class="var">expr_1</var> = <var class="var">a</var>)</code>
for some element <var class="var">a</var> in <code class="code">expr_2</code> is the test.
</p>
<p><code class="code">member</code> does not inspect parts of the arguments of <code class="code">expr_2</code>, so it
may return <code class="code">false</code> even if <code class="code">expr_1</code> is a part of some argument of
<code class="code">expr_2</code>.
</p>
<p>See also <code class="code"><a class="ref" href="maxima_34.html#elementp">elementp</a></code>.
</p>
<p>Examples:
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) member (8, [8, 8.0, 8b0]);
(%o1)                         true
</pre></div><div class="group"><pre class="example-preformatted">(%i2) member (8, [8.0, 8b0]);
(%o2)                         false
</pre></div><div class="group"><pre class="example-preformatted">(%i3) member (b, [a, b, c]);
(%o3)                         true
</pre></div><div class="group"><pre class="example-preformatted">(%i4) member (b, [[a, b], [b, c]]);
(%o4)                         false
</pre></div><div class="group"><pre class="example-preformatted">(%i5) member ([b, c], [[a, b], [b, c]]);
(%o5)                         true
</pre></div><div class="group"><pre class="example-preformatted">(%i6) F (1, 1/2, 1/4, 1/8);
                               1  1  1
(%o6)                     F(1, -, -, -)
                               2  4  8
</pre></div><div class="group"><pre class="example-preformatted">(%i7) member (1/8, %);
(%o7)                         true
</pre></div><div class="group"><pre class="example-preformatted">(%i8) member (&quot;ab&quot;, [&quot;aa&quot;, &quot;ab&quot;, sin(1), a + b]);
(%o8)                         true
</pre></div></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Lists">Lists</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Expressions">Expressions</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Predicate-functions">Predicate functions</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="ninth"></a><a class="anchor" id="Item_003a-Lists_002fdeffn_002fninth"></a><dl class="first-deffn">
<dt class="deffn" id="index-ninth"><span class="category-def">Function: </span><span><strong class="def-name">ninth</strong> <var class="def-var-arguments">(<var class="var">expr</var>)</var><a class="copiable-link" href='#index-ninth'> &para;</a></span></dt>
<dd>
<p>Returns the 9th item of expression or list <var class="var">expr</var>.
See <code class="code"><a class="ref" href="#first">first</a></code> for more details.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Lists">Lists</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Expressions">Expressions</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="pop"></a><a class="anchor" id="Item_003a-Lists_002fdeffn_002fpop"></a><dl class="first-deffn">
<dt class="deffn" id="index-pop"><span class="category-def">Function: </span><span><strong class="def-name">pop</strong> <var class="def-var-arguments">(<var class="var">list</var>)</var><a class="copiable-link" href='#index-pop'> &para;</a></span></dt>
<dd>
<p><code class="code">pop</code> removes and returns the first element from the list <var class="var">list</var>. The argument
<var class="var">list</var> must be a mapatom that is bound to a nonempty list. If the argument <var class="var">list</var> is 
not bound to a nonempty list, Maxima signals an error. For examples, see <code class="code"><a class="ref" href="#push">push</a></code>.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Lists">Lists</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Expressions">Expressions</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="push"></a><a class="anchor" id="Item_003a-Lists_002fdeffn_002fpush"></a><dl class="first-deffn">
<dt class="deffn" id="index-push"><span class="category-def">Function: </span><span><strong class="def-name">push</strong> <var class="def-var-arguments">(<var class="var">item</var>, <var class="var">list</var>)</var><a class="copiable-link" href='#index-push'> &para;</a></span></dt>
<dd>
<p><code class="code">push</code> prepends the item <var class="var">item</var> to the list <var class="var">list</var> and returns a copy of the new list. 
The second argument <var class="var">list</var> must be a mapatom that is bound to a list. The first argument <var class="var">item</var> 
can be any Maxima symbol or expression. If the argument <var class="var">list</var> is not bound to a list, Maxima 
signals an error.
</p>

<p>To remove the first item from a list, see <code class="code"><a class="ref" href="#pop">pop</a></code>.
</p>

<p>Examples:
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) ll: [];
(%o1)                          []
</pre></div><div class="group"><pre class="example-preformatted">(%i2) push (x, ll);
(%o2)                          [x]
</pre></div><div class="group"><pre class="example-preformatted">(%i3) push (x^2+y, ll);
                                 2
(%o3)                      [y + x , x]
</pre></div><div class="group"><pre class="example-preformatted">(%i4) a: push (&quot;string&quot;, ll);
                                     2
(%o4)                  [string, y + x , x]
</pre></div><div class="group"><pre class="example-preformatted">(%i5) pop (ll);
(%o5)                        string
</pre></div><div class="group"><pre class="example-preformatted">(%i6) pop (ll);
                                  2
(%o6)                        y + x
</pre></div><div class="group"><pre class="example-preformatted">(%i7) pop (ll);
(%o7)                           x
</pre></div><div class="group"><pre class="example-preformatted">(%i8) ll;
(%o8)                          []
</pre></div><div class="group"><pre class="example-preformatted">(%i9) a;
                                     2
(%o9)                  [string, y + x , x]
</pre></div></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Lists">Lists</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Expressions">Expressions</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="rest"></a><a class="anchor" id="Item_003a-Lists_002fdeffn_002frest"></a><dl class="first-deffn">
<dt class="deffn" id="index-rest"><span class="category-def">Function: </span><span><strong class="def-name">rest</strong> <var class="def-var-arguments"><br>&nbsp;&nbsp;&nbsp;&nbsp;<code class="t">rest</code> (<var class="var">expr</var>, <var class="var">n</var>) <br>&nbsp;&nbsp;&nbsp;&nbsp;<code class="t">rest</code> (<var class="var">expr</var>)</var><a class="copiable-link" href='#index-rest'> &para;</a></span></dt>
<dd>
<p>Returns <var class="var">expr</var> with its first <var class="var">n</var> elements removed if <var class="var">n</var>
is positive and its last <code class="code">- <var class="var">n</var></code> elements removed if <var class="var">n</var>
is negative. If <var class="var">n</var> is 1 it may be omitted. The first argument
<var class="var">expr</var> may be a list, matrix, or other expression. When <var class="var">expr</var>
is an atom, <code class="code">rest</code> signals an error; when <var class="var">expr</var> is an empty
list and <code class="code">partswitch</code> is false, <code class="code">rest</code> signals an error. When 
<var class="var">expr</var> is an empty list and <code class="code">partswitch</code> is true, <code class="code">rest</code> 
returns <code class="code">end</code>.
</p>
<p>Applying <code class="code">rest</code> to expression such as <code class="code">f(a,b,c)</code> returns
<code class="code">f(b,c)</code>. In general, applying <code class="code">rest</code> to a nonlist doesn&rsquo;t
make sense. For example, because &rsquo;^&rsquo; requires two arguments,
<code class="code">rest(a^b)</code> results in an error message. The functions
<code class="code">args</code> and <code class="code">op</code> may be useful as well, since <code class="code">args(a^b)</code>
returns <code class="code">[a,b]</code> and <code class="code">op(a^b)</code> returns ^.
</p>
<p>See also <code class="code"><a class="ref" href="#firstn">firstn</a></code> and <code class="code"><a class="ref" href="#lastn">lastn</a></code>.
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) rest(a+b+c);
(%o1) b+a
(%i2) rest(a+b+c,2);
(%o2) a
(%i3) rest(a+b+c,-2);
(%o3) c
</pre></div></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Lists">Lists</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Expressions">Expressions</a>
&middot;
</div>
</dd></dl>


<a class="anchor" id="reverse"></a><a class="anchor" id="Item_003a-Lists_002fdeffn_002freverse"></a><dl class="first-deffn">
<dt class="deffn" id="index-reverse"><span class="category-def">Function: </span><span><strong class="def-name">reverse</strong> <var class="def-var-arguments">(<var class="var">list</var>)</var><a class="copiable-link" href='#index-reverse'> &para;</a></span></dt>
<dd>
<p>Reverses the order of the members of the <var class="var">list</var> (not
the members themselves).  <code class="code">reverse</code> also works on general expressions,
e.g.  <code class="code">reverse(a=b);</code> gives <code class="code">b=a</code>.
</p>
<p>See also <code class="code"><a class="ref" href="maxima_90.html#sreverse">sreverse</a></code>.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Lists">Lists</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Expressions">Expressions</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="rreduce"></a><a class="anchor" id="Item_003a-Lists_002fdeffn_002frreduce"></a><dl class="first-deffn">
<dt class="deffn" id="index-rreduce"><span class="category-def">Function: </span><span><strong class="def-name">rreduce</strong> <var class="def-var-arguments"><br>&nbsp;&nbsp;&nbsp;&nbsp;<code class="t">rreduce</code> (<var class="var">F</var>, <var class="var">s</var>) <br>&nbsp;&nbsp;&nbsp;&nbsp;<code class="t">rreduce</code> (<var class="var">F</var>, <var class="var">s</var>, <var class="var">s_{n + 1}</var>)</var><a class="copiable-link" href='#index-rreduce'> &para;</a></span></dt>
<dd>
<p>Extends the binary function <var class="var">F</var> to an n-ary function by composition,
where <var class="var">s</var> is a list.
</p>
<p><code class="code">rreduce(<var class="var">F</var>, <var class="var">s</var>)</code> returns <code class="code">F(s_1, ... F(s_{n - 2}, F(s_{n - 1}, s_n)))</code>.
When the optional argument <var class="var">s_{n + 1}</var> is present,
the result is equivalent to <code class="code">rreduce(<var class="var">F</var>, endcons(<var class="var">s_{n + 1}</var>, <var class="var">s</var>))</code>.
</p>
<p>The function <var class="var">F</var> is first applied to the
<i class="i">rightmost</i> list elements, thus the name &quot;rreduce&quot;.
</p>
<p>See also <code class="code"><a class="ref" href="#lreduce">lreduce</a></code>, <code class="code"><a class="ref" href="#tree_005freduce">tree_reduce</a></code>, and <code class="code"><a class="ref" href="#xreduce">xreduce</a></code>.
</p>
<p>Examples:
</p>
<p><code class="code">rreduce</code> without the optional argument.
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) rreduce (f, [1, 2, 3]);
(%o1)                     f(1, f(2, 3))
</pre></div><div class="group"><pre class="example-preformatted">(%i2) rreduce (f, [1, 2, 3, 4]);
(%o2)                  f(1, f(2, f(3, 4)))
</pre></div></div>

<p><code class="code">rreduce</code> with the optional argument.
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) rreduce (f, [1, 2, 3], 4);
(%o1)                  f(1, f(2, f(3, 4)))
</pre></div></div>

<p><code class="code">rreduce</code> applied to built-in binary operators.
<code class="code">/</code> is the division operator.
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) rreduce (&quot;^&quot;, args ({a, b, c, d}));
                                 d
                                c
                               b
(%o1)                         a
</pre></div><div class="group"><pre class="example-preformatted">(%i2) rreduce (&quot;/&quot;, args ({a, b, c, d}));
                               a c
(%o2)                          ---
                               b d
</pre></div></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Lists">Lists</a>
&middot;
</div>

</dd></dl>

<a class="anchor" id="second"></a><a class="anchor" id="Item_003a-Lists_002fdeffn_002fsecond"></a><dl class="first-deffn">
<dt class="deffn" id="index-second"><span class="category-def">Function: </span><span><strong class="def-name">second</strong> <var class="def-var-arguments">(<var class="var">expr</var>)</var><a class="copiable-link" href='#index-second'> &para;</a></span></dt>
<dd>
<p>Returns the 2nd item of expression or list <var class="var">expr</var>.
See <code class="code"><a class="ref" href="#first">first</a></code> for more details.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Lists">Lists</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Expressions">Expressions</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="seventh"></a><a class="anchor" id="Item_003a-Lists_002fdeffn_002fseventh"></a><dl class="first-deffn">
<dt class="deffn" id="index-seventh"><span class="category-def">Function: </span><span><strong class="def-name">seventh</strong> <var class="def-var-arguments">(<var class="var">expr</var>)</var><a class="copiable-link" href='#index-seventh'> &para;</a></span></dt>
<dd>
<p>Returns the 7th item of expression or list <var class="var">expr</var>.
See <code class="code"><a class="ref" href="#first">first</a></code> for more details.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Lists">Lists</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Expressions">Expressions</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="sixth"></a><a class="anchor" id="Item_003a-Lists_002fdeffn_002fsixth"></a><dl class="first-deffn">
<dt class="deffn" id="index-sixth"><span class="category-def">Function: </span><span><strong class="def-name">sixth</strong> <var class="def-var-arguments">(<var class="var">expr</var>)</var><a class="copiable-link" href='#index-sixth'> &para;</a></span></dt>
<dd>
<p>Returns the 6th item of expression or list <var class="var">expr</var>.
See <code class="code"><a class="ref" href="#first">first</a></code> for more details.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Lists">Lists</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Expressions">Expressions</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="sort"></a><a class="anchor" id="Item_003a-Lists_002fdeffn_002fsort"></a><dl class="first-deffn">
<dt class="deffn" id="index-sort"><span class="category-def">Function: </span><span><strong class="def-name">sort</strong> <var class="def-var-arguments"><br>&nbsp;&nbsp;&nbsp;&nbsp;<code class="t">sort</code> (<var class="var">L</var>, <var class="var">P</var>) <br>&nbsp;&nbsp;&nbsp;&nbsp;<code class="t">sort</code> (<var class="var">L</var>)</var><a class="copiable-link" href='#index-sort'> &para;</a></span></dt>
<dd>
<p><code class="code">sort(<var class="var">L</var>, <var class="var">P</var>)</code> sorts a list <var class="var">L</var> according to a predicate <code class="code">P</code> of two arguments
which defines a strict weak order on the elements of <var class="var">L</var>.
If <code class="code"><var class="var">P</var>(a, b)</code> is <code class="code">true</code>, then <code class="code">a</code> appears before <code class="code">b</code> in the result.
If neither <code class="code"><var class="var">P</var>(a, b)</code> nor <code class="code"><var class="var">P</var>(b, a)</code> are <code class="code">true</code>,
then <code class="code">a</code> and <code class="code">b</code> are equivalent, and appear in the result in the same order as in the input.
That is, <code class="code">sort</code> is a stable sort.
</p>
<p>If <code class="code"><var class="var">P</var>(a, b)</code> and <code class="code"><var class="var">P</var>(b, a)</code> are both <code class="code">true</code> for some elements of <var class="var">L</var>,
then <var class="var">P</var> is not a valid sort predicate, and the result is undefined.
If <code class="code"><var class="var">P</var>(a, b)</code> is something other than <code class="code">true</code> or <code class="code">false</code>, <code class="code">sort</code> signals an error.
</p>
<p>The predicate may be specified as the name of a function 
or binary infix operator, or as a <code class="code">lambda</code> expression.  If specified as
the name of an operator, the name must be enclosed in double quotes.
</p>
<p>The sorted list is returned as a new object; the argument <var class="var">L</var> is not modified.
</p>
<p><code class="code">sort(<var class="var">L</var>)</code> is equivalent to <code class="code">sort(<var class="var">L</var>, orderlessp)</code>.
</p>
<p>The default sorting order is ascending, as determined by <code class="code"><a class="ref" href="maxima_5.html#orderlessp">orderlessp</a></code>. The predicate <code class="code">ordergreatp</code> sorts a list in descending order.
</p>
<p>All Maxima atoms and expressions are comparable under <code class="code">orderlessp</code> and <code class="code">ordergreatp</code>.
</p>
<p>Operators <code class="code">&lt;</code> and <code class="code">&gt;</code> order numbers, constants, and constant expressions by magnitude.
Note that <code class="code">orderlessp</code> and <code class="code">ordergreatp</code> do not order numbers, constants, and constant expressions by magnitude.
</p>
<p><code class="code">ordermagnitudep</code> orders numbers, constants, and constant expressions the same as <code class="code">&lt;</code>,
and all other elements the same as <code class="code">orderlessp</code>.
</p>
<p>Examples:
</p>
<p><code class="code">sort</code> sorts a list according to a predicate of two arguments
which defines a strict weak order on the elements of the list.
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) sort ([1, a, b, 2, 3, c], 'orderlessp);
(%o1)                  [1, 2, 3, a, b, c]
</pre></div><div class="group"><pre class="example-preformatted">(%i2) sort ([1, a, b, 2, 3, c], 'ordergreatp);
(%o2)                  [c, b, a, 3, 2, 1]
</pre></div></div>

<p>The predicate may be specified as the name of a function 
or binary infix operator, or as a <code class="code">lambda</code> expression.  If specified as
the name of an operator, the name must be enclosed in double quotes.
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) L : [[1, x], [3, y], [4, w], [2, z]];
(%o1)           [[1, x], [3, y], [4, w], [2, z]]
</pre></div><div class="group"><pre class="example-preformatted">(%i2) foo (a, b) := a[1] &gt; b[1];
(%o2)                 foo(a, b) := a  &gt; b
                                    1    1
</pre></div><div class="group"><pre class="example-preformatted">(%i3) sort (L, 'foo);
(%o3)           [[4, w], [3, y], [2, z], [1, x]]
</pre></div><div class="group"><pre class="example-preformatted">(%i4) infix (&quot;&gt;&gt;&quot;);
(%o4)                          &gt;&gt;
</pre></div><div class="group"><pre class="example-preformatted">(%i5) a &gt;&gt; b := a[1] &gt; b[1];
(%o5)                  (a &gt;&gt; b) := a  &gt; b
                                    1    1
</pre></div><div class="group"><pre class="example-preformatted">(%i6) sort (L, &quot;&gt;&gt;&quot;);
(%o6)           [[4, w], [3, y], [2, z], [1, x]]
</pre></div><div class="group"><pre class="example-preformatted">(%i7) sort (L, lambda ([a, b], a[1] &gt; b[1]));
(%o7)           [[4, w], [3, y], [2, z], [1, x]]
</pre></div></div>

<p><code class="code">sort(<var class="var">L</var>)</code> is equivalent to <code class="code">sort(<var class="var">L</var>, orderlessp)</code>.
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) L : [a, 2*b, -5, 7, 1 + %e, %pi];
(%o1)             [a, 2 b, - 5, 7, %e + 1, %pi]
</pre></div><div class="group"><pre class="example-preformatted">(%i2) sort (L);
(%o2)             [- 5, 7, %e + 1, %pi, a, 2 b]
</pre></div><div class="group"><pre class="example-preformatted">(%i3) sort (L, 'orderlessp);
(%o3)             [- 5, 7, %e + 1, %pi, a, 2 b]
</pre></div></div>

<p>The default sorting order is ascending, as determined by <code class="code"><a class="ref" href="maxima_5.html#orderlessp">orderlessp</a></code>. The predicate <code class="code">ordergreatp</code> sorts a list in descending order.
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) L : [a, 2*b, -5, 7, 1 + %e, %pi];
(%o1)             [a, 2 b, - 5, 7, %e + 1, %pi]
</pre></div><div class="group"><pre class="example-preformatted">(%i2) sort (L);
(%o2)             [- 5, 7, %e + 1, %pi, a, 2 b]
</pre></div><div class="group"><pre class="example-preformatted">(%i3) sort (L, 'ordergreatp);
(%o3)             [2 b, a, %pi, %e + 1, 7, - 5]
</pre></div></div>

<p>All Maxima atoms and expressions are comparable under <code class="code">orderlessp</code> and <code class="code">ordergreatp</code>.
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) L : [11, -17, 29b0, 9*c, 7.55, foo(x, y), -5/2, b + a];
                                                 5
(%o1)  [11, - 17, 2.9b1, 9 c, 7.55, foo(x, y), - -, b + a]
                                                 2
</pre></div><div class="group"><pre class="example-preformatted">(%i2) sort (L, orderlessp);
                5
(%o2)  [- 17, - -, 7.55, 11, 2.9b1, b + a, 9 c, foo(x, y)]
                2
</pre></div><div class="group"><pre class="example-preformatted">(%i3) sort (L, ordergreatp);
                                                  5
(%o3)  [foo(x, y), 9 c, b + a, 2.9b1, 11, 7.55, - -, - 17]
                                                  2
</pre></div></div>

<p>Operators <code class="code">&lt;</code> and <code class="code">&gt;</code> order numbers, constants, and constant expressions by magnitude.
Note that <code class="code">orderlessp</code> and <code class="code">ordergreatp</code> do not order numbers, constants, and constant expressions by magnitude.
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) L : [%pi, 3, 4, %e, %gamma];
(%o1)                [%pi, 3, 4, %e, %gamma]
</pre></div><div class="group"><pre class="example-preformatted">(%i2) sort (L, &quot;&gt;&quot;);
(%o2)                [4, %pi, 3, %e, %gamma]
</pre></div><div class="group"><pre class="example-preformatted">(%i3) sort (L, ordergreatp);
(%o3)                [%pi, %gamma, %e, 4, 3]
</pre></div></div>

<p><code class="code">ordermagnitudep</code> orders numbers, constants, and constant expressions the same as <code class="code">&lt;</code>,
and all other elements the same as <code class="code">orderlessp</code>.
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) L: [%i, 1+%i, 2*x, minf, inf, %e, sin(1), 0,1,2,3, 1.0, 1.0b0];
(%o1) [%i, %i + 1, 2 x, minf, inf, %e, sin(1), 0, 1, 2, 3, 1.0, 
                                                           1.0b0]
</pre></div><div class="group"><pre class="example-preformatted">(%i2) sort (L, ordermagnitudep);
(%o2) [minf, 0, sin(1), 1, 1.0, 1.0b0, 2, %e, 3, inf, %i, 
                                                     %i + 1, 2 x]
</pre></div><div class="group"><pre class="example-preformatted">(%i3) sort (L, orderlessp);
(%o3) [0, 1, 1.0, 2, 3, sin(1), 1.0b0, %e, %i, %i + 1, inf, 
                                                       minf, 2 x]
</pre></div></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Lists">Lists</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="sublist"></a><a class="anchor" id="Item_003a-Lists_002fdeffn_002fsublist"></a><dl class="first-deffn">
<dt class="deffn" id="index-sublist"><span class="category-def">Function: </span><span><strong class="def-name">sublist</strong> <var class="def-var-arguments">(<var class="var">list</var>, <var class="var">p</var>)</var><a class="copiable-link" href='#index-sublist'> &para;</a></span></dt>
<dd>
<p>Returns the list of elements of <var class="var">list</var> for which the predicate <code class="code">p</code>
returns <code class="code">true</code>.
</p>
<p>Example:
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) L: [1, 2, 3, 4, 5, 6];
(%o1)                  [1, 2, 3, 4, 5, 6]
</pre></div><div class="group"><pre class="example-preformatted">(%i2) sublist (L, evenp);
(%o2)                       [2, 4, 6]
</pre></div></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Lists">Lists</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="sublist_005findices"></a><a class="anchor" id="Item_003a-Lists_002fdeffn_002fsublist_005findices"></a><dl class="first-deffn">
<dt class="deffn" id="index-sublist_005findices"><span class="category-def">Function: </span><span><strong class="def-name">sublist_indices</strong> <var class="def-var-arguments">(<var class="var">L</var>, <var class="var">P</var>)</var><a class="copiable-link" href='#index-sublist_005findices'> &para;</a></span></dt>
<dd>
<p>Returns the indices of the elements <code class="code">x</code> of the list <var class="var">L</var> for which
the predicate <code class="code">maybe(<var class="var">P</var>(x))</code> returns <code class="code">true</code>;
this excludes <code class="code">unknown</code> as well as <code class="code">false</code>.
<var class="var">P</var> may be the name of a function or a lambda expression.
<var class="var">L</var> must be a literal list.
</p>
<p>Examples:
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) sublist_indices ('[a, b, b, c, 1, 2, b, 3, b],
                       lambda ([x], x='b));
(%o1)                     [2, 3, 7, 9]
</pre></div><div class="group"><pre class="example-preformatted">(%i2) sublist_indices ('[a, b, b, c, 1, 2, b, 3, b], symbolp);
(%o2)                  [1, 2, 3, 4, 7, 9]
</pre></div><div class="group"><pre class="example-preformatted">(%i3) sublist_indices ([1 &gt; 0, 1 &lt; 0, 2 &lt; 1, 2 &gt; 1, 2 &gt; 0],
                       identity);
(%o3)                       [1, 4, 5]
</pre></div><div class="group"><pre class="example-preformatted">(%i4) assume (x &lt; -1);
(%o4)                       [x &lt; - 1]
</pre></div><div class="group"><pre class="example-preformatted">(%i5) map (maybe, [x &gt; 0, x &lt; 0, x &lt; -2]);
(%o5)                [false, true, unknown]
</pre></div><div class="group"><pre class="example-preformatted">(%i6) sublist_indices ([x &gt; 0, x &lt; 0, x &lt; -2], identity);
(%o6)                          [2]
</pre></div></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Lists">Lists</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="tenth"></a><a class="anchor" id="Item_003a-Lists_002fdeffn_002ftenth"></a><dl class="first-deffn">
<dt class="deffn" id="index-tenth"><span class="category-def">Function: </span><span><strong class="def-name">tenth</strong> <var class="def-var-arguments">(<var class="var">expr</var>)</var><a class="copiable-link" href='#index-tenth'> &para;</a></span></dt>
<dd>
<p>Returns the 10th item of expression or list <var class="var">expr</var>.
See <code class="code"><a class="ref" href="#first">first</a></code> for more details.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Lists">Lists</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Expressions">Expressions</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="third"></a><a class="anchor" id="Item_003a-Lists_002fdeffn_002fthird"></a><dl class="first-deffn">
<dt class="deffn" id="index-third"><span class="category-def">Function: </span><span><strong class="def-name">third</strong> <var class="def-var-arguments">(<var class="var">expr</var>)</var><a class="copiable-link" href='#index-third'> &para;</a></span></dt>
<dd>
<p>Returns the 3rd item of expression or list <var class="var">expr</var>.
See <code class="code"><a class="ref" href="#first">first</a></code> for more details.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Lists">Lists</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Expressions">Expressions</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="tree_005freduce"></a><a class="anchor" id="Item_003a-Lists_002fdeffn_002ftree_005freduce"></a><dl class="first-deffn">
<dt class="deffn" id="index-tree_005freduce"><span class="category-def">Function: </span><span><strong class="def-name">tree_reduce</strong> <var class="def-var-arguments"><br>&nbsp;&nbsp;&nbsp;&nbsp;<code class="t">tree_reduce</code> (<var class="var">F</var>, <var class="var">s</var>) <br>&nbsp;&nbsp;&nbsp;&nbsp;<code class="t">tree_reduce</code> (<var class="var">F</var>, <var class="var">s</var>, <var class="var">s_0</var>)</var><a class="copiable-link" href='#index-tree_005freduce'> &para;</a></span></dt>
<dd>
<p>Extends the binary function <var class="var">F</var> to an n-ary function by composition,
where <var class="var">s</var> is a set or list.
</p>
<p><code class="code">tree_reduce</code> is equivalent to the following:
Apply <var class="var">F</var> to successive pairs of elements
to form a new list <code class="code">[<var class="var">F</var>(<var class="var">s_1</var>, <var class="var">s_2</var>), <var class="var">F</var>(<var class="var">s_3</var>, <var class="var">s_4</var>), ...]</code>,
carrying the final element unchanged if there are an odd number of elements.
Then repeat until the list is reduced to a single element, which is the return value.
</p>
<p>When the optional argument <var class="var">s_0</var> is present,
the result is equivalent <code class="code">tree_reduce(<var class="var">F</var>, cons(<var class="var">s_0</var>, <var class="var">s</var>))</code>.
</p>
<p>For addition of floating point numbers,
<code class="code">tree_reduce</code> may return a sum that has a smaller rounding error
than either <code class="code">rreduce</code> or <code class="code">lreduce</code>.
</p>
<p>The elements of <var class="var">s</var> and the partial results may be arranged in a minimum-depth binary tree,
thus the name &quot;tree_reduce&quot;.
</p>
<p>Examples:
</p>
<p><code class="code">tree_reduce</code> applied to a list with an even number of elements.
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) tree_reduce (f, [a, b, c, d]);
(%o1)                  f(f(a, b), f(c, d))
</pre></div></div>

<p><code class="code">tree_reduce</code> applied to a list with an odd number of elements.
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) tree_reduce (f, [a, b, c, d, e]);
(%o1)               f(f(f(a, b), f(c, d)), e)
</pre></div></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Sets">Sets</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Lists">Lists</a>
&middot;
</div>

</dd></dl>

<a class="anchor" id="unique"></a><a class="anchor" id="Item_003a-Lists_002fdeffn_002funique"></a><dl class="first-deffn">
<dt class="deffn" id="index-unique"><span class="category-def">Function: </span><span><strong class="def-name">unique</strong> <var class="def-var-arguments">(<var class="var">L</var>)</var><a class="copiable-link" href='#index-unique'> &para;</a></span></dt>
<dd>
<p>Returns the unique elements of the list <var class="var">L</var>.
</p>
<p>When all the elements of <var class="var">L</var> are unique,
<code class="code">unique</code> returns a shallow copy of <var class="var">L</var>,
not <var class="var">L</var> itself.
</p>
<p>If <var class="var">L</var> is not a list, <code class="code">unique</code> returns <var class="var">L</var>.
</p>
<p>Example:
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) unique ([1, %pi, a + b, 2, 1, %e, %pi, a + b, [1]]);
(%o1)              [1, 2, %e, %pi, [1], b + a]
</pre></div></div>
</dd></dl>

<a class="anchor" id="xreduce"></a><a class="anchor" id="Item_003a-Lists_002fdeffn_002fxreduce"></a><dl class="first-deffn">
<dt class="deffn" id="index-xreduce"><span class="category-def">Function: </span><span><strong class="def-name">xreduce</strong> <var class="def-var-arguments"><br>&nbsp;&nbsp;&nbsp;&nbsp;<code class="t">xreduce</code> (<var class="var">F</var>, <var class="var">s</var>) <br>&nbsp;&nbsp;&nbsp;&nbsp;<code class="t">xreduce</code> (<var class="var">F</var>, <var class="var">s</var>, <var class="var">s_0</var>)</var><a class="copiable-link" href='#index-xreduce'> &para;</a></span></dt>
<dd>
<p>Extends the function <var class="var">F</var> to an n-ary function by composition,
or, if <var class="var">F</var> is already n-ary, applies <var class="var">F</var> to <var class="var">s</var>.
When <var class="var">F</var> is not n-ary, <code class="code">xreduce</code> is the same as <code class="code">lreduce</code>.
The argument <var class="var">s</var> is a list.
</p>
<p>Functions known to be n-ary include
addition <code class="code">+</code>, multiplication <code class="code">*</code>, <code class="code">and</code>, <code class="code">or</code>, <code class="code">max</code>,
<code class="code">min</code>, and <code class="code">append</code>.
Functions may also be declared n-ary by <code class="code">declare(<var class="var">F</var>, nary)</code>.
For these functions,
<code class="code">xreduce</code> is expected to be faster than either <code class="code">rreduce</code> or <code class="code">lreduce</code>.
</p>
<p>When the optional argument <var class="var">s_0</var> is present,
the result is equivalent to <code class="code">xreduce(<var class="var">s</var>, cons(<var class="var">s_0</var>, <var class="var">s</var>))</code>.
</p>
<p>Floating point addition is not exactly associative; be that as it may,
<code class="code">xreduce</code> applies Maxima&rsquo;s n-ary addition when <var class="var">s</var> contains floating point numbers.
</p>
<p>Examples:
</p>
<p><code class="code">xreduce</code> applied to a function known to be n-ary.
<code class="code">F</code> is called once, with all arguments.
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) declare (F, nary);
(%o1)                         done
</pre></div><div class="group"><pre class="example-preformatted">(%i2) F ([L]) := L;
(%o2)                      F([L]) := L
</pre></div><div class="group"><pre class="example-preformatted">(%i3) xreduce (F, [a, b, c, d, e]);
(%o3)                    [a, b, c, d, e]
</pre></div></div>

<p><code class="code">xreduce</code> applied to a function not known to be n-ary.
<code class="code">G</code> is called several times, with two arguments each time.
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) G ([L]) := L;
(%o1)                      G([L]) := L
</pre></div><div class="group"><pre class="example-preformatted">(%i2) xreduce (G, [a, b, c, d, e]);
(%o2)                 [[[[a, b], c], d], e]
</pre></div><div class="group"><pre class="example-preformatted">(%i3) lreduce (G, [a, b, c, d, e]);
(%o3)                 [[[[a, b], c], d], e]
</pre></div></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Sets">Sets</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Lists">Lists</a>
&middot;
</div>

</dd></dl>

<a class="anchor" id="Item_003a-Lists_002fnode_002fPerformance-considerations-for-Lists"></a><hr>
</div>
<div class="subsection-level-extent" id="Performance-considerations-for-Lists">
<div class="nav-panel">
<p>
Previous: <a href="#Functions-and-Variables-for-Lists" accesskey="p" rel="prev">Functions and Variables for Lists</a>, Up: <a href="#Lists" accesskey="u" rel="up">Lists</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="Table of contents" rel="contents">Contents</a>][<a href="Function-and-Variable-Index.html" title="Index" rel="index">Index</a>]</p>
</div>
<h4 class="subsection" id="Performance-considerations-for-Lists-1">5.4.3 Performance considerations for Lists</h4>

<p>Lists provide efficient ways of appending and removing elements.
They can be created without knowing their final dimensions.
Lisp provides efficient means of copying and handling lists.
Also nested lists do not need to be strictly rectangular.
These advantages over declared arrays come with the drawback that the amount of time
needed for accessing a random element within a list may be roughly
proportional to the element&rsquo;s distance from its beginning.
Efficient traversal of lists is still possible, though, by using the list as a
stack or a fifo:
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) l:[Test,1,2,3,4];
(%o1)                  [Test, 1, 2, 3, 4]
</pre></div><pre class="example-preformatted">(%i2) while l # [] do
   disp(pop(l));
                              Test

                                1

                                2

                                3

                                4

(%o2)                         done
</pre></div>
<p>Another even faster example would be:
</p><div class="example">
<div class="group"><pre class="example-preformatted">(%i1) l:[Test,1,2,3,4];
(%o1)                  [Test, 1, 2, 3, 4]
</pre></div><pre class="example-preformatted">(%i2) for i in l do
   disp(pop(l));
                              Test

                                1

                                2

                                3

                                4

(%o2)                         done
</pre></div>

<p>Beginning traversal with the last element of a list is possible after
reversing the list using <code class="code">reverse ()</code>.
If the elements of a long list need to be processed in a different
order performance might be increased by converting the list into a
declared array first.
</p>
<p>Note also that the ending condition of <code class="code">for</code> loops
is tested for every iteration which means that the result of a
<code class="code">length</code> should be cached if it is used in the ending
condition:
</p>
<div class="example">
<pre class="example-preformatted">(%i1) l:makelist(i,i,1,100000)$
</pre><div class="group"><pre class="example-preformatted">(%i2) lngth:length(l);
(%o2)                        100000
</pre></div><div class="group"><pre class="example-preformatted">(%i3) x:1;
(%o3)                           1
</pre></div><div class="group"><pre class="example-preformatted">(%i4) for i:1 thru lngth do
    x:x+1$
</pre></div><div class="group"><pre class="example-preformatted">(%i5) x;
(%o5)                        100001
</pre></div></div>
<a class="anchor" id="Item_003a-Arrays_002fnode_002fArrays"></a><hr>
</div>
</div>
<div class="section-level-extent" id="Arrays">
<div class="nav-panel">
<p>
Next: <a href="#Structures" accesskey="n" rel="next">Structures</a>, Previous: <a href="#Lists" accesskey="p" rel="prev">Lists</a>, Up: <a href="#Data-Types-and-Structures" accesskey="u" rel="up">Data Types and Structures</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="Table of contents" rel="contents">Contents</a>][<a href="Function-and-Variable-Index.html" title="Index" rel="index">Index</a>]</p>
</div>
<h3 class="section" id="Arrays-1">5.5 Arrays</h3>

<p>Maxima supports 3 array-like constructs:
</p><ul class="itemize mark-bullet">
<li><a class="anchor" id="hashed-array"></a><a class="anchor" id="hashed-arrays"></a><a class="anchor" id="undeclared-array"></a><a class="anchor" id="undeclared-arrays"></a></li><li>If one tries to write to an indexed variable without creating a list first an
      undeclared array (also named hashed array) is created that grows dynamically and
      allows numbers, symbols and strings as indices:
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) a[&quot;feww&quot;]:1;
(%o1)                           1
</pre></div><div class="group"><pre class="example-preformatted">(%i2) a[qqwdqwd]:3;
(%o2)                           3
</pre></div><div class="group"><pre class="example-preformatted">(%i3) a[5]:99;
(%o3)                          99
</pre></div><div class="group"><pre class="example-preformatted">(%i4) a[qqwdqwd];
(%o4)                           3
</pre></div><div class="group"><pre class="example-preformatted">(%i5) a[5];
(%o5)                          99
</pre></div><div class="group"><pre class="example-preformatted">(%i6) a[&quot;feww&quot;];
(%o6)                           1
</pre></div></div>
<p>Since lisp handles hashed arrays and <code class="code"><a class="ref" href="maxima_35.html#memoizing-functions">memoizing functions</a></code> similar to arrays
many of the  functions that can be applied to arrays can be applied to them, as well.
</p></li><li>Lists (see <code class="code"><a class="ref" href="#makelist">makelist</a></code> allow for fast addition and removal
      of elements, can be created without knowing their final size.
</li><li>Declared arrays that allow fast access to random elements at the cost that their
      size needs to be known at construction time.
      (See <a class="xref" href="#Performance-considerations-for-Lists">Performance considerations for Lists</a>.)
</li></ul>


<a class="anchor" id="Item_003a-Arrays_002fnode_002fFunctions-and-Variables-for-Arrays"></a><ul class="mini-toc">
<li><a href="#Functions-and-Variables-for-Arrays" accesskey="1">Functions and Variables for Arrays</a></li>
</ul>
<hr>
<div class="subsection-level-extent" id="Functions-and-Variables-for-Arrays">
<div class="nav-panel">
<p>
Previous: <a href="#Arrays" accesskey="p" rel="prev">Arrays</a>, Up: <a href="#Arrays" accesskey="u" rel="up">Arrays</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="Table of contents" rel="contents">Contents</a>][<a href="Function-and-Variable-Index.html" title="Index" rel="index">Index</a>]</p>
</div>
<h4 class="subsection" id="Functions-and-Variables-for-Arrays-1">5.5.1 Functions and Variables for Arrays</h4>

<a class="anchor" id="array"></a><a class="anchor" id="Item_003a-Arrays_002fdeffn_002farray"></a><dl class="first-deffn">
<dt class="deffn" id="index-array"><span class="category-def">Function: </span><span><strong class="def-name">array</strong> <var class="def-var-arguments"><br>&nbsp;&nbsp;&nbsp;&nbsp;<code class="t">array</code> (<var class="var">name</var>, <var class="var">dim_1</var>, &hellip;, <var class="var">dim_n</var>) <br>&nbsp;&nbsp;&nbsp;&nbsp;<code class="t">array</code> (<var class="var">name</var>, <var class="var">type</var>, <var class="var">dim_1</var>, &hellip;, <var class="var">dim_n</var>) <br>&nbsp;&nbsp;&nbsp;&nbsp;<code class="t">array</code> ([<var class="var">name_1</var>, &hellip;, <var class="var">name_m</var>], <var class="var">dim_1</var>, &hellip;, <var class="var">dim_n</var>)</var><a class="copiable-link" href='#index-array'> &para;</a></span></dt>
<dd>
<p>Creates an <em class="math tex2jax_process">\(n\)</em>-dimensional array.  <em class="math tex2jax_process">\(n\)</em> may be less than or equal to 5.
The subscripts for the <em class="math tex2jax_process">\(i\)</em>&rsquo;th dimension are the integers running from 0 to
<var class="var">dim_i</var>.
</p>
<p><code class="code">array (<var class="var">name</var>, <var class="var">dim_1</var>, ..., <var class="var">dim_n</var>)</code> creates a general
array.
</p>
<p><code class="code">array (<var class="var">name</var>, <var class="var">type</var>, <var class="var">dim_1</var>, ..., <var class="var">dim_n</var>)</code> creates
an array, with elements of a specified type.  <var class="var">type</var> can be <code class="code">fixnum</code>
for integers of limited size or <code class="code">flonum</code> for floating-point numbers.
</p>
<p><code class="code">array ([<var class="var">name_1</var>, ..., <var class="var">name_m</var>], <var class="var">dim_1</var>, ..., <var class="var">dim_n</var>)</code>
creates <em class="math tex2jax_process">\(m\)</em> arrays, all of the same dimensions.
</p>
<p>See also <code class="code"><a class="ref" href="#arraymake">arraymake</a></code>, <code class="code"><a class="ref" href="#arrayinfo">arrayinfo</a></code> and <code class="code"><a class="ref" href="#make_005farray">make_array</a></code>.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Arrays">Arrays</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="arrayapply"></a><a class="anchor" id="Item_003a-Arrays_002fdeffn_002farrayapply"></a><dl class="first-deffn">
<dt class="deffn" id="index-arrayapply"><span class="category-def">Function: </span><span><strong class="def-name">arrayapply</strong> <var class="def-var-arguments">(<var class="var">A</var>, [<var class="var">i_1</var>, &hellip;, <var class="var">i_n</var>])</var><a class="copiable-link" href='#index-arrayapply'> &para;</a></span></dt>
<dd>
<p>Evaluates <code class="code"><var class="var">A</var> [<var class="var">i_1</var>, ..., <var class="var">i_n</var>]</code>,
where <var class="var">A</var> is an array and <var class="var">i_1</var>, &hellip;, <var class="var">i_n</var> are integers.
</p>
<p>This is reminiscent of <code class="code"><a class="ref" href="maxima_35.html#apply">apply</a></code>, except the first argument is an array
instead of a function.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Expressions">Expressions</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Arrays">Arrays</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="arrayinfo"></a><a class="anchor" id="Item_003a-Arrays_002fdeffn_002farrayinfo"></a><dl class="first-deffn">
<dt class="deffn" id="index-arrayinfo"><span class="category-def">Function: </span><span><strong class="def-name">arrayinfo</strong> <var class="def-var-arguments">(<var class="var">A</var>)</var><a class="copiable-link" href='#index-arrayinfo'> &para;</a></span></dt>
<dd>
<p>Returns information about the array <var class="var">A</var>.
The argument <var class="var">A</var> may be a declared array, a <code class="code"><a class="ref" href="#hashed-array">hashed array</a></code>,
a <code class="code"><a class="ref" href="maxima_35.html#memoizing-function">memoizing function</a></code>, or a subscripted function.
</p>
<p>For declared arrays, <code class="code">arrayinfo</code> returns a list comprising the atom
<code class="code">declared</code>, the number of dimensions, and the size of each dimension.
The elements of the array, both bound and unbound, are returned by
<code class="code"><a class="ref" href="#listarray">listarray</a></code>.
</p>
<p>For undeclared arrays (hashed arrays), <code class="code">arrayinfo</code> returns a list
comprising the atom <code class="code">hashed</code>, the number of subscripts,
and the subscripts of every element which has a value.
The values are returned by <code class="code"><a class="ref" href="#listarray">listarray</a></code>.
</p>
<p>For <code class="code"><a class="ref" href="maxima_35.html#memoizing-functions">memoizing functions</a></code>, <code class="code">arrayinfo</code> returns a list comprising the atom
<code class="code">hashed</code>, the number of subscripts,
and any subscript values for which there are stored function values.
The stored function values are returned by <code class="code"><a class="ref" href="#listarray">listarray</a></code>.
</p>
<p>For subscripted functions, <code class="code">arrayinfo</code> returns a list comprising the atom
<code class="code">hashed</code>, the number of subscripts,
and any subscript values for which there are lambda expressions.
The lambda expressions are returned by <code class="code"><a class="ref" href="#listarray">listarray</a></code>.
</p>
<p>See also <code class="code"><a class="ref" href="#listarray">listarray</a></code>.
</p>
<p>Examples:
</p>
<p><code class="code">arrayinfo</code> and <code class="code"><a class="ref" href="#listarray">listarray</a></code> applied to a declared array.
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) array (aa, 2, 3);
(%o1)                          aa
</pre></div><div class="group"><pre class="example-preformatted">(%i2) aa [2, 3] : %pi;
(%o2)                          %pi
</pre></div><div class="group"><pre class="example-preformatted">(%i3) aa [1, 2] : %e;
(%o3)                          %e
</pre></div><div class="group"><pre class="example-preformatted">(%i4) arrayinfo (aa);
(%o4)                 [declared, 2, [2, 3]]
</pre></div><div class="group"><pre class="example-preformatted">(%i5) listarray (aa);
(%o5) [#####, #####, #####, #####, #####, #####, %e, #####, 
                                        #####, #####, #####, %pi]
</pre></div></div>

<p><code class="code">arrayinfo</code> and <code class="code"><a class="ref" href="#listarray">listarray</a></code> applied to an undeclared array (<code class="code"><a class="ref" href="#hashed-array">hashed array</a></code>.).
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) bb [FOO] : (a + b)^2;
                                   2
(%o1)                       (b + a)
</pre></div><div class="group"><pre class="example-preformatted">(%i2) bb [BAR] : (c - d)^3;
                                   3
(%o2)                       (c - d)
</pre></div><div class="group"><pre class="example-preformatted">(%i3) arrayinfo (bb);
(%o3)               [hashed, 1, [BAR], [FOO]]
</pre></div><div class="group"><pre class="example-preformatted">(%i4) listarray (bb);
                              3         2
(%o4)                 [(c - d) , (b + a) ]
</pre></div></div>

<p><code class="code">arrayinfo</code> and <code class="code"><a class="ref" href="#listarray">listarray</a></code> applied to a <code class="code"><a class="ref" href="maxima_35.html#memoizing-function">memoizing function</a></code>.
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) cc [x, y] := y / x;
                                     y
(%o1)                      cc     := -
                             x, y    x
</pre></div><div class="group"><pre class="example-preformatted">(%i2) cc [u, v];
                                v
(%o2)                           -
                                u
</pre></div><div class="group"><pre class="example-preformatted">(%i3) cc [4, z];
                                z
(%o3)                           -
                                4
</pre></div><div class="group"><pre class="example-preformatted">(%i4) arrayinfo (cc);
(%o4)              [hashed, 2, [4, z], [u, v]]
</pre></div><div class="group"><pre class="example-preformatted">(%i5) listarray (cc);
                              z  v
(%o5)                        [-, -]
                              4  u
</pre></div></div>


<p>Using <code class="code">arrayinfo</code> in order to convert an undeclared array to a declared array:
</p>
<div class="example">
<pre class="example-preformatted">(%i1) for i:0 thru 10 do a[i]:i^2$
</pre><div class="group"><pre class="example-preformatted">(%i2) indices:map(first,rest(rest(arrayinfo(a))));
(%o2)          [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
</pre></div><pre class="example-preformatted">(%i3) array(A,fixnum,length(indices)-1)$
(%i4) fillarray(A,map(lambda([x],a[x]),indices))$
</pre><div class="group"><pre class="example-preformatted">(%i5) listarray(A);
(%o5)       [0, 1, 4, 9, 16, 25, 36, 49, 64, 81, 100]
</pre></div></div>

<p><code class="code">arrayinfo</code> and <code class="code"><a class="ref" href="#listarray">listarray</a></code> applied to a subscripted function.
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) dd [x] (y) := y ^ x;
                                     x
(%o1)                     dd (y) := y
                            x
</pre></div><div class="group"><pre class="example-preformatted">(%i2) dd [a + b];
                                    b + a
(%o2)                  lambda([y], y     )
</pre></div><div class="group"><pre class="example-preformatted">(%i3) dd [v - u];
                                    v - u
(%o3)                  lambda([y], y     )
</pre></div><div class="group"><pre class="example-preformatted">(%i4) arrayinfo (dd);
(%o4)             [hashed, 1, [b + a], [v - u]]
</pre></div><div class="group"><pre class="example-preformatted">(%i5) listarray (dd);
                         b + a                v - u
(%o5)      [lambda([y], y     ), lambda([y], y     )]
</pre></div></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Arrays">Arrays</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="arraymake"></a><a class="anchor" id="Item_003a-Arrays_002fdeffn_002farraymake"></a><dl class="first-deffn">
<dt class="deffn" id="index-arraymake"><span class="category-def">Function: </span><span><strong class="def-name">arraymake</strong> <var class="def-var-arguments">(<var class="var">A</var>, [<var class="var">i_1</var>, &hellip;, <var class="var">i_n</var>])</var><a class="copiable-link" href='#index-arraymake'> &para;</a></span></dt>
<dd>
<p>Returns the expression <code class="code"><var class="var">A</var>[<var class="var">i_1</var>, ..., <var class="var">i_n</var>]</code>.
The result is an unevaluated array reference.
</p>
<p><code class="code">arraymake</code> is reminiscent of <code class="code"><a class="ref" href="maxima_35.html#funmake">funmake</a></code>, except the return value
is an unevaluated array reference instead of an unevaluated function call.
</p>
<p>Examples:
</p><div class="example">
<div class="group"><pre class="example-preformatted">(%i1) arraymake (A, [1]);
(%o1)                          A
                                1
</pre></div><div class="group"><pre class="example-preformatted">(%i2) arraymake (A, [k]);
(%o2)                          A
                                k
</pre></div><div class="group"><pre class="example-preformatted">(%i3) arraymake (A, [i, j, 3]);
(%o3)                       A
                             i, j, 3
</pre></div><div class="group"><pre class="example-preformatted">(%i4) array (A, fixnum, 10);
(%o4)                           A
</pre></div><div class="group"><pre class="example-preformatted">(%i5) fillarray (A, makelist (i^2, i, 1, 11));
(%o5)                           A
</pre></div><div class="group"><pre class="example-preformatted">(%i6) arraymake (A, [5]);
(%o6)                          A
                                5
</pre></div><div class="group"><pre class="example-preformatted">(%i7) ''%;
(%o7)                          36
</pre></div><div class="group"><pre class="example-preformatted">(%i8) L : [a, b, c, d, e];
(%o8)                    [a, b, c, d, e]
</pre></div><div class="group"><pre class="example-preformatted">(%i9) arraymake ('L, [n]);
(%o9)                          L
                                n
</pre></div><div class="group"><pre class="example-preformatted">(%i10) ''%, n = 3;
(%o10)                          c
</pre></div><div class="group"><pre class="example-preformatted">(%i11) A2 : make_array (fixnum, 10);
(%o11)        {Lisp Array: #(0 0 0 0 0 0 0 0 0 0)}
</pre></div><div class="group"><pre class="example-preformatted">(%i12) fillarray (A2, [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]);
(%o12)        {Lisp Array: #(1 2 3 4 5 6 7 8 9 10)}
</pre></div><div class="group"><pre class="example-preformatted">(%i13) arraymake ('A2, [8]);
(%o13)                         A2
                                 8
</pre></div><div class="group"><pre class="example-preformatted">(%i14) ''%;
(%o14)                          9
</pre></div></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Expressions">Expressions</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Arrays">Arrays</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="arrays"></a><a class="anchor" id="Item_003a-Arrays_002fdefvr_002farrays"></a><dl class="first-defvr">
<dt class="defvr" id="index-arrays"><span class="category-def">System variable: </span><span><strong class="def-name">arrays</strong><a class="copiable-link" href='#index-arrays'> &para;</a></span></dt>
<dd><p>Default value: <code class="code">[]</code>
</p>
<p><code class="code">arrays</code> is a list of arrays that have been allocated.
These comprise arrays declared by <code class="code"><a class="ref" href="#array">array</a></code>, <code class="code"><a class="ref" href="#hashed-arrays">hashed arrays</a></code> that can be
constructed by implicit definition (assigning something to an element that isn&rsquo;t yet
declared as a list or an array),
and <code class="code"><a class="ref" href="maxima_35.html#memoizing-functions">memoizing functions</a></code> defined by <code class="code">:=</code> and <code class="code"><a class="ref" href="maxima_35.html#define">define</a></code>.
Arrays defined by <code class="code"><a class="ref" href="#make_005farray">make_array</a></code> are not included.
</p>
<p>See also
<code class="code"><a class="ref" href="#array">array</a></code>, <code class="code"><a class="ref" href="#arrayapply">arrayapply</a></code>, <code class="code"><a class="ref" href="#arrayinfo">arrayinfo</a></code>,<!-- /@w -->
<code class="code"><a class="ref" href="#arraymake">arraymake</a></code>, <code class="code"><a class="ref" href="#fillarray">fillarray</a></code>, <code class="code"><a class="ref" href="#listarray">listarray</a></code>, and
<code class="code"><a class="ref" href="#rearray">rearray</a></code>.
</p>
<p>Examples:
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) array (aa, 5, 7);
(%o1)                          aa
</pre></div><div class="group"><pre class="example-preformatted">(%i2) bb [FOO] : (a + b)^2;
                                   2
(%o2)                       (b + a)
</pre></div><div class="group"><pre class="example-preformatted">(%i3) cc [x] := x/100;
                                   x
(%o3)                      cc  := ---
                             x    100
</pre></div><div class="group"><pre class="example-preformatted">(%i4) dd : make_array ('any, 7);
(%o4)     {Lisp Array: #(NIL NIL NIL NIL NIL NIL NIL)}
</pre></div><div class="group"><pre class="example-preformatted">(%i5) arrays;
(%o5)                     [aa, bb, cc]
</pre></div></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Arrays">Arrays</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Global-variables">Global variables</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="arraysetapply"></a><a class="anchor" id="Item_003a-Arrays_002fdeffn_002farraysetapply"></a><dl class="first-deffn">
<dt class="deffn" id="index-arraysetapply"><span class="category-def">Function: </span><span><strong class="def-name">arraysetapply</strong> <var class="def-var-arguments">(<var class="var">A</var>, [<var class="var">i_1</var>, &hellip;, <var class="var">i_n</var>], <var class="var">x</var>)</var><a class="copiable-link" href='#index-arraysetapply'> &para;</a></span></dt>
<dd>
<p>Assigns <var class="var">x</var> to <code class="code"><var class="var">A</var>[<var class="var">i_1</var>, ..., <var class="var">i_n</var>]</code>,
where <var class="var">A</var> is an array and <var class="var">i_1</var>, &hellip;, <var class="var">i_n</var> are integers.
</p>
<p><code class="code">arraysetapply</code> evaluates its arguments.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Expressions">Expressions</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Arrays">Arrays</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="fillarray"></a><a class="anchor" id="Item_003a-Arrays_002fdeffn_002ffillarray"></a><dl class="first-deffn">
<dt class="deffn" id="index-fillarray"><span class="category-def">Function: </span><span><strong class="def-name">fillarray</strong> <var class="def-var-arguments">(<var class="var">A</var>, <var class="var">B</var>)</var><a class="copiable-link" href='#index-fillarray'> &para;</a></span></dt>
<dd>
<p>Fills array <var class="var">A</var> from <var class="var">B</var>, which is a list or an array.
</p>
<p>If a specific type was declared for <var class="var">A</var> when it was created,
it can only be filled with elements of that same type;
it is an error if an attempt is made to copy an element of a different type.
</p>
<p>If the dimensions of the arrays <var class="var">A</var> and <var class="var">B</var> are
different, <var class="var">A</var> is filled in row-major order.  If there are not enough
elements in <var class="var">B</var> the last element is used to fill out the
rest of <var class="var">A</var>.  If there are too many, the remaining ones are ignored.
</p>
<p><code class="code">fillarray</code> returns its first argument.
</p>
<p>Examples:
</p>
<p>Create an array of 9 elements and fill it from a list.
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) array (a1, fixnum, 8);
(%o1)                          a1
</pre></div><div class="group"><pre class="example-preformatted">(%i2) listarray (a1);
(%o2)              [0, 0, 0, 0, 0, 0, 0, 0, 0]
</pre></div><div class="group"><pre class="example-preformatted">(%i3) fillarray (a1, [1, 2, 3, 4, 5, 6, 7, 8, 9]);
(%o3)                          a1
</pre></div><div class="group"><pre class="example-preformatted">(%i4) listarray (a1);
(%o4)              [1, 2, 3, 4, 5, 6, 7, 8, 9]
</pre></div></div>

<p>When there are too few elements to fill the array,
the last element is repeated.
When there are too many elements,
the extra elements are ignored.
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) a2 : make_array (fixnum, 8);
(%o1)           {Lisp Array: #(0 0 0 0 0 0 0 0)}
</pre></div><div class="group"><pre class="example-preformatted">(%i2) fillarray (a2, [1, 2, 3, 4, 5]);
(%o2)           {Lisp Array: #(1 2 3 4 5 5 5 5)}
</pre></div><div class="group"><pre class="example-preformatted">(%i3) fillarray (a2, [4]);
(%o3)           {Lisp Array: #(4 4 4 4 4 4 4 4)}
</pre></div><div class="group"><pre class="example-preformatted">(%i4) fillarray (a2, makelist (i, i, 1, 100));
(%o4)           {Lisp Array: #(1 2 3 4 5 6 7 8)}
</pre></div></div>

<p>Multiple-dimension arrays are filled in row-major order.
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) a3 : make_array (fixnum, 2, 5);
(%o1)      {Lisp Array: #2A((0 0 0 0 0) (0 0 0 0 0))}
</pre></div><div class="group"><pre class="example-preformatted">(%i2) fillarray (a3, [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]);
(%o2)      {Lisp Array: #2A((1 2 3 4 5) (6 7 8 9 10))}
</pre></div><div class="group"><pre class="example-preformatted">(%i3) a4 : make_array (fixnum, 5, 2);
(%o3)   {Lisp Array: #2A((0 0) (0 0) (0 0) (0 0) (0 0))}
</pre></div><div class="group"><pre class="example-preformatted">(%i4) fillarray (a4, a3);
(%o4)   {Lisp Array: #2A((1 2) (3 4) (5 6) (7 8) (9 10))}
</pre></div></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Arrays">Arrays</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="listarray"></a><a class="anchor" id="Item_003a-Arrays_002fdeffn_002flistarray"></a><dl class="first-deffn">
<dt class="deffn" id="index-listarray"><span class="category-def">Function: </span><span><strong class="def-name">listarray</strong> <var class="def-var-arguments">(<var class="var">A</var>)</var><a class="copiable-link" href='#index-listarray'> &para;</a></span></dt>
<dd>
<p>Returns a list of the elements of the array <var class="var">A</var>.
The argument <var class="var">A</var> may be an array, an undeclared array (<code class="code"><a class="ref" href="#hashed-array">hashed array</a></code>),
a <code class="code"><a class="ref" href="maxima_35.html#memoizing-function">memoizing function</a></code>, or a subscripted function.
</p>
<p>Elements are listed in row-major order.
That is, elements are sorted according to the first index, then according to
the second index, and so on.  The sorting order of index values is the same as
the order established by <code class="code"><a class="ref" href="maxima_5.html#orderless">orderless</a></code>.
</p>
<p>For undeclared arrays (<code class="code"><a class="ref" href="#hashed-arrays">hashed arrays</a></code>), <code class="code"><a class="ref" href="maxima_35.html#memoizing-functions">memoizing functions</a></code>, and subscripted functions,
the elements correspond to the index values returned by <code class="code"><a class="ref" href="#arrayinfo">arrayinfo</a></code>.
</p>
<p>Unbound elements of general arrays (that is, not <code class="code">fixnum</code> and not
<code class="code">flonum</code>) are returned as <code class="code">#####</code>.
Unbound elements of <code class="code">fixnum</code> or <code class="code">flonum</code> arrays
are returned as 0 or 0.0, respectively.
Unbound elements of hashed arrays, <code class="code"><a class="ref" href="maxima_35.html#memoizing-functions">memoizing functions</a></code>,
and subscripted functions are not returned.
</p>
<p>Examples:
</p>
<p><code class="code">listarray</code> and <code class="code"><a class="ref" href="#arrayinfo">arrayinfo</a></code> applied to a declared array.
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) array (aa, 2, 3);
(%o1)                          aa
</pre></div><div class="group"><pre class="example-preformatted">(%i2) aa [2, 3] : %pi;
(%o2)                          %pi
</pre></div><div class="group"><pre class="example-preformatted">(%i3) aa [1, 2] : %e;
(%o3)                          %e
</pre></div><div class="group"><pre class="example-preformatted">(%i4) listarray (aa);
(%o4) [#####, #####, #####, #####, #####, #####, %e, #####, 
                                        #####, #####, #####, %pi]
</pre></div><div class="group"><pre class="example-preformatted">(%i5) arrayinfo (aa);
(%o5)                 [declared, 2, [2, 3]]
</pre></div></div>

<p><code class="code">listarray</code> and <code class="code"><a class="ref" href="#arrayinfo">arrayinfo</a></code> applied to an undeclared array (<code class="code"><a class="ref" href="#hashed-array">hashed array</a></code>).
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) bb [FOO] : (a + b)^2;
                                   2
(%o1)                       (b + a)
</pre></div><div class="group"><pre class="example-preformatted">(%i2) bb [BAR] : (c - d)^3;
                                   3
(%o2)                       (c - d)
</pre></div><div class="group"><pre class="example-preformatted">(%i3) listarray (bb);
                              3         2
(%o3)                 [(c - d) , (b + a) ]
</pre></div><div class="group"><pre class="example-preformatted">(%i4) arrayinfo (bb);
(%o4)               [hashed, 1, [BAR], [FOO]]
</pre></div></div>

<p><code class="code">listarray</code> and <code class="code"><a class="ref" href="#arrayinfo">arrayinfo</a></code> applied to a <code class="code"><a class="ref" href="maxima_35.html#memoizing-function">memoizing function</a></code>.
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) cc [x, y] := y / x;
                                     y
(%o1)                      cc     := -
                             x, y    x
</pre></div><div class="group"><pre class="example-preformatted">(%i2) cc [u, v];
                                v
(%o2)                           -
                                u
</pre></div><div class="group"><pre class="example-preformatted">(%i3) cc [4, z];
                                z
(%o3)                           -
                                4
</pre></div><div class="group"><pre class="example-preformatted">(%i4) listarray (cc);
                              z  v
(%o4)                        [-, -]
                              4  u
</pre></div><div class="group"><pre class="example-preformatted">(%i5) arrayinfo (cc);
(%o5)              [hashed, 2, [4, z], [u, v]]
</pre></div></div>

<p><code class="code">listarray</code> and <code class="code"><a class="ref" href="#arrayinfo">arrayinfo</a></code> applied to a subscripted function.
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) dd [x] (y) := y ^ x;
                                     x
(%o1)                     dd (y) := y
                            x
</pre></div><div class="group"><pre class="example-preformatted">(%i2) dd [a + b];
                                    b + a
(%o2)                  lambda([y], y     )
</pre></div><div class="group"><pre class="example-preformatted">(%i3) dd [v - u];
                                    v - u
(%o3)                  lambda([y], y     )
</pre></div><div class="group"><pre class="example-preformatted">(%i4) listarray (dd);
                         b + a                v - u
(%o4)      [lambda([y], y     ), lambda([y], y     )]
</pre></div><div class="group"><pre class="example-preformatted">(%i5) arrayinfo (dd);
(%o5)             [hashed, 1, [b + a], [v - u]]
</pre></div></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Arrays">Arrays</a>
&middot;
</div>
</dd></dl>


<a class="anchor" id="make_005farray"></a><a class="anchor" id="Item_003a-Arrays_002fdeffn_002fmake_005farray"></a><dl class="first-deffn">
<dt class="deffn" id="index-make_005farray"><span class="category-def">Function: </span><span><strong class="def-name">make_array</strong> <var class="def-var-arguments">(<var class="var">type</var>, <var class="var">dim_1</var>, &hellip;, <var class="var">dim_n</var>)</var><a class="copiable-link" href='#index-make_005farray'> &para;</a></span></dt>
<dd>
<p>Creates and returns a Lisp array.  <var class="var">type</var> may
be <code class="code">any</code>, <code class="code">flonum</code>, <code class="code">fixnum</code>, <code class="code">hashed</code> or 
<code class="code">functional</code>.
There are <em class="math tex2jax_process">\(n\)</em> indices,
and the <em class="math tex2jax_process">\(i\)</em>&rsquo;th index runs from 0 to <em class="math tex2jax_process">\(\mathit{dim_i} - 1\)</em>.
</p>
<p>The advantage of <code class="code">make_array</code> over <code class="code"><a class="ref" href="#array">array</a></code> is that the return value
doesn&rsquo;t have a name, and once a pointer to it goes away, it will also go away.
For example, if <code class="code">y: make_array (...)</code> then <code class="code">y</code> points to an object 
which takes up space, but after <code class="code">y: false</code>, <code class="code">y</code> no longer
points to that object, so the object can be garbage collected.
</p>

<p>Examples:
</p>
<div class="example">
<div class="group"><pre class="example-preformatted">(%i1) A1 : make_array (fixnum, 10);
(%o1)         {Lisp Array: #(0 0 0 0 0 0 0 0 0 0)}
</pre></div><div class="group"><pre class="example-preformatted">(%i2) A1 [8] : 1729;
(%o2)                         1729
</pre></div><div class="group"><pre class="example-preformatted">(%i3) A1;
(%o3)        {Lisp Array: #(0 0 0 0 0 0 0 0 1729 0)}
</pre></div><div class="group"><pre class="example-preformatted">(%i4) A2 : make_array (flonum, 10);
(%o4) {Lisp Array: #(0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0)}
</pre></div><div class="group"><pre class="example-preformatted">(%i5) A2 [2] : 2.718281828;
(%o5)                      2.718281828
</pre></div><div class="group"><pre class="example-preformatted">(%i6) A2;
(%o6) 
 {Lisp Array: #(0.0 0.0 2.718281828 0.0 0.0 0.0 0.0 0.0 0.0 0.0)}
</pre></div><div class="group"><pre class="example-preformatted">(%i7) A3 : make_array (any, 10);
(%o7) {Lisp Array: #(NIL NIL NIL NIL NIL NIL NIL NIL NIL NIL)}
</pre></div><div class="group"><pre class="example-preformatted">(%i8) A3 [4] : x - y - z;
(%o8)                     (- z) - y + x
</pre></div><div class="group"><pre class="example-preformatted">(%i9) A3;
(%o9) {Lisp Array: #(NIL NIL NIL NIL
               ((MPLUS SIMP) $X ((MTIMES SIMP) -1 $Y) ((MTIMES S\
IMP) -1 $Z))
               NIL NIL NIL NIL NIL)}
</pre></div><div class="group"><pre class="example-preformatted">(%i10) A4 : make_array (fixnum, 2, 3, 5);
(%o10) {Lisp Array: #3A(((0 0 0 0 0) (0 0 0 0 0) (0 0 0 0 0))
                 ((0 0 0 0 0) (0 0 0 0 0) (0 0 0 0 0)))}
</pre></div><div class="group"><pre class="example-preformatted">(%i11) fillarray (A4, makelist (i, i, 1, 2*3*5));
(%o11) {Lisp Array: #3A(((1 2 3 4 5) (6 7 8 9 10) (11 12 13 14 1\
5))
                 ((16 17 18 19 20) (21 22 23 24 25) (26 27 28 29\
 30)))}
</pre></div><div class="group"><pre class="example-preformatted">(%i12) A4 [0, 2, 1];
(%o12)                         12
</pre></div></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Arrays">Arrays</a>
&middot;
</div>
</dd></dl>


<a class="anchor" id="rearray"></a><a class="anchor" id="Item_003a-Arrays_002fdeffn_002frearray"></a><dl class="first-deffn">
<dt class="deffn" id="index-rearray"><span class="category-def">Function: </span><span><strong class="def-name">rearray</strong> <var class="def-var-arguments">(<var class="var">A</var>, <var class="var">dim_1</var>, &hellip;, <var class="var">dim_n</var>)</var><a class="copiable-link" href='#index-rearray'> &para;</a></span></dt>
<dd>
<p>Changes the dimensions of an array.
The new array will be filled with the elements of the old one in
row-major order.  If the old array was too small, 
the remaining elements are filled with
<code class="code">false</code>, <code class="code">0.0</code> or <code class="code">0</code>,
depending on the type of the array.  The type of the array cannot be
changed.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Arrays">Arrays</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="remarray"></a><a class="anchor" id="Item_003a-Arrays_002fdeffn_002fremarray"></a><dl class="first-deffn">
<dt class="deffn" id="index-remarray"><span class="category-def">Function: </span><span><strong class="def-name">remarray</strong> <var class="def-var-arguments"><br>&nbsp;&nbsp;&nbsp;&nbsp;<code class="t">remarray</code> (<var class="var">A_1</var>, &hellip;, <var class="var">A_n</var>) <br>&nbsp;&nbsp;&nbsp;&nbsp;<code class="t">remarray</code> (all)</var><a class="copiable-link" href='#index-remarray'> &para;</a></span></dt>
<dd>
<p>Removes arrays and array associated functions and frees the storage occupied.
The arguments may be declared arrays, <code class="code"><a class="ref" href="#hashed-arrays">hashed arrays</a></code>, array
functions, and subscripted functions.
</p>
<p><code class="code">remarray (all)</code> removes all items in the global list <code class="code"><a class="ref" href="#arrays">arrays</a></code>.
</p>
<p>It may be necessary to use this function if it is
desired to clear the cache of a <code class="code"><a class="ref" href="maxima_35.html#memoizing-function">memoizing function</a></code>.
</p>
<p><code class="code">remarray</code> returns the list of arrays removed.
</p>
<p><code class="code">remarray</code> quotes its arguments.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Arrays">Arrays</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="subvar"></a><a class="anchor" id="Item_003a-Arrays_002fdeffn_002fsubvar"></a><dl class="first-deffn">
<dt class="deffn" id="index-subvar"><span class="category-def">Function: </span><span><strong class="def-name">subvar</strong> <var class="def-var-arguments">(<var class="var">x</var>, <var class="var">i</var>)</var><a class="copiable-link" href='#index-subvar'> &para;</a></span></dt>
<dd>
<p>Evaluates the subscripted expression <code class="code"><var class="var">x</var>[<var class="var">i</var>]</code>.
</p>
<p><code class="code">subvar</code> evaluates its arguments.
</p>
<p><code class="code">arraymake (<var class="var">x</var>, [<var class="var">i</var>])</code> constructs the expression
<code class="code"><var class="var">x</var>[<var class="var">i</var>]</code>, but does not evaluate it.
</p>
<p>Examples:
</p>
<div class="example">
<pre class="example-preformatted">(%i1) x : foo $
(%i2) i : 3 $
</pre><div class="group"><pre class="example-preformatted">(%i3) subvar (x, i);
(%o3)                         foo
                                 3
</pre></div><pre class="example-preformatted">(%i4) foo : [aa, bb, cc, dd, ee]$
</pre><div class="group"><pre class="example-preformatted">(%i5) subvar (x, i);
(%o5)                          cc
</pre></div><div class="group"><pre class="example-preformatted">(%i6) arraymake (x, [i]);
(%o6)                         foo
                                 3
</pre></div><div class="group"><pre class="example-preformatted">(%i7) ''%;
(%o7)                          cc
</pre></div></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Expressions">Expressions</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Arrays">Arrays</a>
&middot;
</div>
</dd></dl>


<a class="anchor" id="subvarp"></a><a class="anchor" id="Item_003a-Arrays_002fdeffn_002fsubvarp"></a><dl class="first-deffn">
<dt class="deffn" id="index-subvarp"><span class="category-def">Function: </span><span><strong class="def-name">subvarp</strong> <var class="def-var-arguments">(<var class="var">expr</var>)</var><a class="copiable-link" href='#index-subvarp'> &para;</a></span></dt>
<dd>
<p>Returns <code class="code">true</code> if <var class="var">expr</var> is a subscripted variable, for example
<code class="code">a[i]</code>.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Predicate-functions">Predicate functions</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="use_005ffast_005farrays"></a><a class="anchor" id="Item_003a-Arrays_002fdefvr_002fuse_005ffast_005farrays"></a><dl class="first-defvr">
<dt class="defvr" id="index-use_005ffast_005farrays"><span class="category-def">Option variable: </span><span><strong class="def-name">use_fast_arrays</strong><a class="copiable-link" href='#index-use_005ffast_005farrays'> &para;</a></span></dt>
<dd><p>Default value: <code class="code">false</code>
</p>
<p>When <code class="code">use_fast_arrays</code> is <code class="code">true</code>,
arrays declared by <code class="code">array</code> are values instead of properties,
and undeclared arrays (<code class="code"><a class="ref" href="#hashed-arrays">hashed arrays</a></code>) are implemented as Lisp hashed arrays.
</p>
<p>When <code class="code">use_fast_arrays</code> is <code class="code">false</code>,
arrays declared by <code class="code">array</code> are properties,
and undeclared arrays are implemented with Maxima&rsquo;s own hashed array implementation.
</p>
<p>Note that the code <code class="code">use_fast_arrays</code> switches to is not necessarily faster
than the default one; Arrays created by <code class="code"><a class="ref" href="#make_005farray">make_array</a></code> are not affected by
<code class="code">use_fast_arrays</code>.
</p>
<p>See also <code class="code"><a class="ref" href="#translate_005ffast_005farrays">translate_fast_arrays</a></code>.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Arrays">Arrays</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Global-flags">Global flags</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="translate_005ffast_005farrays"></a><a class="anchor" id="Item_003a-Arrays_002fdefvr_002ftranslate_005ffast_005farrays"></a><dl class="first-defvr">
<dt class="defvr" id="index-translate_005ffast_005farrays"><span class="category-def">Option variable: </span><span><strong class="def-name">translate_fast_arrays</strong><a class="copiable-link" href='#index-translate_005ffast_005farrays'> &para;</a></span></dt>
<dd><p>Default value: <code class="code">false</code>
</p>
<p>When <code class="code">translate_fast_arrays</code> is <code class="code">true</code>,
the Maxima-to-Lisp translator generates code that assumes arrays are values instead of properties,
as if <code class="code">use_fast_arrays</code> were <code class="code">true</code>.
</p>
<p>When <code class="code">translate_fast_arrays</code> is <code class="code">false</code>,
the Maxima-to-Lisp translator generates code that assumes arrays are properties,
as if <code class="code">use_fast_arrays</code> were <code class="code">false</code>.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Arrays">Arrays</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Translation-flags-and-variables">Translation flags and variables</a>
&middot;
</div>
</dd></dl>
<a class="anchor" id="Item_003a-defstruct_002fnode_002fStructures"></a><hr>
</div>
</div>
<div class="section-level-extent" id="Structures">
<div class="nav-panel">
<p>
Previous: <a href="#Arrays" accesskey="p" rel="prev">Arrays</a>, Up: <a href="#Data-Types-and-Structures" accesskey="u" rel="up">Data Types and Structures</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="Table of contents" rel="contents">Contents</a>][<a href="Function-and-Variable-Index.html" title="Index" rel="index">Index</a>]</p>
</div>
<h3 class="section" id="Structures-1">5.6 Structures</h3>


<a class="anchor" id="Item_003a-defstruct_002fnode_002fIntroduction-to-Structures"></a><ul class="mini-toc">
<li><a href="#Introduction-to-Structures" accesskey="1">Introduction to Structures</a></li>
<li><a href="#Functions-and-Variables-for-Structures" accesskey="2">Functions and Variables for Structures</a></li>
</ul>
<hr>
<div class="subsection-level-extent" id="Introduction-to-Structures">
<div class="nav-panel">
<p>
Next: <a href="#Functions-and-Variables-for-Structures" accesskey="n" rel="next">Functions and Variables for Structures</a>, Previous: <a href="#Structures" accesskey="p" rel="prev">Structures</a>, Up: <a href="#Structures" accesskey="u" rel="up">Structures</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="Table of contents" rel="contents">Contents</a>][<a href="Function-and-Variable-Index.html" title="Index" rel="index">Index</a>]</p>
</div>
<h4 class="subsection" id="Introduction-to-Structures-1">5.6.1 Introduction to Structures</h4>

<p>Maxima provides a simple data aggregate called a structure.
A structure is an expression in which arguments are identified by name (the field name)
and the expression as a whole is identified by its operator (the structure name).
A field value can be any expression.
</p>
<p>A structure is defined by the <code class="code">defstruct</code> function;
the global variable <code class="code">structures</code> is the list of user-defined structures.
The function <code class="code">new</code> creates instances of structures.
The <code class="code">@</code> operator refers to fields.
<code class="code">kill(<var class="var">S</var>)</code> removes the structure definition <var class="var">S</var>,
and <code class="code">kill(<var class="var">x</var>@ <var class="var">a</var>)</code> unbinds the field <var class="var">a</var> of the structure instance <var class="var">x</var>.
</p>
<p>In the pretty-printing console display (with <code class="code"><a class="ref" href="maxima_3.html#display2d">display2d</a></code> equal to <code class="code">true</code>),
structure instances are displayed with the value of each field
represented as an equation, with the field name on the left-hand side
and the value on the right-hand side.
(The equation is only a display construct; only the value is actually stored.)
In 1-dimensional display (via <code class="code">grind</code> or with <code class="code"><a class="ref" href="maxima_3.html#display2d">display2d</a></code> equal to <code class="code">false</code>),
structure instances are displayed without the field names.
</p>
<p>There is no way to use a field name as a function name,
although a field value can be a lambda expression.
Nor can the values of fields be restricted to certain types; any field can be assigned any kind of expression.
There is no way to make some fields accessible or inaccessible in different contexts;
all fields are always visible.
</p>
<a class="anchor" id="Item_003a-defstruct_002fnode_002fFunctions-and-Variables-for-Structures"></a><hr>
</div>
<div class="subsection-level-extent" id="Functions-and-Variables-for-Structures">
<div class="nav-panel">
<p>
Previous: <a href="#Introduction-to-Structures" accesskey="p" rel="prev">Introduction to Structures</a>, Up: <a href="#Structures" accesskey="u" rel="up">Structures</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="Table of contents" rel="contents">Contents</a>][<a href="Function-and-Variable-Index.html" title="Index" rel="index">Index</a>]</p>
</div>
<h4 class="subsection" id="Functions-and-Variables-for-Structures-1">5.6.2 Functions and Variables for Structures</h4>

<a class="anchor" id="structures"></a><a class="anchor" id="Item_003a-defstruct_002fdefvr_002fstructures"></a><dl class="first-defvr">
<dt class="defvr" id="index-structures"><span class="category-def">Global variable: </span><span><strong class="def-name">structures</strong><a class="copiable-link" href='#index-structures'> &para;</a></span></dt>
<dd>
<p><code class="code">structures</code> is the list of user-defined structures defined by <code class="code">defstruct</code>.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Structures">Structures</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Global-variables">Global variables</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="defstruct"></a><a class="anchor" id="Item_003a-defstruct_002fdeffn_002fdefstruct"></a><dl class="first-deffn">
<dt class="deffn" id="index-defstruct"><span class="category-def">Function: </span><span><strong class="def-name">defstruct</strong> <var class="def-var-arguments"><br>&nbsp;&nbsp;&nbsp;&nbsp;<code class="t">defstruct</code> (<var class="var">S</var>(<var class="var">a_1</var>, &hellip;, <var class="var">a_n</var>)) <br>&nbsp;&nbsp;&nbsp;&nbsp;<code class="t">defstruct</code> (<var class="var">S</var>(<var class="var">a_1</var> = <var class="var">v_1</var>, &hellip;, <var class="var">a_n</var> = <var class="var">v_n</var>))</var><a class="copiable-link" href='#index-defstruct'> &para;</a></span></dt>
<dd>
<p>Define a structure, which is a list of named fields <var class="var">a_1</var>, &hellip;,
<var class="var">a_n</var> associated with a symbol <var class="var">S</var>.
An instance of a structure is just an expression which has operator <var class="var">S</var>
and exactly <code class="code">n</code> arguments.
<code class="code">new(<var class="var">S</var>)</code> creates a new instance of structure <var class="var">S</var>.
</p>
<p>An argument which is just a symbol <var class="var">a</var> specifies the name of a field.
An argument which is an equation <code class="code"><var class="var">a</var> = <var class="var">v</var></code> specifies the field name <var class="var">a</var>
and its default value <var class="var">v</var>.
The default value can be any expression.
</p>
<p><code class="code">defstruct</code> puts <var class="var">S</var> on the list of user-defined structures, <code class="code">structures</code>.
</p>
<p><code class="code">kill(<var class="var">S</var>)</code> removes <var class="var">S</var> from the list of user-defined structures,
and removes the structure definition.
</p>
<p>Examples:
</p>
<div class="example">
<pre class="example-preformatted">(%i1) defstruct (foo (a, b, c));
(%o1)                    [foo(a, b, c)]
(%i2) structures;
(%o2)                    [foo(a, b, c)]
(%i3) new (foo);
(%o3)                     foo(a, b, c)
(%i4) defstruct (bar (v, w, x = 123, y = %pi));
(%o4)             [bar(v, w, x = 123, y = %pi)]
(%i5) structures;
(%o5)      [foo(a, b, c), bar(v, w, x = 123, y = %pi)]
(%i6) new (bar);
(%o6)              bar(v, w, x = 123, y = %pi)
(%i7) kill (foo);
(%o7)                         done
(%i8) structures;
(%o8)             [bar(v, w, x = 123, y = %pi)]
</pre></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Structures">Structures</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="new"></a><a class="anchor" id="Item_003a-defstruct_002fdeffn_002fnew"></a><dl class="first-deffn">
<dt class="deffn" id="index-new"><span class="category-def">Function: </span><span><strong class="def-name">new</strong> <var class="def-var-arguments"><br>&nbsp;&nbsp;&nbsp;&nbsp;<code class="t">new</code> (<var class="var">S</var>) <br>&nbsp;&nbsp;&nbsp;&nbsp;<code class="t">new</code> (<var class="var">S</var> (<var class="var">v_1</var>, &hellip;, <var class="var">v_n</var>))</var><a class="copiable-link" href='#index-new'> &para;</a></span></dt>
<dd>
<p><code class="code">new</code> creates new instances of structures.
</p>
<p><code class="code">new(<var class="var">S</var>)</code> creates a new instance of structure <var class="var">S</var>
in which each field is assigned its default value, if any,
or no value at all if no default was specified in the structure definition.
</p>
<p><code class="code">new(<var class="var">S</var>(<var class="var">v_1</var>, ..., <var class="var">v_n</var>))</code> creates a new instance of <var class="var">S</var>
in which fields are assigned the values <var class="var">v_1</var>, &hellip;, <var class="var">v_n</var>.
</p>
<p>Examples:
</p>
<div class="example">
<pre class="example-preformatted">(%i1) defstruct (foo (w, x = %e, y = 42, z));
(%o1)              [foo(w, x = %e, y = 42, z)]
(%i2) new (foo);
(%o2)               foo(w, x = %e, y = 42, z)
(%i3) new (foo (1, 2, 4, 8));
(%o3)            foo(w = 1, x = 2, y = 4, z = 8)
</pre></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Structures">Structures</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="Item_003a-defstruct_002fdeffn_002f_0040"></a><dl class="first-deffn">
<dt class="deffn" id="index-_0040"><span class="category-def">Operator: </span><span><strong class="def-name">@</strong><a class="copiable-link" href='#index-_0040'> &para;</a></span></dt>
<dd>
<p><code class="code">@</code> is the structure field access operator.
The expression <code class="code"><var class="var">x</var>@ <var class="var">a</var></code> refers to the value of field <var class="var">a</var> of the structure instance <var class="var">x</var>.
The field name is not evaluated.
</p>
<p>If the field <var class="var">a</var> in <var class="var">x</var> has not been assigned a value,
<code class="code"><var class="var">x</var>@ <var class="var">a</var></code> evaluates to itself.
</p>
<p><code class="code">kill(<var class="var">x</var>@ <var class="var">a</var>)</code> removes the value of field <var class="var">a</var> in <var class="var">x</var>.
</p>
<p>Examples:
</p>
<div class="example">
<pre class="example-preformatted">(%i1) defstruct (foo (x, y, z));
(%o1)                    [foo(x, y, z)]
(%i2) u : new (foo (123, a - b, %pi));
(%o2)           foo(x = 123, y = a - b, z = %pi)
(%i3) u@z;
(%o3)                          %pi
(%i4) u@z : %e;
(%o4)                          %e
(%i5) u;
(%o5)            foo(x = 123, y = a - b, z = %e)
(%i6) kill (u@z);
(%o6)                         done
(%i7) u;
(%o7)              foo(x = 123, y = a - b, z)
(%i8) u@z;
(%o8)                          u@z
</pre></div>

<p>The field name is not evaluated.
</p>
<div class="example">
<pre class="example-preformatted">(%i1) defstruct (bar (g, h));
(%o1)                      [bar(g, h)]
(%i2) x : new (bar);
(%o2)                       bar(g, h)
(%i3) x@h : 42;
(%o3)                          42
(%i4) h : 123;
(%o4)                          123
(%i5) x@h;
(%o5)                          42
(%i6) x@h : 19;
(%o6)                          19
(%i7) x;
(%o7)                    bar(g, h = 19)
(%i8) h;
(%o8)                          123
</pre></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Structures">Structures</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Operators">Operators</a>
&middot;
</div>
</dd></dl>


</div>
</div>
</div>
<hr>
<div class="nav-panel">
<p>
Next: <a href="maxima_5.html#Expressions" accesskey="n" rel="next">Expressions</a>, Previous: <a href="maxima_3.html#Command-Line" accesskey="p" rel="prev">Command Line</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="Table of contents" rel="contents">Contents</a>][<a href="Function-and-Variable-Index.html" title="Index" rel="index">Index</a>]</p>
</div>


<a href="js_licenses.html" rel="jslicense"><small>JavaScript license information</small></a>
</body>
</html>
