<!DOCTYPE html>
<html>
<!-- Created by GNU Texinfo 7.0.3, https://www.gnu.org/software/texinfo/ -->
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>ezunits-pkg (Maxima 5.47.0 Manual)</title>

<meta name="description" content="ezunits-pkg (Maxima 5.47.0 Manual)">
<meta name="keywords" content="ezunits-pkg (Maxima 5.47.0 Manual)">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="makeinfo">
<meta name="viewport" content="width=device-width,initial-scale=1">

<link href="maxima_toc.html" rel="start" title="Top">
<link href="Function-and-Variable-Index.html" rel="index" title="Function and Variable Index">
<link href="maxima_toc.html#SEC_Contents" rel="contents" title="Table of Contents">
<link href="maxima_toc.html" rel="up" title="Top">
<link href="maxima_57.html#f90_002dpkg" rel="next" title="f90-pkg">
<link href="maxima_55.html#engineering_002dformat_002dpkg" rel="prev" title="engineering-format-pkg">
<style type="text/css">
<!--
a.copiable-link {visibility: hidden; text-decoration: none; line-height: 0em}
div.example {margin-left: 3.2em}
span:hover a.copiable-link {visibility: visible}
strong.def-name {font-family: monospace; font-weight: bold; font-size: larger}
ul.mark-bullet {list-style-type: disc}
body {color: black; background: white;  margin-left: 8%; margin-right: 13%;
      font-family: "FreeSans", sans-serif}
h1 {font-size: 150%; font-family: "FreeSans", sans-serif}
h2 {font-size: 125%; font-family: "FreeSans", sans-serif}
h3 {font-size: 100%; font-family: "FreeSans", sans-serif}
a[href] {color: rgb(0,0,255); text-decoration: none;}
a[href]:hover {background: rgb(220,220,220);}
div.textbox {border: solid; border-width: thin; padding-top: 1em;
    padding-bottom: 1em; padding-left: 2em; padding-right: 2em}
div.titlebox {border: none; padding-top: 1em; padding-bottom: 1em;
    padding-left: 2em; padding-right: 2em; background: rgb(200,255,255);
    font-family: sans-serif}
div.synopsisbox {
    border: none; padding-top: 1em; padding-bottom: 1em; padding-left: 2em;
    padding-right: 2em; background: rgb(255,220,255);}
pre.example {border: 1px solid rgb(180,180,180); padding-top: 1em;
    padding-bottom: 1em; padding-left: 1em; padding-right: 1em;
    background-color: rgb(238,238,255)}
div.spacerbox {border: none; padding-top: 2em; padding-bottom: 2em}
div.image {margin: 0; padding: 1em; text-align: center}
div.categorybox {border: 1px solid gray; padding-top: 1em; padding-bottom: 1em;
    padding-left: 1em; padding-right: 1em; background: rgb(247,242,220)}
img {max-width:80%; max-height: 80%; display: block; margin-left: auto; margin-right: auto}

-->
</style>

<script type='text/javascript'>
MathJax = {
  options: {
    skipHtmlTags: {'[-]': ['pre']},
    ignoreHtmlClass: 'tex2jax_ignore',
    processHtmlClass: 'tex2jax_process'
  },
};
</script><script type="text/javascript" id="MathJax-script" async
  src="https://cdn.jsdelivr.net/npm/mathjax@3/es5/tex-svg.js">
</script>
</head>

<body lang="en" class="tex2jax_ignore">
<div class="chapter-level-extent" id="ezunits_002dpkg">
<div class="nav-panel">
<p>
Next: <a href="maxima_57.html#f90_002dpkg" accesskey="n" rel="next">f90</a>, Previous: <a href="maxima_55.html#engineering_002dformat_002dpkg" accesskey="p" rel="prev">engineering-format</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="Table of contents" rel="contents">Contents</a>][<a href="Function-and-Variable-Index.html" title="Index" rel="index">Index</a>]</p>
</div>
<h2 class="chapter" id="ezunits">57 ezunits</h2>

<a class="anchor" id="Item_003a-ezunits_002fnode_002fIntroduction-to-ezunits"></a><ul class="mini-toc">
<li><a href="#Introduction-to-ezunits" accesskey="1">Introduction to ezunits</a></li>
<li><a href="#Introduction-to-physical_005fconstants" accesskey="2">Introduction to physical_constants</a></li>
<li><a href="#Functions-and-Variables-for-ezunits" accesskey="3">Functions and Variables for ezunits</a></li>
</ul>
<hr>
<div class="section-level-extent" id="Introduction-to-ezunits">
<div class="nav-panel">
<p>
Next: <a href="#Introduction-to-physical_005fconstants" accesskey="n" rel="next">Introduction to physical_constants</a>, Previous: <a href="#ezunits_002dpkg" accesskey="p" rel="prev">ezunits</a>, Up: <a href="#ezunits_002dpkg" accesskey="u" rel="up">ezunits</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="Table of contents" rel="contents">Contents</a>][<a href="Function-and-Variable-Index.html" title="Index" rel="index">Index</a>]</p>
</div>
<h3 class="section" id="Introduction-to-ezunits-1">57.1 Introduction to ezunits</h3>

<p><code class="code">ezunits</code> is a package for working with dimensional quantities,
including some functions for dimensional analysis.
<code class="code">ezunits</code> can carry out arithmetic operations on dimensional quantities and unit conversions.
The built-in units include Systeme Internationale (SI) and US customary units,
and other units can be declared.
See also <code class="code"><a class="ref" href="#physical_005fconstants">physical_constants</a></code>, a collection of physical constants.
</p>
<p><code class="code">load(&quot;ezunits&quot;)</code> loads this package.
<code class="code">demo(&quot;ezunits&quot;)</code> displays several examples.
The convenience function <code class="code">known_units</code> returns a list of
the built-in and user-declared units,
while <code class="code">display_known_unit_conversions</code> displays
the set of known conversions in an easy-to-read format.
</p>
<p>An expression <em class="math tex2jax_process">\(a ` b\)</em> represents a dimensional quantity,
with <code class="code">a</code> indicating a nondimensional quantity and <code class="code">b</code> indicating the dimensional units.
A symbol can be used as a unit without declaring it as such;
unit symbols need not have any special properties.
The quantity and unit of an expression <em class="math tex2jax_process">\(a ` b\)</em> can
be extracted by the <code class="code">qty</code> and <code class="code">units</code> functions, respectively.
</p>
<p>A symbol may be declared to be a dimensional quantity,
with specified quantity or specified units or both.
</p>
<p>An expression <em class="math tex2jax_process">\(a ` b `\hbox{}` c\)</em> converts from unit <code class="code">b</code> to unit <code class="code">c</code>.
<code class="code">ezunits</code> has built-in conversions for SI base units,
SI derived units, and some non-SI units.
Unit conversions not already known to <code class="code">ezunits</code> can be declared.
The unit conversions known to <code class="code">ezunits</code> are specified by the
global variable <code class="code">known_unit_conversions</code>,
which comprises built-in and user-defined conversions.
Conversions for products, quotients, and powers of units are
derived from the set of known unit conversions.
</p>
<p>As Maxima generally prefers exact numbers (integers or rationals)
to inexact (float or bigfloat),
so <code class="code">ezunits</code> preserves exact numbers when they appear
in dimensional quantities.
All built-in unit conversions are expressed in terms of exact numbers;
inexact numbers in declared conversions are coerced to exact.
</p>
<p>There is no preferred system for display of units;
input units are not converted to other units
unless conversion is explicitly indicated.
<code class="code">ezunits</code> recognizes the prefixes m-, k-, M, and G-
(for milli-, kilo-, mega-, and giga-)
as applied to SI base units and SI derived units,
but such prefixes are applied only when indicated by an explicit conversion.
</p>
<p>Arithmetic operations on dimensional quantities are carried out by
conventional rules for such operations.
</p>
<ul class="itemize mark-bullet">
<li><em class="math tex2jax_process">\((x ` a) * (y ` b)\)</em> is equal to <em class="math tex2jax_process">\((x * y) ` (a * b)\)</em>.
</li><li><em class="math tex2jax_process">\((x ` a) + (y ` a)\)</em> is equal to <em class="math tex2jax_process">\((x + y) ` a\)</em>.
</li><li><em class="math tex2jax_process">\((x ` a)^y\)</em> is equal to <em class="math tex2jax_process">\(x^y ` a^y\)</em> when <code class="code">y</code> is nondimensional.
</li></ul>

<p><code class="code">ezunits</code> does not require that units in a sum have the same dimensions;
such terms are not added together, and no error is reported.
</p>
<p><code class="code">ezunits</code> includes functions for elementary dimensional analysis,
namely the fundamental dimensions and fundamental units
of a dimensional quantity,
and computation of dimensionless quantities and natural units.
The functions for dimensional analysis were adapted from similar
functions in another package, written by Barton Willis.
</p>
<p>For the purpose of dimensional analysis,
a list of fundamental dimensions and an associated list of fundamental units
are maintained;
by default the fundamental dimensions are
length, mass, time, charge, temperature, and quantity,
and the fundamental units are the associated SI units,
but other fundamental dimensions and units can be declared.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Physical-units">Physical units</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Share-packages">Share packages</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Package-ezunits">Package ezunits</a>
&middot;
</div>

<a class="anchor" id="Item_003a-ezunits_002fnode_002fIntroduction-to-physical_005fconstants"></a><hr>
</div>
<div class="section-level-extent" id="Introduction-to-physical_005fconstants">
<div class="nav-panel">
<p>
Next: <a href="#Functions-and-Variables-for-ezunits" accesskey="n" rel="next">Functions and Variables for ezunits</a>, Previous: <a href="#Introduction-to-ezunits" accesskey="p" rel="prev">Introduction to ezunits</a>, Up: <a href="#ezunits_002dpkg" accesskey="u" rel="up">ezunits</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="Table of contents" rel="contents">Contents</a>][<a href="Function-and-Variable-Index.html" title="Index" rel="index">Index</a>]</p>
</div>
<h3 class="section" id="Introduction-to-physical_005fconstants-1">57.2 Introduction to physical_constants</h3>

<a class="anchor" id="physical_005fconstants"></a><p><code class="code">physical_constants</code> is a collection of physical constants,
copied from CODATA 2006 recommended values
(<a class="url" href="https://physics.nist.gov/cuu/Constants/">https://physics.nist.gov/cuu/Constants/</a>).
<code class="code">load (&quot;physical_constants&quot;)</code> loads this package,
and loads <code class="code">ezunits</code> also, if it is not already loaded.
</p>
<p>A physical constant is represented as a symbol which has a property
which is the constant value.
The constant value is a dimensional quantity, as represented by <code class="code">ezunits</code>.
The function <code class="code">constvalue</code> fetches the constant value;
the constant value is not the ordinary value of the symbol,
so symbols of physical constants persist in evaluated expressions until their
values are fetched by <code class="code">constvalue</code>.
</p>
<p><code class="code">physical_constants</code> includes some auxiliary information,
namely, a description string for each constant,
an estimate of the error of its numerical value,
and a property for TeX display.
To identify physical constants, each symbol has the
<code class="code">physical_constant</code> property;
<code class="code">propvars(physical_constant)</code> therefore shows the list
of all such symbols.
</p>
<p><code class="code">physical_constants</code> comprises the following constants.
</p>
<dl class="table">
<dt><code class="code">%c</code></dt>
<dd><p>speed of light in vacuum
</p></dd>
<dt><code class="code">%mu_0</code></dt>
<dd><p>magnetic constant
</p></dd>
<dt><code class="code">%e_0</code></dt>
<dd><p>electric constant
</p></dd>
<dt><code class="code">%Z_0</code></dt>
<dd><p>characteristic impedance of vacuum
</p></dd>
<dt><code class="code">%G</code></dt>
<dd><p>Newtonian constant of gravitation
</p></dd>
<dt><code class="code">%h</code></dt>
<dd><p>Planck constant
</p></dd>
<dt><code class="code">%h_bar</code></dt>
<dd><p>Planck constant
</p></dd>
<dt><code class="code">%m_P</code></dt>
<dd><p>Planck mass
</p></dd>
<dt><code class="code">%T_P</code></dt>
<dd><p>Planck temperature
</p></dd>
<dt><code class="code">%l_P</code></dt>
<dd><p>Planck length
</p></dd>
<dt><code class="code">%t_P</code></dt>
<dd><p>Planck time
</p></dd>
<dt><code class="code">%%e</code></dt>
<dd><p>elementary charge
</p></dd>
<dt><code class="code">%Phi_0</code></dt>
<dd><p>magnetic flux quantum
</p></dd>
<dt><code class="code">%G_0</code></dt>
<dd><p>conductance quantum
</p></dd>
<dt><code class="code">%K_J</code></dt>
<dd><p>Josephson constant
</p></dd>
<dt><code class="code">%R_K</code></dt>
<dd><p>von Klitzing constant
</p></dd>
<dt><code class="code">%mu_B</code></dt>
<dd><p>Bohr magneton
</p></dd>
<dt><code class="code">%mu_N</code></dt>
<dd><p>nuclear magneton
</p></dd>
<dt><code class="code">%alpha</code></dt>
<dd><p>fine-structure constant
</p></dd>
<dt><code class="code">%R_inf</code></dt>
<dd><p>Rydberg constant
</p></dd>
<dt><code class="code">%a_0</code></dt>
<dd><p>Bohr radius
</p></dd>
<dt><code class="code">%E_h</code></dt>
<dd><p>Hartree energy
</p></dd>
<dt><code class="code">%ratio_h_me</code></dt>
<dd><p>quantum of circulation
</p></dd>
<dt><code class="code">%m_e</code></dt>
<dd><p>electron mass
</p></dd>
<dt><code class="code">%N_A</code></dt>
<dd><p>Avogadro constant
</p></dd>
<dt><code class="code">%m_u</code></dt>
<dd><p>atomic mass constant
</p></dd>
<dt><code class="code">%F</code></dt>
<dd><p>Faraday constant
</p></dd>
<dt><code class="code">%R</code></dt>
<dd><p>molar gas constant
</p></dd>
<dt><code class="code">%%k</code></dt>
<dd><p>Boltzmann constant
</p></dd>
<dt><code class="code">%V_m</code></dt>
<dd><p>molar volume of ideal gas
</p></dd>
<dt><code class="code">%n_0</code></dt>
<dd><p>Loschmidt constant
</p></dd>
<dt><code class="code">%ratio_S0_R</code></dt>
<dd><p>Sackur-Tetrode constant (absolute entropy constant)
</p></dd>
<dt><code class="code">%sigma</code></dt>
<dd><p>Stefan-Boltzmann constant
</p></dd>
<dt><code class="code">%c_1</code></dt>
<dd><p>first radiation constant
</p></dd>
<dt><code class="code">%c_1L</code></dt>
<dd><p>first radiation constant for spectral radiance
</p></dd>
<dt><code class="code">%c_2</code></dt>
<dd><p>second radiation constant
</p></dd>
<dt><code class="code">%b</code></dt>
<dd><p>Wien displacement law constant
</p></dd>
<dt><code class="code">%b_prime</code></dt>
<dd><p>Wien displacement law constant
</p></dd>
</dl>

<p>Reference: <a class="url" href="https://physics.nist.gov/cuu/Constants/">https://physics.nist.gov/cuu/Constants/</a>
</p>
<p>Examples:
</p>
<p>The list of all symbols which have the <code class="code">physical_constant</code> property.
</p>
<div class="example">
<pre class="example-preformatted">(%i1) load (&quot;physical_constants&quot;)$
(%i2) propvars (physical_constant);
(%o2) [%c, %mu_0, %e_0, %Z_0, %G, %h, %h_bar, %m_P, %T_P, %l_P, 
%t_P, %%e, %Phi_0, %G_0, %K_J, %R_K, %mu_B, %mu_N, %alpha, 
%R_inf, %a_0, %E_h, %ratio_h_me, %m_e, %N_A, %m_u, %F, %R, %%k, 
%V_m, %n_0, %ratio_S0_R, %sigma, %c_1, %c_1L, %c_2, %b, %b_prime]
</pre></div>

<p>Properties of the physical constant <code class="code">%c</code>.
</p>
<div class="example">
<pre class="example-preformatted">(%i1) load (&quot;physical_constants&quot;)$
(%i2) constantp (%c);
(%o2)                         true
(%i3) get (%c, description);
(%o3)               speed of light in vacuum
(%i4) constvalue (%c);
                                      m
(%o4)                     299792458 ` -
                                      s
(%i5) get (%c, RSU);
(%o5)                           0
(%i6) tex (%c);
$$c$$
(%o6)                         false
</pre></div>

<p>The energy equivalent of 1 pound-mass.
The symbol <code class="code">%c</code> persists until its value is fetched by <code class="code">constvalue</code>.
</p>
<div class="example">
<pre class="example-preformatted">(%i1) load (&quot;physical_constants&quot;)$
(%i2) m * %c^2;
                                2
(%o2)                         %c  m
(%i3) %, m = 1 ` lbm;
                              2
(%o3)                       %c  ` lbm
(%i4) constvalue (%);
                                            2
                                       lbm m
(%o4)              89875517873681764 ` ------
                                          2
                                         s
(%i5) E : % `` J;
Computing conversions to base units; may take a moment. 
                     366838848464007200
(%o5)                ------------------ ` J
                             9
(%i6) E `` GJ;
                      458548560580009
(%o6)                 --------------- ` GJ
                         11250000
(%i7) float (%);
(%o7)              4.0759872051556356e+7 ` GJ
</pre></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Physical-units">Physical units</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Share-packages">Share packages</a>
&middot;
<a class="ref" href="Documentation-Categories.html#Category_003a-Package-physical_005fconstants">Package physical_constants</a>
&middot;
</div>

<a class="anchor" id="Item_003a-ezunits_002fnode_002fFunctions-and-Variables-for-ezunits"></a><hr>
</div>
<div class="section-level-extent" id="Functions-and-Variables-for-ezunits">
<div class="nav-panel">
<p>
Previous: <a href="#Introduction-to-physical_005fconstants" accesskey="p" rel="prev">Introduction to physical_constants</a>, Up: <a href="#ezunits_002dpkg" accesskey="u" rel="up">ezunits</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="Table of contents" rel="contents">Contents</a>][<a href="Function-and-Variable-Index.html" title="Index" rel="index">Index</a>]</p>
</div>
<h3 class="section" id="Functions-and-Variables-for-ezunits-1">57.3 Functions and Variables for ezunits</h3>

<a class="anchor" id="Item_003a-ezunits_002fdeffn_002f_0060"></a><dl class="first-deffn">
<dt class="deffn" id="index-_0060"><span class="category-def">Operator: </span><span><strong class="def-name">`</strong><a class="copiable-link" href='#index-_0060'> &para;</a></span></dt>
<dd>
<p>The dimensional quantity operator.
An expression <em class="math tex2jax_process">\(a ` b\)</em> represents a dimensional quantity,
with <code class="code">a</code> indicating a nondimensional quantity and <code class="code">b</code> indicating the dimensional units.
A symbol can be used as a unit without declaring it as such;
unit symbols need not have any special properties.
The quantity and unit of an expression <em class="math tex2jax_process">\(a ` b\)</em> can
be extracted by the <code class="code">qty</code> and <code class="code">units</code> functions, respectively.
</p>
<p>Arithmetic operations on dimensional quantities are carried out by
conventional rules for such operations.
</p>
<ul class="itemize mark-bullet">
<li><em class="math tex2jax_process">\((x ` a) * (y ` b)\)</em> is equal to <em class="math tex2jax_process">\((x * y) ` (a * b)\)</em>.
</li><li><em class="math tex2jax_process">\((x ` a) + (y ` a)\)</em> is equal to <em class="math tex2jax_process">\((x + y) ` a\)</em>.
</li><li><em class="math tex2jax_process">\((x ` a)^y\)</em> is equal to <em class="math tex2jax_process">\(x^y ` a^y\)</em> when <code class="code">y</code> is nondimensional.
</li></ul>

<p><code class="code">ezunits</code> does not require that units in a sum have the same dimensions;
such terms are not added together, and no error is reported.
</p>
<p><code class="code">load (&quot;ezunits&quot;)</code> enables this operator.
</p>
<p>Examples:
</p>
<p>SI (Systeme Internationale) units.
</p>
<div class="example">
<pre class="example-preformatted">(%i1) load (&quot;ezunits&quot;)$
(%i2) foo : 10 ` m;
(%o2)                        10 ` m
(%i3) qty (foo);
(%o3)                          10
(%i4) units (foo);
(%o4)                           m
(%i5) dimensions (foo);
(%o5)                        length
</pre></div>

<p>&quot;Customary&quot; units.
</p>
<div class="example">
<pre class="example-preformatted">(%i1) load (&quot;ezunits&quot;)$
(%i2) bar : x ` acre;
(%o2)                       x ` acre
(%i3) dimensions (bar);
                                   2
(%o3)                        length
(%i4) fundamental_units (bar);
                                2
(%o4)                          m
</pre></div>

<p>Units ad hoc.
</p>
<div class="example">
<pre class="example-preformatted">(%i1) load (&quot;ezunits&quot;)$
(%i2) baz : 3 ` sheep + 8 ` goat + 1 ` horse;
(%o2)           8 ` goat + 3 ` sheep + 1 ` horse
(%i3) subst ([sheep = 3*goat, horse = 10*goat], baz);
(%o3)                       27 ` goat
(%i4) baz2 : 1000`gallon/fortnight;
                                gallon
(%o4)                   1000 ` ---------
                               fortnight
(%i5) subst (fortnight = 14*day, baz2);
                          500   gallon
(%o5)                     --- ` ------
                           7     day
</pre></div>

<p>Arithmetic operations on dimensional quantities.
</p>
<div class="example">
<pre class="example-preformatted">(%i1) load (&quot;ezunits&quot;)$
(%i2) 100 ` kg + 200 ` kg;
(%o2)                       300 ` kg
(%i3) 100 ` m^3 - 100 ` m^3;
                                  3
(%o3)                        0 ` m
(%i4) (10 ` kg) * (17 ` m/s^2);
                                 kg m
(%o4)                      170 ` ----
                                   2
                                  s
(%i5) (x ` m) / (y ` s);
                              x   m
(%o5)                         - ` -
                              y   s
(%i6) (a ` m)^2;
                              2    2
(%o6)                        a  ` m
</pre></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Package-ezunits">Package ezunits</a>
&middot;
</div>

</dd></dl>

<a class="anchor" id="Item_003a-ezunits_002fdeffn_002f_0060_0060"></a><dl class="first-deffn">
<dt class="deffn" id="index-_0060_0060"><span class="category-def">Operator: </span><span><strong class="def-name">`<!-- /@w -->`</strong><a class="copiable-link" href='#index-_0060_0060'> &para;</a></span></dt>
<dd>
<p>The unit conversion operator.
An expression <em class="math tex2jax_process">\(a ` b `\hbox{}` c\)</em> converts from unit <code class="code">b</code> to unit <code class="code">c</code>.
<code class="code">ezunits</code> has built-in conversions for SI base units,
SI derived units, and some non-SI units.
Unit conversions not already known to <code class="code">ezunits</code> can be declared.
The unit conversions known to <code class="code">ezunits</code> are specified by the
global variable <code class="code">known_unit_conversions</code>,
which comprises built-in and user-defined conversions.
Conversions for products, quotients, and powers of units are
derived from the set of known unit conversions.
</p>
<p>There is no preferred system for display of units;
input units are not converted to other units
unless conversion is explicitly indicated.
<code class="code">ezunits</code> does not attempt to simplify units by prefixes
(milli-, centi-, deci-, etc)
unless such conversion is explicitly indicated.
</p>
<p><code class="code">load (&quot;ezunits&quot;)</code> enables this operator.
</p>
<p>Examples:
</p>
<p>The set of known unit conversions.
</p>
<div class="example">
<pre class="example-preformatted">(%i1) load (&quot;ezunits&quot;)$
(%i2) display2d : false$
(%i3) known_unit_conversions;
(%o3) {acre = 4840*yard^2,Btu = 1055*J,cfm = feet^3/minute,
       cm = m/100,day = 86400*s,feet = 381*m/1250,ft = feet,
       g = kg/1000,gallon = 757*l/200,GHz = 1000000000*Hz,
       GOhm = 1000000000*Ohm,GPa = 1000000000*Pa,
       GWb = 1000000000*Wb,Gg = 1000000*kg,Gm = 1000000000*m,
       Gmol = 1000000*mol,Gs = 1000000000*s,ha = hectare,
       hectare = 100*m^2,hour = 3600*s,Hz = 1/s,inch = feet/12,
       km = 1000*m,kmol = 1000*mol,ks = 1000*s,l = liter,
       lbf = pound_force,lbm = pound_mass,liter = m^3/1000,
       metric_ton = Mg,mg = kg/1000000,MHz = 1000000*Hz,
       microgram = kg/1000000000,micrometer = m/1000000,
       micron = micrometer,microsecond = s/1000000,
       mile = 5280*feet,minute = 60*s,mm = m/1000,
       mmol = mol/1000,month = 2629800*s,MOhm = 1000000*Ohm,
       MPa = 1000000*Pa,ms = s/1000,MWb = 1000000*Wb,
       Mg = 1000*kg,Mm = 1000000*m,Mmol = 1000000000*mol,
       Ms = 1000000*s,ns = s/1000000000,ounce = pound_mass/16,
       oz = ounce,Ohm = s*J/C^2,
       pound_force = 32*ft*pound_mass/s^2,
       pound_mass = 200*kg/441,psi = pound_force/inch^2,
       Pa = N/m^2,week = 604800*s,Wb = J/A,yard = 3*feet,
       year = 31557600*s,C = s*A,F = C^2/J,GA = 1000000000*A,
       GC = 1000000000*C,GF = 1000000000*F,GH = 1000000000*H,
       GJ = 1000000000*J,GK = 1000000000*K,GN = 1000000000*N,
       GS = 1000000000*S,GT = 1000000000*T,GV = 1000000000*V,
       GW = 1000000000*W,H = J/A^2,J = m*N,kA = 1000*A,
       kC = 1000*C,kF = 1000*F,kH = 1000*H,kHz = 1000*Hz,
       kJ = 1000*J,kK = 1000*K,kN = 1000*N,kOhm = 1000*Ohm,
       kPa = 1000*Pa,kS = 1000*S,kT = 1000*T,kV = 1000*V,
       kW = 1000*W,kWb = 1000*Wb,mA = A/1000,mC = C/1000,
       mF = F/1000,mH = H/1000,mHz = Hz/1000,mJ = J/1000,
       mK = K/1000,mN = N/1000,mOhm = Ohm/1000,mPa = Pa/1000,
       mS = S/1000,mT = T/1000,mV = V/1000,mW = W/1000,
       mWb = Wb/1000,MA = 1000000*A,MC = 1000000*C,
       MF = 1000000*F,MH = 1000000*H,MJ = 1000000*J,
       MK = 1000000*K,MN = 1000000*N,MS = 1000000*S,
       MT = 1000000*T,MV = 1000000*V,MW = 1000000*W,
       N = kg*m/s^2,R = 5*K/9,S = 1/Ohm,T = J/(m^2*A),V = J/C,
       W = J/s}
</pre></div>

<p>Elementary unit conversions.
</p>
<div class="example">
<pre class="example-preformatted">(%i1) load (&quot;ezunits&quot;)$
(%i2) 1 ` ft `` m;
Computing conversions to base units; may take a moment. 
                            381
(%o2)                       ---- ` m
                            1250
(%i3) %, numer;
(%o3)                      0.3048 ` m
(%i4) 1 ` kg `` lbm;
                            441
(%o4)                       --- ` lbm
                            200
(%i5) %, numer;
(%o5)                      2.205 ` lbm
(%i6) 1 ` W `` Btu/hour;
                           720   Btu
(%o6)                      --- ` ----
                           211   hour
(%i7) %, numer;
                                        Btu
(%o7)               3.412322274881517 ` ----
                                        hour
(%i8) 100 ` degC `` degF;
(%o8)                      212 ` degF
(%i9) -40 ` degF `` degC;
(%o9)                     (- 40) ` degC
(%i10) 1 ` acre*ft `` m^3;
                        60228605349    3
(%o10)                  ----------- ` m
                         48828125
(%i11) %, numer;
                                          3
(%o11)                1233.48183754752 ` m
</pre></div>

<p>Coercing quantities in feet and meters to one or the other.
</p>
<div class="example">
<pre class="example-preformatted">(%i1) load (&quot;ezunits&quot;)$
(%i2) 100 ` m + 100 ` ft;
(%o2)                  100 ` m + 100 ` ft
(%i3) (100 ` m + 100 ` ft) `` ft;
Computing conversions to base units; may take a moment. 
                           163100
(%o3)                      ------ ` ft
                            381
(%i4) %, numer;
(%o4)                428.0839895013123 ` ft
(%i5) (100 ` m + 100 ` ft) `` m;
                            3262
(%o5)                       ---- ` m
                             25
(%i6) %, numer;
(%o6)                      130.48 ` m
</pre></div>

<p>Dimensional analysis to find fundamental dimensions and fundamental units.
</p>
<div class="example">
<pre class="example-preformatted">(%i1) load (&quot;ezunits&quot;)$
(%i2) foo : 1 ` acre * ft;
(%o2)                      1 ` acre ft
(%i3) dimensions (foo);
                                   3
(%o3)                        length
(%i4) fundamental_units (foo);
                                3
(%o4)                          m
(%i5) foo `` m^3;
Computing conversions to base units; may take a moment. 
                        60228605349    3
(%o5)                   ----------- ` m
                         48828125
(%i6) %, numer;
                                          3
(%o6)                 1233.48183754752 ` m
</pre></div>

<p>Declared unit conversions.
</p>
<div class="example">
<pre class="example-preformatted">(%i1) load (&quot;ezunits&quot;)$
(%i2) declare_unit_conversion (MMBtu = 10^6*Btu, kW = 1000*W);
(%o2)                         done
(%i3) declare_unit_conversion (kWh = kW*hour, MWh = 1000*kWh,
                               bell = 1800*s);
(%o3)                         done
(%i4) 1 ` kW*s `` MWh;
Computing conversions to base units; may take a moment. 
                             1
(%o4)                     ------- ` MWh
                          3600000
(%i5) 1 ` kW/m^2 `` MMBtu/bell/ft^2;
                       1306449      MMBtu
(%o5)                 ---------- ` --------
                      8242187500          2
                                   bell ft
</pre></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Package-ezunits">Package ezunits</a>
&middot;
</div>

</dd></dl>

<a class="anchor" id="constvalue"></a><a class="anchor" id="Item_003a-ezunits_002fdeffn_002fconstvalue"></a><dl class="first-deffn">
<dt class="deffn" id="index-constvalue"><span class="category-def">Function: </span><span><strong class="def-name">constvalue</strong> <var class="def-var-arguments">(<var class="var">x</var>)</var><a class="copiable-link" href='#index-constvalue'> &para;</a></span></dt>
<dd>
<p>Shows the value and the units of one of the constants declared by package
<code class="code">physical_constants</code>, which includes a list of physical constants, or
of a new constant declared in package <code class="code">ezunits</code> (see
<code class="code"><a class="ref" href="#declare_005fconstvalue">declare_constvalue</a></code>).
</p>
<p>Note that constant values as recognized by <code class="code">constvalue</code>
are separate from values declared by <code class="code">numerval</code> and
recognized by <code class="code">constantp</code>.
</p>
<p>Example:
</p>
<div class="example">
<pre class="example-preformatted">(%i1) load (&quot;physical_constants&quot;)$
(%i2) constvalue (%G);
                                     3
                                    m
(%o2)                    6.67428 ` -----
                                       2
                                   kg s
(%i3) get ('%G, 'description);
(%o3)           Newtonian constant of gravitation
</pre></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Package-ezunits">Package ezunits</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="declare_005fconstvalue"></a><a class="anchor" id="Item_003a-ezunits_002fdeffn_002fdeclare_005fconstvalue"></a><dl class="first-deffn">
<dt class="deffn" id="index-declare_005fconstvalue"><span class="category-def">Function: </span><span><strong class="def-name">declare_constvalue</strong> <var class="def-var-arguments">(<var class="var">a</var>, <var class="var">x</var>)</var><a class="copiable-link" href='#index-declare_005fconstvalue'> &para;</a></span></dt>
<dd>
<p>Declares the value of a constant to be used in package <code class="code">ezunits</code>. This
function should be loaded with <code class="code">load (&quot;ezunits&quot;)</code>. 
</p>
<p>Example:
</p>
<div class="example">
<pre class="example-preformatted">(%i1) load (&quot;ezunits&quot;)$
(%i2) declare_constvalue (FOO, 100 ` lbm / acre);
                                 lbm
(%o2)                      100 ` ----
                                 acre
(%i3) FOO * (50 ` acre);
(%o3)                     50 FOO ` acre
(%i4) constvalue (%);
(%o4)                      5000 ` lbm
</pre></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Package-ezunits">Package ezunits</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="remove_005fconstvalue"></a><a class="anchor" id="Item_003a-ezunits_002fdeffn_002fremove_005fconstvalue"></a><dl class="first-deffn">
<dt class="deffn" id="index-remove_005fconstvalue"><span class="category-def">Function: </span><span><strong class="def-name">remove_constvalue</strong> <var class="def-var-arguments">(<var class="var">a</var>)</var><a class="copiable-link" href='#index-remove_005fconstvalue'> &para;</a></span></dt>
<dd>
<p>Reverts the effect of <code class="code"><a class="ref" href="#declare_005fconstvalue">declare_constvalue</a></code>. This function should be
loaded with <code class="code">load (&quot;ezunits&quot;)</code>.
</p>
<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Package-ezunits">Package ezunits</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="units"></a><a class="anchor" id="Item_003a-ezunits_002fdeffn_002funits"></a><dl class="first-deffn">
<dt class="deffn" id="index-units"><span class="category-def">Function: </span><span><strong class="def-name">units</strong> <var class="def-var-arguments">(<var class="var">x</var>)</var><a class="copiable-link" href='#index-units'> &para;</a></span></dt>
<dd>
<p>Returns the units of a dimensional quantity <var class="var">x</var>,
or returns 1 if <var class="var">x</var> is nondimensional.
</p>
<p><var class="var">x</var> may be a literal dimensional expression <em class="math tex2jax_process">\(a ` b\)</em>,
a symbol with declared units via <code class="code">declare_units</code>, 
or an expression containing either or both of those.
</p>
<p>This function should be loaded with <code class="code">load (&quot;ezunits&quot;)</code>.
</p>
<p>Example:
</p>
<div class="example">
<pre class="example-preformatted">(%i1) load (&quot;ezunits&quot;)$
(%i2) foo : 100 ` kg;
(%o2)                       100 ` kg
(%i3) bar : x ` m/s;
                                  m
(%o3)                         x ` -
                                  s
(%i4) units (foo);
(%o4)                          kg
(%i5) units (bar);
                                m
(%o5)                           -
                                s
(%i6) units (foo * bar);
                              kg m
(%o6)                         ----
                               s
(%i7) units (foo / bar);
                              kg s
(%o7)                         ----
                               m
(%i8) units (foo^2);
                                 2
(%o8)                          kg
</pre></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Package-ezunits">Package ezunits</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="declare_005funits"></a><a class="anchor" id="Item_003a-ezunits_002fdeffn_002fdeclare_005funits"></a><dl class="first-deffn">
<dt class="deffn" id="index-declare_005funits"><span class="category-def">Function: </span><span><strong class="def-name">declare_units</strong> <var class="def-var-arguments">(<var class="var">a</var>, <var class="var">u</var>)</var><a class="copiable-link" href='#index-declare_005funits'> &para;</a></span></dt>
<dd>
<p>Declares that <code class="code"><a class="ref" href="#units">units</a></code> should return units <var class="var">u</var> for <var class="var">a</var>,
where <var class="var">u</var> is an expression. This function should be loaded with
<code class="code">load (&quot;ezunits&quot;)</code>.
</p>
<p>Example:
</p>
<div class="example">
<pre class="example-preformatted">(%i1) load (&quot;ezunits&quot;)$
(%i2) units (aa);
(%o2)                           1
(%i3) declare_units (aa, J);
(%o3)                           J
(%i4) units (aa);
(%o4)                           J
(%i5) units (aa^2);
                                2
(%o5)                          J
(%i6) foo : 100 ` kg;
(%o6)                       100 ` kg
(%i7) units (aa * foo);
(%o7)                         kg J
</pre></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Package-ezunits">Package ezunits</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="qty"></a><a class="anchor" id="Item_003a-ezunits_002fdeffn_002fqty"></a><dl class="first-deffn">
<dt class="deffn" id="index-qty"><span class="category-def">Function: </span><span><strong class="def-name">qty</strong> <var class="def-var-arguments">(<var class="var">x</var>)</var><a class="copiable-link" href='#index-qty'> &para;</a></span></dt>
<dd>
<p>Returns the nondimensional part of a dimensional quantity <var class="var">x</var>,
or returns <var class="var">x</var> if <var class="var">x</var> is nondimensional.
<var class="var">x</var> may be a literal dimensional expression <em class="math tex2jax_process">\(a ` b\)</em>,
a symbol with declared quantity, 
or an expression containing either or both of those.
</p>
<p>This function should be loaded with <code class="code">load (&quot;ezunits&quot;)</code>.
</p>
<p>Example:
</p>
<div class="example">
<pre class="example-preformatted">(%i1) load (&quot;ezunits&quot;)$
(%i2) foo : 100 ` kg;
(%o2)                       100 ` kg
(%i3) qty (foo);
(%o3)                          100
(%i4) bar : v ` m/s;
                                  m
(%o4)                         v ` -
                                  s
(%i5) foo * bar;
                                  kg m
(%o5)                     100 v ` ----
                                   s
(%i6) qty (foo * bar);
(%o6)                         100 v
</pre></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Package-ezunits">Package ezunits</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="declare_005fqty"></a><a class="anchor" id="Item_003a-ezunits_002fdeffn_002fdeclare_005fqty"></a><dl class="first-deffn">
<dt class="deffn" id="index-declare_005fqty"><span class="category-def">Function: </span><span><strong class="def-name">declare_qty</strong> <var class="def-var-arguments">(<var class="var">a</var>, <var class="var">x</var>)</var><a class="copiable-link" href='#index-declare_005fqty'> &para;</a></span></dt>
<dd>
<p>Declares that <code class="code"><a class="ref" href="#qty">qty</a></code> should return <var class="var">x</var> for symbol <var class="var">a</var>, where
<var class="var">x</var> is a nondimensional quantity. This function should be loaded
with <code class="code">load (&quot;ezunits&quot;)</code>.
</p>
<p>Example:
</p>
<div class="example">
<pre class="example-preformatted">(%i1) load (&quot;ezunits&quot;)$
(%i2) declare_qty (aa, xx);
(%o2)                          xx
(%i3) qty (aa);
(%o3)                          xx
(%i4) qty (aa^2);
                                 2
(%o4)                          xx
(%i5) foo : 100 ` kg;
(%o5)                       100 ` kg
(%i6) qty (aa * foo);
(%o6)                        100 xx
</pre></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Package-ezunits">Package ezunits</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="unitp"></a><a class="anchor" id="Item_003a-ezunits_002fdeffn_002funitp"></a><dl class="first-deffn">
<dt class="deffn" id="index-unitp"><span class="category-def">Function: </span><span><strong class="def-name">unitp</strong> <var class="def-var-arguments">(<var class="var">x</var>)</var><a class="copiable-link" href='#index-unitp'> &para;</a></span></dt>
<dd>
<p>Returns <code class="code">true</code> if <var class="var">x</var> is a literal dimensional expression,
a symbol declared dimensional,
or an expression in which the main operator is declared dimensional.
<code class="code">unitp</code> returns <code class="code">false</code> otherwise.
</p>
<p><code class="code">load (&quot;ezunits&quot;)</code> loads this function.
</p>
<p>Examples:
</p>
<p><code class="code">unitp</code> applied to a literal dimensional expression.
</p>
<div class="example">
<pre class="example-preformatted">(%i1) load (&quot;ezunits&quot;)$
(%i2) unitp (100 ` kg);
(%o2)                         true
</pre></div>

<p><code class="code">unitp</code> applied to a symbol declared dimensional.
</p>
<div class="example">
<pre class="example-preformatted">(%i1) load (&quot;ezunits&quot;)$
(%i2) unitp (foo);
(%o2)                         false
(%i3) declare (foo, dimensional);
(%o3)                         done
(%i4) unitp (foo);
(%o4)                         true
</pre></div>

<p><code class="code">unitp</code> applied to an expression in which the main operator is declared dimensional.
</p>
<div class="example">
<pre class="example-preformatted">(%i1) load (&quot;ezunits&quot;)$
(%i2) unitp (bar (x, y, z));
(%o2)                         false
(%i3) declare (bar, dimensional);
(%o3)                         done
(%i4) unitp (bar (x, y, z));
(%o4)                         true
</pre></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Package-ezunits">Package ezunits</a>
&middot;
</div>

</dd></dl>

<a class="anchor" id="declare_005funit_005fconversion"></a><a class="anchor" id="Item_003a-ezunits_002fdeffn_002fdeclare_005funit_005fconversion"></a><dl class="first-deffn">
<dt class="deffn" id="index-declare_005funit_005fconversion"><span class="category-def">Function: </span><span><strong class="def-name">declare_unit_conversion</strong> <var class="def-var-arguments">(<var class="var">u</var> = <var class="var">v</var>, ...)</var><a class="copiable-link" href='#index-declare_005funit_005fconversion'> &para;</a></span></dt>
<dd>
<p>Appends equations <var class="var">u</var> = <var class="var">v</var>, ... to the list of unit conversions
known to the unit conversion operator <em class="math tex2jax_process">\(`\hbox{}`\)</em>.
<var class="var">u</var> and <var class="var">v</var> are both multiplicative terms,
in which any variables are units,
or both literal dimensional expressions.
</p>
<p>At present, it is necessary to express conversions such that
the left-hand side of each equation is a simple unit
(not a multiplicative expression)
or a literal dimensional expression with the quantity equal to 1
and the unit being a simple unit.
This limitation might be relaxed in future versions.
</p>
<p><code class="code">known_unit_conversions</code> is the list of known unit conversions.
</p>
<p>This function should be loaded with <code class="code">load (&quot;ezunits&quot;)</code>.
</p>
<p>Examples:
</p>
<p>Unit conversions expressed by equations of multiplicative terms.
</p>
<div class="example">
<pre class="example-preformatted">(%i1) load (&quot;ezunits&quot;)$
(%i2) declare_unit_conversion (nautical_mile = 1852 * m,
                               fortnight = 14 * day);
(%o2)                         done
(%i3) 100 ` nautical_mile / fortnight `` m/s;
Computing conversions to base units; may take a moment. 
                            463    m
(%o3)                       ---- ` -
                            3024   s
</pre></div>

<p>Unit conversions expressed by equations of literal dimensional expressions.
</p>
<div class="example">
<pre class="example-preformatted">(%i1) load (&quot;ezunits&quot;)$
(%i2) declare_unit_conversion (1 ` fluid_ounce = 2 ` tablespoon);
(%o2)                         done
(%i3) declare_unit_conversion (1 ` tablespoon = 3 ` teaspoon);
(%o3)                         done
(%i4) 15 ` fluid_ounce `` teaspoon;
Computing conversions to base units; may take a moment. 
(%o4)                     90 ` teaspoon
</pre></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Package-ezunits">Package ezunits</a>
&middot;
</div>

</dd></dl>

<a class="anchor" id="declare_005fdimensions"></a><a class="anchor" id="Item_003a-ezunits_002fdeffn_002fdeclare_005fdimensions"></a><dl class="first-deffn">
<dt class="deffn" id="index-declare_005fdimensions"><span class="category-def">Function: </span><span><strong class="def-name">declare_dimensions</strong> <var class="def-var-arguments">(<var class="var">a_1</var>, <var class="var">d_1</var>, ..., <var class="var">a_n</var>, <var class="var">d_n</var>)</var><a class="copiable-link" href='#index-declare_005fdimensions'> &para;</a></span></dt>
<dd>
<p>Declares <var class="var">a_1</var>, ..., <var class="var">a_n</var> to have dimensions <var class="var">d_1</var>, ...,
<var class="var">d_n</var>, respectively.
</p>
<p>Each <var class="var">a_k</var> is a symbol or a list of symbols.
If it is a list, then every symbol in <var class="var">a_k</var> is declared to have dimension <var class="var">d_k</var>.
</p>
<p><code class="code">load (&quot;ezunits&quot;)</code> loads these functions.
</p>
<p>Examples:
</p>
<div class="example">
<pre class="example-preformatted">(%i1) load (&quot;ezunits&quot;) $
(%i2) declare_dimensions ([x, y, z], length, [t, u], time);
(%o2)                         done
(%i3) dimensions (y^2/u);
                                   2
                             length
(%o3)                        -------
                              time
(%i4) fundamental_units (y^2/u);
0 errors, 0 warnings
                                2
                               m
(%o4)                          --
                               s
</pre></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Package-ezunits">Package ezunits</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="remove_005fdimensions"></a><a class="anchor" id="Item_003a-ezunits_002fdeffn_002fremove_005fdimensions"></a><dl class="first-deffn">
<dt class="deffn" id="index-remove_005fdimensions"><span class="category-def">Function: </span><span><strong class="def-name">remove_dimensions</strong> <var class="def-var-arguments">(<var class="var">a_1</var>, ..., <var class="var">a_n</var>)</var><a class="copiable-link" href='#index-remove_005fdimensions'> &para;</a></span></dt>
<dd>
<p>Reverts the effect of <code class="code">declare_dimensions</code>. This function should be
loaded with <code class="code">load (&quot;ezunits&quot;)</code>.
</p>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Package-ezunits">Package ezunits</a>
&middot;
</div>
</dd></dl>

<a class="anchor" id="declare_005ffundamental_005fdimensions"></a><a class="anchor" id="Item_003a-ezunits_002fdeffn_002fdeclare_005ffundamental_005fdimensions"></a><dl class="first-deffn">
<dt class="deffn" id="index-declare_005ffundamental_005fdimensions"><span class="category-def">Function: </span><span><strong class="def-name">declare_fundamental_dimensions</strong> <var class="def-var-arguments">(<var class="var">d_1</var>, <var class="var">d_2</var>, <var class="var">d_3</var>, ...)</var><a class="copiable-link" href='#index-declare_005ffundamental_005fdimensions'> &para;</a></span></dt>
<dd><a class="anchor" id="Item_003a-ezunits_002fdeffn_002fremove_005ffundamental_005fdimensions"></a></dd><dt class="deffnx def-cmd-deffn" id="index-remove_005ffundamental_005fdimensions"><span class="category-def">Function: </span><span><strong class="def-name">remove_fundamental_dimensions</strong> <var class="def-var-arguments">(<var class="var">d_1</var>, <var class="var">d_2</var>, <var class="var">d_3</var>, ...)</var><a class="copiable-link" href='#index-remove_005ffundamental_005fdimensions'> &para;</a></span></dt>
<dd><a class="anchor" id="Item_003a-ezunits_002fdeffn_002ffundamental_005fdimensions"></a></dd><dt class="deffnx def-cmd-deffn" id="index-fundamental_005fdimensions"><span class="category-def">Global variable: </span><span><strong class="def-name">fundamental_dimensions</strong><a class="copiable-link" href='#index-fundamental_005fdimensions'> &para;</a></span></dt>
<dd>
<p><code class="code">declare_fundamental_dimensions</code> declares fundamental dimensions.
Symbols <var class="var">d_1</var>, <var class="var">d_2</var>, <var class="var">d_3</var>, ... are appended to the list of
fundamental dimensions, if they are not already on the list.
</p>
<p><code class="code">remove_fundamental_dimensions</code> reverts the effect of <code class="code">declare_fundamental_dimensions</code>.
</p>
<p><code class="code">fundamental_dimensions</code> is the list of fundamental dimensions.
By default, the list comprises several physical dimensions.
</p>
<p><code class="code">load (&quot;ezunits&quot;)</code> loads these functions.
</p>
<p>Examples:
</p>
<div class="example">
<pre class="example-preformatted">(%i1) load (&quot;ezunits&quot;) $
(%i2) fundamental_dimensions;
(%o2) [length, mass, time, current, temperature, quantity]
(%i3) declare_fundamental_dimensions (money, cattle, happiness);
(%o3)                         done
(%i4) fundamental_dimensions;
(%o4) [length, mass, time, current, temperature, quantity, 
                                        money, cattle, happiness]
(%i5) remove_fundamental_dimensions (cattle, happiness);
(%o5)                         done
(%i6) fundamental_dimensions;
(%o6) [length, mass, time, current, temperature, quantity, money]
</pre></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Package-ezunits">Package ezunits</a>
&middot;
</div>

</dd></dl>

<a class="anchor" id="declare_005ffundamental_005funits"></a><a class="anchor" id="Item_003a-ezunits_002fdeffn_002fdeclare_005ffundamental_005funits"></a><dl class="first-deffn">
<dt class="deffn" id="index-declare_005ffundamental_005funits"><span class="category-def">Function: </span><span><strong class="def-name">declare_fundamental_units</strong> <var class="def-var-arguments">(<var class="var">u_1</var>, <var class="var">d_1</var>, ..., <var class="var">u_n</var>, <var class="var">d_n</var>)</var><a class="copiable-link" href='#index-declare_005ffundamental_005funits'> &para;</a></span></dt>
<dd><a class="anchor" id="Item_003a-ezunits_002fdeffn_002fremove_005ffundamental_005funits"></a></dd><dt class="deffnx def-cmd-deffn" id="index-remove_005ffundamental_005funits"><span class="category-def">Function: </span><span><strong class="def-name">remove_fundamental_units</strong> <var class="def-var-arguments">(<var class="var">u_1</var>, ..., <var class="var">u_n</var>)</var><a class="copiable-link" href='#index-remove_005ffundamental_005funits'> &para;</a></span></dt>
<dd>
<p><code class="code">declare_fundamental_units</code> declares <var class="var">u_1</var>, ..., <var class="var">u_n</var>
to have dimensions <var class="var">d_1</var>, ..., <var class="var">d_n</var>, respectively.
All arguments must be symbols.
</p>
<p>After calling <code class="code">declare_fundamental_units</code>,
<code class="code">dimensions(<var class="var">u_k</var>)</code> returns <var class="var">d_k</var> for each argument <var class="var">u_1</var>, ..., <var class="var">u_n</var>,
and <code class="code">fundamental_units(<var class="var">d_k</var>)</code> returns <var class="var">u_k</var> for each argument <var class="var">d_1</var>, ..., <var class="var">d_n</var>.
</p>
<p><code class="code">remove_fundamental_units</code> reverts the effect of <code class="code">declare_fundamental_units</code>.
</p>
<p><code class="code">load (&quot;ezunits&quot;)</code> loads these functions.
</p>
<p>Examples:
</p>
<div class="example">
<pre class="example-preformatted">(%i1) load (&quot;ezunits&quot;) $
(%i2) declare_fundamental_dimensions (money, cattle, happiness);
(%o2)                         done
(%i3) declare_fundamental_units (dollar, money, goat, cattle,
                                 smile, happiness);
(%o3)                 [dollar, goat, smile]
(%i4) dimensions (100 ` dollar/goat/km^2);
                             money
(%o4)                    --------------
                                      2
                         cattle length
(%i5) dimensions (x ` smile/kg);
                            happiness
(%o5)                       ---------
                              mass
(%i6) fundamental_units (money*cattle/happiness);
0 errors, 0 warnings
                           dollar goat
(%o6)                      -----------
                              smile
</pre></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Package-ezunits">Package ezunits</a>
&middot;
</div>

</dd></dl>

<a class="anchor" id="dimensions"></a><a class="anchor" id="Item_003a-ezunits_002fdeffn_002fdimensions"></a><dl class="first-deffn">
<dt class="deffn" id="index-dimensions"><span class="category-def">Function: </span><span><strong class="def-name">dimensions</strong> <var class="def-var-arguments">(<var class="var">x</var>)</var><a class="copiable-link" href='#index-dimensions'> &para;</a></span></dt>
<dd><a class="anchor" id="Item_003a-ezunits_002fdeffn_002fdimensions_005fas_005flist"></a></dd><dt class="deffnx def-cmd-deffn" id="index-dimensions_005fas_005flist"><span class="category-def">Function: </span><span><strong class="def-name">dimensions_as_list</strong> <var class="def-var-arguments">(<var class="var">x</var>)</var><a class="copiable-link" href='#index-dimensions_005fas_005flist'> &para;</a></span></dt>
<dd>
<p><code class="code">dimensions</code> returns the dimensions of the dimensional quantity <var class="var">x</var>
as an expression comprising products and powers of base dimensions.
</p>
<p><code class="code">dimensions_as_list</code> returns the dimensions of the dimensional quantity <var class="var">x</var>
as a list, in which each element is an integer which indicates the power of the
corresponding base dimension in the dimensions of <var class="var">x</var>.
</p>
<p><code class="code">load (&quot;ezunits&quot;)</code> loads these functions.
</p>
<p>Examples:
</p>
<div class="example">
<pre class="example-preformatted">(%i1) load (&quot;ezunits&quot;)$
(%i2) dimensions (1000 ` kg*m^2/s^3);
                                2
                          length  mass
(%o2)                     ------------
                                 3
                             time
(%i3) declare_units (foo, acre*ft/hour);
                             acre ft
(%o3)                        -------
                              hour
(%i4) dimensions (foo);
                                   3
                             length
(%o4)                        -------
                              time
</pre></div>

<div class="example">
<pre class="example-preformatted">(%i1) load (&quot;ezunits&quot;)$
(%i2) fundamental_dimensions;
(%o2)  [length, mass, time, charge, temperature, quantity]
(%i3) dimensions_as_list (1000 ` kg*m^2/s^3);
(%o3)                 [2, 1, - 3, 0, 0, 0]
(%i4) declare_units (foo, acre*ft/hour);
                             acre ft
(%o4)                        -------
                              hour
(%i5) dimensions_as_list (foo);
(%o5)                 [3, 0, - 1, 0, 0, 0]
</pre></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Package-ezunits">Package ezunits</a>
&middot;
</div>

</dd></dl>

<a class="anchor" id="fundamental_005funits"></a><a class="anchor" id="Item_003a-ezunits_002fdeffn_002ffundamental_005funits"></a><dl class="first-deffn">
<dt class="deffn" id="index-fundamental_005funits"><span class="category-def">Function: </span><span><strong class="def-name">fundamental_units</strong> <var class="def-var-arguments"><br>&nbsp;&nbsp;&nbsp;&nbsp;<code class="t">fundamental_units</code> (<var class="var">x</var>) <br>&nbsp;&nbsp;&nbsp;&nbsp;<code class="t">fundamental_units</code> ()</var><a class="copiable-link" href='#index-fundamental_005funits'> &para;</a></span></dt>
<dd>
<p><code class="code">fundamental_units(<var class="var">x</var>)</code> returns the units
associated with the fundamental dimensions of <var class="var">x</var>.
as determined by <code class="code">dimensions(<var class="var">x</var>)</code>.
</p>
<p><var class="var">x</var> may be a literal dimensional expression <em class="math tex2jax_process">\(a ` b\)</em>,
a symbol with declared units via <code class="code">declare_units</code>, 
or an expression containing either or both of those.
</p>
<p><code class="code">fundamental_units()</code> returns the list of all known fundamental units,
as declared by <code class="code">declare_fundamental_units</code>.
</p>
<p><code class="code">load (&quot;ezunits&quot;)</code> loads this function.
</p>
<p>Examples:
</p>
<div class="example">
<pre class="example-preformatted">(%i1) load (&quot;ezunits&quot;)$
(%i2) fundamental_units ();
(%o2)                 [m, kg, s, A, K, mol]
(%i3) fundamental_units (100 ` mile/hour);
                                m
(%o3)                           -
                                s
(%i4) declare_units (aa, g/foot^2);
                                g
(%o4)                         -----
                                  2
                              foot
(%i5) fundamental_units (aa);
                               kg
(%o5)                          --
                                2
                               m
</pre></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Package-ezunits">Package ezunits</a>
&middot;
</div>

</dd></dl>

<a class="anchor" id="dimensionless"></a><a class="anchor" id="Item_003a-ezunits_002fdeffn_002fdimensionless"></a><dl class="first-deffn">
<dt class="deffn" id="index-dimensionless"><span class="category-def">Function: </span><span><strong class="def-name">dimensionless</strong> <var class="def-var-arguments">(<var class="var">L</var>)</var><a class="copiable-link" href='#index-dimensionless'> &para;</a></span></dt>
<dd>
<p>Returns a basis for the dimensionless quantities which can be formed
from a list <var class="var">L</var> of dimensional quantities.
</p>
<p><code class="code">load (&quot;ezunits&quot;)</code> loads this function.
</p>
<p>Examples:
</p>
<div class="example">
<pre class="example-preformatted">(%i1) load (&quot;ezunits&quot;) $
(%i2) dimensionless ([x ` m, y ` m/s, z ` s]);
0 errors, 0 warnings
0 errors, 0 warnings
                               y z
(%o2)                         [---]
                                x
</pre></div>

<p>Dimensionless quantities derived from fundamental physical quantities.
Note that the first element on the list
is proportional to the fine-structure constant.
</p>
<div class="example">
<pre class="example-preformatted">(%i1) load (&quot;ezunits&quot;) $
(%i2) load (&quot;physical_constants&quot;) $
(%i3) dimensionless([%h_bar, %m_e, %m_P, %%e, %c, %e_0]);
0 errors, 0 warnings
0 errors, 0 warnings
                              2
                           %%e        %m_e
(%o3)                [--------------, ----]
                      %c %e_0 %h_bar  %m_P
</pre></div>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Package-ezunits">Package ezunits</a>
&middot;
</div>

</dd></dl>

<a class="anchor" id="natural_005funit"></a><a class="anchor" id="Item_003a-ezunits_002fdeffn_002fnatural_005funit"></a><dl class="first-deffn">
<dt class="deffn" id="index-natural_005funit"><span class="category-def">Function: </span><span><strong class="def-name">natural_unit</strong> <var class="def-var-arguments">(<var class="var">expr</var>, [<var class="var">v_1</var>, ..., <var class="var">v_n</var>])</var><a class="copiable-link" href='#index-natural_005funit'> &para;</a></span></dt>
<dd>
<p>Finds exponents <var class="var">e_1</var>, ..., <var class="var">e_n</var> such that
<code class="code">dimension(<var class="var">expr</var>) = dimension(<var class="var">v_1</var>^<var class="var">e_1</var> ... <var class="var">v_n</var>^<var class="var">e_n</var>)</code>.
</p>
<p><code class="code">load (&quot;ezunits&quot;)</code> loads this function.
</p>
<p>Examples:
</p>

<div class=categorybox>
Categories:
<a class="ref" href="Documentation-Categories.html#Category_003a-Package-ezunits">Package ezunits</a>
&middot;
</div>

</dd></dl>



</div>
</div>
<hr>
<div class="nav-panel">
<p>
Next: <a href="maxima_57.html#f90_002dpkg" accesskey="n" rel="next">f90</a>, Previous: <a href="maxima_55.html#engineering_002dformat_002dpkg" accesskey="p" rel="prev">engineering-format</a> &nbsp; [<a href="maxima_toc.html#SEC_Contents" title="Table of contents" rel="contents">Contents</a>][<a href="Function-and-Variable-Index.html" title="Index" rel="index">Index</a>]</p>
</div>


<a href="js_licenses.html" rel="jslicense"><small>JavaScript license information</small></a>
</body>
</html>
